{
  "users": [
    {
      "name": "Admin User",
      "email": "admin@example.com",
      "password": "password",
      "passwordConfirm": "password",
      "role": "admin"
    }
  ],

  "categories": [
    {
      "name": "Accessories",
      "children": ["Key Chain", "Watches", "Sunglasses", "Bags"]
    },
    {
      "name": "Baby Products",
      "children": [
        "Clothing",
        "Footwear",
        "Diapers & Wipes",
        "Feeding & Nursing",
        "Toys",
        "Strollers & Car Seats",
        "Bath & Skincare",
        "Bedding",
        "Furniture",
        "Baby Safety",
        "Health & Care"
      ]
    }
  ],
  "products": [
    {
      "name": "Premium Leather Key Chain",
      "category": "Accessories",
      "subCategory": "Key Chain",
      "description": "Durable leather key chain with metal clasp.",
      "product_details": "This Premium Leather Key Chain is made from top-quality genuine leather, offering exceptional durability and a smooth, luxurious feel. The reinforced metal clasp is polished and designed to securely hold multiple keys, preventing them from falling off. Its compact design fits easily in pockets, purses, or bags, and the ergonomic shape ensures comfort when held in hand. Handmade with precision stitching, it resists wear and tear over time. Perfect for everyday use, it complements both casual and professional styles. The brown leather finish gives it a timeless appeal, while the lightweight construction allows easy portability. Ideal for house, car, or office keys, it combines elegance with functionality. The key chain is suitable for gifting, offering a blend of practical organization and sophisticated design, making it a reliable companion for anyone seeking durability and style.",
      "additional_info": {
        "material": "Genuine Leather",
        "color": "Brown",
        "weight": "50g",
        "dimensions": "7cm x 2cm x 0.5cm",
        "care_instructions": "Wipe with dry cloth; avoid water and chemicals",
        "durability": "Scratch-resistant, wear-resistant",
        "compatibility": "Fits all standard keys",
        "origin": "Handmade in Italy"
      },
      "price": 15,
      "quantity": 100,
      "shippingFee": 15,
      "brand": "KeyMaster",
      "model": "KM-LC01",
      "tags": [{ "name": "Leather" }, { "name": "Key Chain" }],
      "product_type": "simple"
    },
    {
      "name": "Organic Cotton Baby Onesie",
      "category": "Baby Products",
      "subCategory": "Clothing",
      "description": "Soft organic cotton onesie for newborns, gentle on sensitive skin.",
      "product_details": "Made from 100% organic cotton, breathable and soft. Easy snap buttons for quick diaper changes. Durable stitching withstands frequent washing. Hypoallergenic and chemical-free. Comfortable fit for all-day wear. Lightweight and flexible fabric. Stylish design suitable for layering or solo wear. Available in multiple pastel colors. Promotes skin health and comfort. Perfect gift for newborns and infants.",
      "additional_info": {
        "material": "Organic Cotton",
        "color": "Pastel Blue",
        "weight": "80g",
        "brand": "BabySoft",
        "model": "BS-OC01"
      },
      "price": 20,
      "sale_price": 16,
      "on_sale": true,
      "sale_start": "2025-11-05T00:00:00Z",
      "sale_end": "2025-12-05T23:59:59Z",
      "quantity": 100,
      "shippingFee": 15,
      "tags": [
        { "name": "Baby" },
        { "name": "Clothing" },
        { "name": "Organic" }
      ],
      "product_type": "simple"
    },
    {
      "name": "Metal Car Key Chain",
      "category": "Accessories",
      "subCategory": "Key Chain",
      "description": "Heavy-duty stainless steel car key chain.",
      "product_details": "Constructed from premium-grade stainless steel, this Metal Car Key Chain ensures long-lasting strength and corrosion resistance. Its polished surface provides a sleek, modern look while preventing rust. The robust key ring can hold multiple keys securely, and its compact size allows easy attachment to bags, belts, or pockets. Designed for everyday use, it withstands frequent handling and rough conditions without bending or breaking. The ergonomic design ensures comfortable handling, and smooth edges prevent snagging. Perfect for car enthusiasts, it adds a professional and stylish touch to any set of keys. Its lightweight yet durable design makes it ideal for gifting. This key chain combines functionality with a polished metallic aesthetic, ensuring long-term usability and practicality for all key types.",
      "additional_info": {
        "material": "Stainless Steel",
        "color": "Silver",
        "weight": "70g",
        "dimensions": "6.5cm x 1.5cm x 0.8cm",
        "care_instructions": "Wipe with dry or slightly damp cloth; avoid abrasive cleaners",
        "durability": "Corrosion-resistant, scratch-resistant",
        "compatibility": "Compatible with standard keys and key fobs",
        "origin": "Germany"
      },
      "price": 12,
      "quantity": 80,
      "shippingFee": 15,
      "brand": "SteelMate",
      "model": "SM-KC01",
      "tags": [{ "name": "Metal" }, { "name": "Key Chain" }],
      "product_type": "simple"
    },
    {
      "name": "Baby Digital Pulse Oximeter",
      "category": "Baby Products",
      "subCategory": "Health & Care",
      "description": "Non-invasive pulse oximeter to monitor oxygen levels and heart rate.",
      "product_details": "The Baby Digital Pulse Oximeter provides quick and accurate readings of oxygen saturation (SpO2) and pulse rate for infants and toddlers. The fingertip device is non-invasive, lightweight, and comfortable for small fingers. Easy-to-read OLED display shows readings clearly. Made from safe, non-toxic materials suitable for frequent use. Compact and portable, ideal for home or clinical monitoring. Supports early detection of respiratory issues, ensuring timely care. Simple to use, with automatic power-off and low battery alert for convenience and safety.",
      "additional_info": {
        "material": "Non-toxic plastic with soft silicone sensor",
        "color": "White with blue accents",
        "weight": "40g",
        "dimensions": "Length: 7cm, Width: 4cm, Height: 3cm",
        "care_instructions": "Wipe with disinfectant; do not immerse in water",
        "age_range": "0-36 months",
        "brand": "HealthMate",
        "model": "HM-PO01",
        "origin": "USA",
        "battery": "2x AAA included"
      },
      "price": 50,
      "quantity": 40,
      "shippingFee": 15,
      "tags": [{ "name": "Baby" }, { "name": "Pulse Oximeter" }],
      "product_type": "simple"
    },
    {
      "name": "Wooden Engraved Key Chain",
      "category": "Accessories",
      "subCategory": "Key Chain",
      "description": "Eco-friendly wooden key chain with custom engraving option.",
      "product_details": "This Wooden Engraved Key Chain is crafted from natural, sustainable wood, providing a lightweight yet sturdy key-holding solution. Each key chain is hand-sanded and polished to create a smooth, tactile surface. It includes a customizable engraving area suitable for names, logos, or personal messages, making it an ideal gift for loved ones. The natural wood grain ensures every piece is unique, enhancing its aesthetic charm. The attached metal ring is durable and holds multiple keys securely. Designed for daily use, it withstands wear while maintaining structural integrity. Lightweight and eco-friendly, it provides a practical, stylish, and environmentally conscious accessory for organizing house, office, or travel keys.",
      "additional_info": {
        "material": "Natural Wood",
        "color": "Brown",
        "weight": "40g",
        "dimensions": "7cm x 2.5cm x 0.6cm",
        "care_instructions": "Keep dry; avoid direct sunlight; wipe with dry cloth",
        "durability": "Long-lasting, resistant to cracking or splitting",
        "compatibility": "Fits all standard keys",
        "origin": "USA"
      },
      "price": 10,
      "quantity": 120,
      "shippingFee": 15,
      "brand": "EcoKeys",
      "model": "EK-WD01",
      "tags": [{ "name": "Wood" }, { "name": "Engraved" }],
      "product_type": "simple"
    },
    {
      "name": "Eco-Friendly Diaper Pack",
      "category": "Baby Products",
      "subCategory": "Diapers & Wipes",
      "description": "Absorbent and eco-friendly diapers for newborns.",
      "product_details": "Disposable diapers made from biodegradable materials. Soft inner lining to prevent irritation. High absorbency for long-lasting dryness. Hypoallergenic and chemical-free. Adjustable tabs for secure fit. Breathable outer layer for comfort. Dermatologically tested. Lightweight and convenient for travel. Comes in multiple sizes. Easy to dispose responsibly.",
      "additional_info": {
        "material": "Biodegradable Fabric",
        "color": "White",
        "weight": "200g",
        "brand": "EcoBaby",
        "model": "EB-DP01"
      },
      "price": 25,
      "sale_price": 20,
      "on_sale": true,
      "sale_start": "2025-11-05T00:00:00Z",
      "sale_end": "2025-12-05T23:59:59Z",
      "quantity": 150,
      "shippingFee": 15,
      "tags": [
        { "name": "Baby" },
        { "name": "Diapers" },
        { "name": "Eco-Friendly" }
      ],
      "product_type": "simple"
    },
    {
      "name": "Smart Bluetooth Key Finder",
      "category": "Accessories",
      "subCategory": "Key Chain",
      "description": "Smart key chain with Bluetooth tracker for easy locating.",
      "product_details": "This innovative Smart Bluetooth Key Finder combines modern technology with practical design. Featuring Bluetooth connectivity, it pairs with a smartphone app, allowing users to locate lost keys instantly through sound alerts or map tracking. The key chain is lightweight, portable, and compatible with all standard keys. Its durable plastic and metal construction ensures longevity, while a replaceable battery provides months of continuous operation. The compact design fits easily into pockets or bags. Perfect for tech-savvy users and busy individuals, this key chain prevents misplacement of keys, reducing stress and saving time. Its sleek black finish adds a contemporary aesthetic, making it not only functional but stylish. Ideal as a gift or for personal use, it enhances organization and convenience in everyday life.",
      "additional_info": {
        "material": "Plastic + Metal",
        "color": "Black",
        "weight": "30g",
        "dimensions": "5cm x 2cm x 1cm",
        "care_instructions": "Avoid water; wipe with dry cloth; replace battery as needed",
        "durability": "Impact-resistant; long-lasting connectivity",
        "compatibility": "iOS and Android devices",
        "origin": "China"
      },
      "price": 25,
      "quantity": 60,
      "shippingFee": 15,
      "brand": "SmartFind",
      "model": "SF-KC01",
      "tags": [{ "name": "Smart" }, { "name": "Bluetooth" }],
      "product_type": "simple"
    },
    {
      "name": "Bottle Opener Key Chain",
      "category": "Accessories",
      "subCategory": "Key Chain",
      "description": "Multi-purpose key chain with built-in bottle opener.",
      "product_details": "The Bottle Opener Key Chain is designed for practicality and convenience, combining a durable aluminum key holder with an integrated bottle opener. Its compact, lightweight design allows for easy attachment to pockets, belts, or bags. The anodized finish resists scratches and corrosion, ensuring a long-lasting aesthetic appeal. Ideal for outdoor enthusiasts, party-goers, or everyday users, it securely holds multiple keys while providing quick access to a bottle opener when needed. Smooth edges ensure safe handling, and its ergonomic design allows easy operation without straining fingers. This functional key chain also serves as a stylish accessory, combining utility with modern design. Perfect for gifting or personal use, it is a versatile addition to daily carry items.",
      "additional_info": {
        "material": "Aluminum",
        "color": "Red",
        "weight": "35g",
        "dimensions": "6cm x 2cm x 0.5cm",
        "care_instructions": "Wipe clean; avoid abrasive cleaners",
        "durability": "Corrosion-resistant; scratch-resistant",
        "compatibility": "Holds all standard keys",
        "origin": "USA"
      },
      "price": 8,
      "quantity": 200,
      "shippingFee": 15,
      "brand": "HandyTools",
      "model": "HT-KC01",
      "tags": [{ "name": "Bottle Opener" }, { "name": "Key Chain" }],
      "product_type": "simple"
    },
    {
      "name": "LED Flashlight Key Chain",
      "category": "Accessories",
      "subCategory": "Key Chain",
      "description": "Compact key chain with built-in LED flashlight.",
      "product_details": "This LED Flashlight Key Chain is a multifunctional accessory designed for convenience and safety. Featuring a bright LED light powered by a replaceable battery, it helps users locate keyholes or objects in the dark. The durable plastic housing ensures the flashlight remains sturdy under daily wear, while its lightweight design allows it to fit comfortably on key rings, backpacks, or purses. Ergonomically designed, the push-button switch allows easy operation with one hand. Perfect for outdoor activities, night-time commutes, or emergencies. Its sleek blue finish enhances its visual appeal while maintaining practicality. Built for durability, it resists scratches and minor impacts, making it a reliable everyday tool. This LED key chain is an excellent gift option, combining functionality, style, and safety for all users.",
      "additional_info": {
        "material": "Durable Plastic",
        "color": "Blue",
        "weight": "25g",
        "dimensions": "5cm x 2cm x 1cm",
        "care_instructions": "Avoid water; replace batteries as needed; wipe with dry cloth",
        "durability": "Impact-resistant, long-lasting LED",
        "compatibility": "Fits standard key rings",
        "origin": "China"
      },
      "price": 9,
      "quantity": 150,
      "shippingFee": 15,
      "brand": "LightMate",
      "model": "LM-KC01",
      "tags": [{ "name": "LED" }, { "name": "Flashlight" }],
      "product_type": "simple"
    },
    {
      "name": "Car Logo Key Chain",
      "category": "Accessories",
      "subCategory": "Key Chain",
      "description": "Stylish car brand logo key chain for auto lovers.",
      "product_details": "The Car Logo Key Chain is designed for automobile enthusiasts who appreciate style and functionality. Made from high-quality zinc alloy with a polished finish, it displays the car brand logo with precision engraving. The key ring is robust and capable of holding multiple keys securely. The smooth edges and ergonomic design ensure comfortable handling without snagging clothing or bags. Lightweight yet durable, it is suitable for daily use and withstands wear, scratches, and minor impacts. Ideal for both personal use and gifting, this key chain adds a premium touch to any key set. The sleek metallic finish pairs well with casual and professional accessories. Perfect for home, office, or car keys, it combines aesthetic appeal with practical functionality, making it a must-have for car lovers.",
      "additional_info": {
        "material": "Zinc Alloy",
        "color": "Silver/Black",
        "weight": "45g",
        "dimensions": "6cm x 2.5cm x 0.5cm",
        "care_instructions": "Wipe with dry cloth; avoid abrasive cleaners",
        "durability": "Scratch-resistant, corrosion-resistant",
        "compatibility": "Fits standard key rings",
        "origin": "Germany"
      },
      "price": 20,
      "quantity": 70,
      "shippingFee": 15,
      "brand": "AutoCharm",
      "model": "AC-KC01",
      "tags": [{ "name": "Car" }, { "name": "Key Chain" }],
      "product_type": "simple"
    },
    {
      "name": "Fabric Lanyard Key Chain",
      "category": "Accessories",
      "subCategory": "Key Chain",
      "description": "Durable fabric lanyard key chain for easy carrying.",
      "product_details": "This Fabric Lanyard Key Chain is crafted from premium nylon fabric, offering excellent durability and flexibility. The detachable clip allows for easy attachment to keys, bags, or ID cards. Its ergonomic design ensures comfortable handling while preventing wear or fraying. Lightweight yet sturdy, it withstands everyday use and is suitable for both adults and children. The smooth, high-quality stitching prevents unraveling, and the vibrant black color provides a modern, sleek appearance. Ideal for office, school, or casual use, it keeps keys organized and easily accessible. This lanyard key chain combines practicality, style, and portability, making it an essential accessory for anyone who wants their keys handy without sacrificing design. Perfect as a gift or for personal use, it enhances organization in daily routines.",
      "additional_info": {
        "material": "Nylon Fabric",
        "color": "Black",
        "weight": "30g",
        "dimensions": "10cm x 2cm x 0.5cm",
        "care_instructions": "Hand wash recommended; avoid high heat; air dry",
        "durability": "Fray-resistant, long-lasting",
        "compatibility": "Holds standard keys and small accessories",
        "origin": "China"
      },
      "price": 7,
      "quantity": 180,
      "shippingFee": 15,
      "brand": "CarryEase",
      "model": "CE-KC01",
      "tags": [{ "name": "Lanyard" }, { "name": "Key Chain" }],
      "product_type": "simple"
    },
    {
      "name": "Custom Photo Key Chain",
      "category": "Accessories",
      "subCategory": "Key Chain",
      "description": "Personalized key chain with a photo insert option.",
      "product_details": "The Custom Photo Key Chain is designed for personalization, allowing users to insert a favorite photo, logo, or image. Made from durable plastic, it is lightweight yet sturdy, protecting the photo from damage. The key ring is robust, able to hold multiple keys securely. Smooth edges prevent scratches, and the compact size ensures portability in pockets, bags, or purses. Ideal as a sentimental gift for loved ones, friends, or family, it adds a personal touch to everyday essentials. The key chain is suitable for house, car, or office keys and combines practicality with emotional value. Its transparent frame enhances the visibility of the inserted photo, while durable construction ensures long-lasting use. Perfect for commemorating special memories while keeping keys organized.",
      "additional_info": {
        "material": "Plastic",
        "color": "Transparent",
        "weight": "28g",
        "dimensions": "6cm x 3cm x 0.7cm",
        "care_instructions": "Wipe clean; avoid water; do not bend or crush",
        "durability": "Long-lasting plastic, scratch-resistant",
        "compatibility": "Fits standard keys",
        "origin": "USA"
      },
      "price": 6,
      "quantity": 250,
      "shippingFee": 15,
      "brand": "Memories",
      "model": "MM-KC01",
      "tags": [{ "name": "Photo" }, { "name": "Custom" }],
      "product_type": "simple"
    },
    {
      "name": "Minimalist Magnetic Key Chain",
      "category": "Accessories",
      "subCategory": "Key Chain",
      "description": "Modern key chain with magnetic quick-release design.",
      "product_details": "The Minimalist Magnetic Key Chain combines modern design with functionality. Made from stainless steel and leather, it features a magnetic quick-release mechanism that allows users to detach keys effortlessly with one hand. The compact, sleek design fits comfortably in pockets or bags, while the smooth edges prevent snagging. Lightweight yet durable, it withstands everyday use and minor impacts. Perfect for tech-savvy professionals and minimalists, it offers an innovative solution for organizing keys efficiently. Its gray finish adds elegance and style, complementing any set of keys. This key chain is also an excellent gift choice, blending practicality with contemporary design. Ideal for both home and office keys, it ensures convenience, safety, and aesthetic appeal in daily life.",
      "additional_info": {
        "material": "Stainless Steel + Leather",
        "color": "Gray",
        "weight": "42g",
        "dimensions": "7cm x 2cm x 0.6cm",
        "care_instructions": "Wipe with dry cloth; avoid water and harsh chemicals",
        "durability": "Magnetic mechanism tested for long life; scratch-resistant surface",
        "compatibility": "Holds standard keys",
        "origin": "Germany"
      },
      "price": 22,
      "quantity": 90,
      "shippingFee": 15,
      "brand": "MagnoKey",
      "model": "MK-KC01",
      "tags": [{ "name": "Magnetic" }, { "name": "Key Chain" }],
      "product_type": "simple"
    },
    {
      "name": "Luxury Stainless Steel Wrist Watch",
      "category": "Accessories",
      "subCategory": "Watches",
      "description": "Elegant stainless steel wrist watch with leather strap and sapphire crystal.",
      "product_details": "This Luxury Stainless Steel Wrist Watch combines timeless elegance with modern precision. Crafted from high-quality stainless steel, it offers exceptional durability and corrosion resistance. The genuine leather strap ensures comfort and a premium look, while the sapphire crystal face protects against scratches and daily wear. Featuring quartz movement, the watch guarantees accurate timekeeping, and its water resistance up to 50 meters allows worry-free use in rainy conditions or during brief water exposure. The classic analog design with luminous hands ensures readability even in low-light conditions. Perfect for formal occasions or daily wear, this watch exemplifies sophistication, precision, and reliability. Its ergonomic design provides a secure fit, while the polished finish enhances its aesthetic appeal. Ideal as a gift for watch enthusiasts or professionals seeking style and functionality in one accessory.",
      "additional_info": {
        "material": "Stainless Steel + Leather",
        "color": "Silver + Black",
        "weight": "120g",
        "dimensions": "40mm dial diameter, 10mm thickness",
        "care_instructions": "Avoid chemicals; clean with soft cloth; replace battery as needed",
        "durability": "Scratch-resistant sapphire crystal, water-resistant up to 50m",
        "brand": "TimeMaster",
        "model": "TM-Classic",
        "origin": "Switzerland"
      },
      "price": 250,
      "quantity": 50,
      "shippingFee": 15,
      "tags": [{ "name": "Luxury" }, { "name": "Watch" }],
      "product_type": "simple"
    },
    {
      "name": "Sport Chronograph Watch",
      "category": "Accessories",
      "subCategory": "Watches",
      "description": "Durable sport watch with chronograph and silicone strap.",
      "product_details": "The Sport Chronograph Watch is designed for active lifestyles, combining precision timekeeping with rugged durability. Featuring multiple chronograph functions, it allows users to measure elapsed time, set lap timers, and monitor performance. The durable silicone strap ensures comfort and flexibility during workouts or outdoor activities. The stainless steel casing provides protection against shocks and minor impacts. Water-resistant up to 100 meters, it is suitable for swimming and water sports. The large, easy-to-read dial with luminous markers enhances visibility in low-light environments. Lightweight yet sturdy, this watch balances style and functionality, making it ideal for athletes, adventurers, and casual users alike. Its sporty design complements both casual attire and activewear, while the precise quartz movement guarantees reliable performance.",
      "additional_info": {
        "material": "Stainless Steel + Silicone",
        "color": "Black + Red",
        "weight": "110g",
        "dimensions": "42mm dial diameter, 12mm thickness",
        "care_instructions": "Clean strap with mild soap; avoid extreme temperatures",
        "durability": "Shock-resistant, water-resistant up to 100m",
        "brand": "ActiveTime",
        "model": "AT-Chrono01",
        "origin": "Japan"
      },
      "price": 180,
      "quantity": 60,
      "shippingFee": 15,
      "tags": [{ "name": "Sport" }, { "name": "Chronograph" }],
      "product_type": "simple"
    },
    {
      "name": "Minimalist Leather Strap Watch",
      "category": "Accessories",
      "subCategory": "Watches",
      "description": "Sleek minimalist watch with genuine leather strap.",
      "product_details": "The Minimalist Leather Strap Watch is perfect for individuals who appreciate simple yet sophisticated design. Featuring a slim dial with a clean, uncluttered face, it emphasizes elegance and readability. The genuine leather strap adds comfort and a premium feel, molding perfectly to the wrist over time. The stainless steel casing provides durability while maintaining a lightweight feel. Water-resistant to a limited degree, it can withstand accidental splashes or light rain. Its reliable quartz movement ensures precise timekeeping without frequent adjustments. Ideal for both casual and formal occasions, this watch exudes understated elegance. The minimalist design ensures versatility, pairing effortlessly with various outfits, while the high-quality materials provide long-lasting performance. A great choice for anyone seeking style and simplicity in one accessory.",
      "additional_info": {
        "material": "Stainless Steel + Leather",
        "color": "Black + Brown",
        "weight": "85g",
        "dimensions": "38mm dial diameter, 8mm thickness",
        "care_instructions": "Avoid water; wipe leather strap regularly; keep away from chemicals",
        "durability": "Scratch-resistant glass, durable leather strap",
        "brand": "SleekTime",
        "model": "ST-Minimal01",
        "origin": "Italy"
      },
      "price": 120,
      "quantity": 70,
      "shippingFee": 15,
      "tags": [{ "name": "Minimalist" }, { "name": "Leather" }],
      "product_type": "simple"
    },
    {
      "name": "Digital Fitness Tracker Watch",
      "category": "Accessories",
      "subCategory": "Watches",
      "description": "Smart digital watch with fitness tracking and heart rate monitoring.",
      "product_details": "The Digital Fitness Tracker Watch is a versatile accessory for health-conscious individuals. Equipped with a heart rate monitor, step counter, sleep tracker, and calorie tracking, it allows users to monitor their daily fitness activities. The touch-screen display is responsive and easy to navigate, showing detailed metrics and notifications from connected smartphones. The silicone strap provides comfort during workouts, while the durable casing protects the internal components from shocks and sweat. Water-resistant up to 50 meters, it can handle swimming and daily water exposure. The rechargeable battery offers several days of usage per charge. Ideal for both fitness enthusiasts and tech-savvy users, this watch combines modern functionality with practicality, helping users achieve their health goals while staying stylish.",
      "additional_info": {
        "material": "Plastic + Silicone",
        "color": "Black",
        "weight": "60g",
        "dimensions": "40mm dial diameter, 10mm thickness",
        "care_instructions": "Clean with dry cloth; avoid extreme heat; charge regularly",
        "durability": "Water-resistant up to 50m, shock-resistant",
        "brand": "FitPulse",
        "model": "FP-Digital01",
        "origin": "China"
      },
      "price": 90,
      "quantity": 80,
      "shippingFee": 15,
      "tags": [{ "name": "Digital" }, { "name": "Fitness" }],
      "product_type": "simple"
    },
    {
      "name": "Baby Ear Thermometer",
      "category": "Baby Products",
      "subCategory": "Health & Care",
      "description": "Quick ear thermometer for accurate and gentle temperature measurement.",
      "product_details": "The Baby Ear Thermometer allows rapid and precise temperature readings via the ear canal, providing comfort and convenience for both babies and parents. Features a flexible probe tip and non-toxic, hypoallergenic materials. Memory function stores recent readings, and a clear LCD screen displays the result in seconds. Soft beep alerts when measurement is complete. Safe for daily use, easy to clean, and portable. Helps monitor fever or illness accurately without disturbing the baby, ideal for home or travel.",
      "additional_info": {
        "material": "BPA-free plastic with soft tip",
        "color": "White and green",
        "weight": "35g",
        "dimensions": "Length: 14cm, Width: 2.5cm, Height: 2cm",
        "care_instructions": "Wipe probe with alcohol swab before and after use",
        "age_range": "0-36 months",
        "brand": "HealthMate",
        "model": "HM-ET01",
        "origin": "USA",
        "battery": "1x AAA included"
      },
      "price": 28,
      "quantity": 60,
      "shippingFee": 15,
      "tags": [{ "name": "Baby" }, { "name": "Ear Thermometer" }],
      "product_type": "simple"
    },
    {
      "name": "Classic Gold Analog Watch",
      "category": "Accessories",
      "subCategory": "Watches",
      "description": "Timeless analog watch with gold-plated stainless steel casing.",
      "product_details": "The Classic Gold Analog Watch exudes luxury and sophistication with its gold-plated stainless steel casing and elegant dial design. Featuring a durable mineral glass face, it protects against scratches and daily wear. The analog display with Roman numeral markers ensures readability while enhancing its vintage appeal. The comfortable leather strap complements the gold casing, adding a refined touch to any outfit. Water-resistant up to 30 meters, it can handle accidental splashes. This watch is ideal for formal events, business meetings, or as a statement accessory. Lightweight yet durable, it is suitable for daily wear, combining elegance, precision, and practicality. The quartz movement guarantees accurate timekeeping, making it a reliable companion for professionals and fashion-conscious individuals alike.",
      "additional_info": {
        "material": "Gold-plated Stainless Steel + Leather",
        "color": "Gold + Brown",
        "weight": "110g",
        "dimensions": "42mm dial diameter, 9mm thickness",
        "care_instructions": "Avoid chemicals; wipe with soft cloth; keep away from water",
        "durability": "Scratch-resistant glass, water-resistant",
        "brand": "GoldTime",
        "model": "GT-Analog01",
        "origin": "Switzerland"
      },
      "price": 300,
      "quantity": 40,
      "shippingFee": 15,
      "tags": [{ "name": "Gold" }, { "name": "Analog" }],
      "product_type": "simple"
    },
    {
      "name": "Automatic Mechanical Watch",
      "category": "Accessories",
      "subCategory": "Watches",
      "description": "Luxury automatic watch with visible movement and leather strap.",
      "product_details": "The Automatic Mechanical Watch features a transparent case back, allowing wearers to admire the intricate automatic movement inside. Made with stainless steel casing and a premium leather strap, it offers durability and a classic style. No battery is required, as the watch winds automatically with wrist movement. The scratch-resistant glass protects the dial, while luminous hands ensure readability in low light. Water-resistant up to 30 meters, it withstands occasional splashes. Ideal for watch collectors and enthusiasts, this timepiece combines technical mastery, elegance, and convenience. Lightweight and ergonomic, it fits comfortably on the wrist, and its polished finish enhances sophistication. Perfect as a gift or personal accessory for formal and casual occasions.",
      "additional_info": {
        "material": "Stainless Steel + Leather",
        "color": "Silver + Black",
        "weight": "130g",
        "dimensions": "41mm dial diameter, 12mm thickness",
        "care_instructions": "Avoid water; clean with soft cloth; avoid strong magnets",
        "durability": "Scratch-resistant glass, durable leather strap",
        "brand": "MechMaster",
        "model": "MM-Auto01",
        "origin": "Switzerland"
      },
      "price": 350,
      "quantity": 30,
      "shippingFee": 15,
      "tags": [{ "name": "Automatic" }, { "name": "Mechanical" }],
      "product_type": "simple"
    },
    {
      "name": "Diver's Professional Watch",
      "category": "Accessories",
      "subCategory": "Watches",
      "description": "Professional diver's watch with 200m water resistance and rotating bezel.",
      "product_details": "The Diver's Professional Watch is designed for underwater adventures, featuring a unidirectional rotating bezel, luminous hands, and markers for precise time measurement. Water-resistant up to 200 meters, it is suitable for diving and swimming activities. The stainless steel casing provides durability, while the scratch-resistant sapphire crystal ensures long-lasting clarity. The silicone strap offers flexibility and comfort, even in wet conditions. Featuring automatic movement, it eliminates the need for batteries and ensures reliable performance. Ideal for professional divers and water sports enthusiasts, this watch combines rugged construction, functional features, and modern design. Lightweight yet durable, it is both a practical tool and a stylish accessory, perfect for everyday wear or marine activities.",
      "additional_info": {
        "material": "Stainless Steel + Silicone",
        "color": "Black + Blue",
        "weight": "140g",
        "dimensions": "44mm dial diameter, 13mm thickness",
        "care_instructions": "Rinse after saltwater exposure; wipe dry; avoid strong impacts",
        "durability": "Scratch-resistant sapphire crystal, 200m water-resistant",
        "brand": "DeepSea",
        "model": "DS-Diver01",
        "origin": "Japan"
      },
      "price": 400,
      "quantity": 25,
      "shippingFee": 15,
      "tags": [{ "name": "Diver" }, { "name": "Professional" }],
      "product_type": "simple"
    },
    {
      "name": "Pilot Aviation Watch",
      "category": "Accessories",
      "subCategory": "Watches",
      "description": "Aviation watch with large dial, luminous hands, and chronograph features.",
      "product_details": "The Pilot Aviation Watch is designed for pilots and aviation enthusiasts, featuring a large, easy-to-read dial with luminous hands and markers for excellent visibility. The chronograph functions allow precise time measurement, while the stainless steel casing provides durability. The leather strap ensures comfort and a secure fit. Water-resistant up to 50 meters, it can handle accidental splashes. Featuring quartz movement, the watch guarantees accurate timekeeping. Its classic aviation design, combined with ergonomic construction and premium materials, makes it ideal for professionals and style-conscious individuals. Lightweight yet robust, this watch offers precision, reliability, and elegance, suitable for both air travel and everyday wear.",
      "additional_info": {
        "material": "Stainless Steel + Leather",
        "color": "Black + Brown",
        "weight": "125g",
        "dimensions": "46mm dial diameter, 11mm thickness",
        "care_instructions": "Avoid water; clean with soft cloth; store in dry place",
        "durability": "Scratch-resistant glass, water-resistant up to 50m",
        "brand": "AeroTime",
        "model": "AT-Pilot01",
        "origin": "Germany"
      },
      "price": 320,
      "quantity": 35,
      "shippingFee": 15,
      "tags": [{ "name": "Aviation" }, { "name": "Chronograph" }],
      "product_type": "simple"
    },
    {
      "name": "Skeleton Mechanical Watch",
      "category": "Accessories",
      "subCategory": "Watches",
      "description": "Luxury skeleton watch with exposed mechanical movement and leather strap.",
      "product_details": "The Skeleton Mechanical Watch showcases its intricate inner workings through a transparent dial, allowing watch enthusiasts to admire the craftsmanship of the mechanical movement. Crafted from stainless steel with a genuine leather strap, it combines luxury and durability. The scratch-resistant glass protects the dial, while the ergonomic design ensures a comfortable fit. Water-resistant up to 30 meters, it withstands splashes and light rain. Perfect for collectors and fashion-conscious individuals, it merges aesthetic beauty with technical precision. Lightweight yet durable, it is ideal for formal events or daily wear. The polished finish enhances its premium appearance, and the quartz accuracy ensures reliable timekeeping. A perfect gift for watch aficionados or as a personal style statement.",
      "additional_info": {
        "material": "Stainless Steel + Leather",
        "color": "Silver + Black",
        "weight": "135g",
        "dimensions": "42mm dial diameter, 12mm thickness",
        "care_instructions": "Avoid water; clean with soft cloth; handle carefully",
        "durability": "Scratch-resistant glass, long-lasting leather strap",
        "brand": "SkeletonMaster",
        "model": "SM-Skel01",
        "origin": "Switzerland"
      },
      "price": 380,
      "quantity": 30,
      "shippingFee": 15,
      "tags": [{ "name": "Skeleton" }, { "name": "Mechanical" }],
      "product_type": "simple"
    },
    {
      "name": "Smart Hybrid Watch",
      "category": "Accessories",
      "subCategory": "Watches",
      "description": "Hybrid smartwatch combining analog display with smart notifications.",
      "product_details": "The Smart Hybrid Watch merges classic analog style with modern smart features. It displays traditional hour and minute hands while syncing with a smartphone to provide notifications for calls, messages, and social apps. Fitness tracking, sleep monitoring, and activity reminders enhance daily health management. The stainless steel casing provides durability, and the silicone strap ensures comfort during all-day wear. Water-resistant up to 50 meters, it can handle splashes and light rain. Lightweight yet sophisticated, it offers seamless integration of technology and design, appealing to tech-savvy users who prefer a classic aesthetic. Ideal for both professional and casual settings, this watch combines convenience, style, and reliability in one accessory.",
      "additional_info": {
        "material": "Stainless Steel + Silicone",
        "color": "Silver + Black",
        "weight": "95g",
        "dimensions": "42mm dial diameter, 10mm thickness",
        "care_instructions": "Avoid extreme heat; clean strap regularly; charge as needed",
        "durability": "Water-resistant up to 50m, scratch-resistant glass",
        "brand": "SmartTime",
        "model": "ST-Hybrid01",
        "origin": "USA"
      },
      "price": 200,
      "quantity": 50,
      "shippingFee": 15,
      "tags": [{ "name": "Hybrid" }, { "name": "Smartwatch" }],
      "product_type": "simple"
    },
    {
      "name": "Elegant Rose Gold Watch",
      "category": "Accessories",
      "subCategory": "Watches",
      "description": "Stylish rose gold stainless steel watch with leather strap.",
      "product_details": "The Elegant Rose Gold Watch is a sophisticated accessory featuring a rose gold-plated stainless steel casing and a genuine leather strap for comfort and elegance. The minimalist dial with subtle markers provides easy readability while maintaining a refined aesthetic. Scratch-resistant glass protects the dial, ensuring long-lasting durability. Water-resistant up to 30 meters, it withstands accidental splashes and light rain. Quartz movement guarantees accurate timekeeping. Perfect for formal occasions, business meetings, or as a stylish everyday accessory, it combines elegance, reliability, and practicality. Lightweight yet robust, it sits comfortably on the wrist, making it ideal for both men and women seeking a chic, fashionable timepiece.",
      "additional_info": {
        "material": "Rose Gold-plated Stainless Steel + Leather",
        "color": "Rose Gold + Brown",
        "weight": "105g",
        "dimensions": "40mm dial diameter, 9mm thickness",
        "care_instructions": "Avoid chemicals; wipe with soft cloth; keep leather conditioned",
        "durability": "Scratch-resistant glass, durable leather strap",
        "brand": "RoseTime",
        "model": "RT-Elegant01",
        "origin": "Italy"
      },
      "price": 280,
      "quantity": 45,
      "shippingFee": 15,
      "tags": [{ "name": "Rose Gold" }, { "name": "Analog" }],
      "product_type": "simple"
    },
    {
      "name": "Classic Aviator Sunglasses",
      "category": "Accessories",
      "subCategory": "Sunglasses",
      "description": "Timeless aviator sunglasses with UV400 protection and metal frame.",
      "product_details": "These Classic Aviator Sunglasses feature a sleek metal frame and high-quality lenses providing 100% UV400 protection, effectively shielding eyes from harmful UVA and UVB rays. The lightweight construction ensures comfort for all-day wear, while the adjustable nose pads allow a perfect fit for different face shapes. The lenses are polarized to reduce glare, making them ideal for driving, outdoor sports, or casual outings. The durable metal frame combines style and longevity, resistant to minor impacts and daily use. With their iconic aviator design, these sunglasses remain a fashionable accessory across generations, effortlessly complementing casual, business, and summer attire. Perfect for anyone seeking style, protection, and comfort in a single accessory.",
      "additional_info": {
        "material": "Metal + Polycarbonate lenses",
        "color": "Black frame, Grey lenses",
        "weight": "60g",
        "dimensions": "Lens width: 58mm, Bridge: 14mm, Temple: 135mm",
        "care_instructions": "Clean with soft microfiber cloth; avoid chemicals; store in case",
        "durability": "Scratch-resistant lenses, sturdy metal frame",
        "brand": "SunStyle",
        "model": "SS-AV01",
        "origin": "Italy"
      },
      "price": 80,
      "quantity": 50,
      "shippingFee": 15,
      "tags": [{ "name": "Sunglasses" }, { "name": "UV Protection" }],
      "product_type": "simple"
    },
    {
      "name": "Round Retro Sunglasses",
      "category": "Accessories",
      "subCategory": "Sunglasses",
      "description": "Vintage round sunglasses with tinted lenses and metal frame.",
      "product_details": "Round Retro Sunglasses provide a classic, vintage-inspired look with fully tinted lenses that block harmful UV rays. The polished metal frame is lightweight yet durable, offering comfort and longevity. Perfect for casual outings, festivals, or beach trips, these sunglasses enhance style while providing optimal eye protection. The slightly oversized round lenses are designed to complement multiple face shapes, giving a fashionable yet functional accessory. Polarized lenses reduce glare, ensuring clear vision even in bright sunlight. Ideal for trendsetters and fashion enthusiasts, these sunglasses combine retro design, comfort, and eye protection. A stylish choice for daily wear or as a statement accessory during outdoor events.",
      "additional_info": {
        "material": "Metal + Polycarbonate lenses",
        "color": "Gold frame, Brown lenses",
        "weight": "55g",
        "dimensions": "Lens width: 50mm, Bridge: 20mm, Temple: 140mm",
        "care_instructions": "Clean lenses with microfiber cloth; avoid dropping or bending frame",
        "durability": "Scratch-resistant lenses, metal frame resists bending",
        "brand": "RetroVision",
        "model": "RV-Round01",
        "origin": "France"
      },
      "price": 75,
      "quantity": 60,
      "shippingFee": 15,
      "tags": [{ "name": "Round" }, { "name": "Retro" }],
      "product_type": "simple"
    },
    {
      "name": "Cat Eye Fashion Sunglasses",
      "category": "Accessories",
      "subCategory": "Sunglasses",
      "description": "Stylish cat eye sunglasses with polarized lenses for glare reduction.",
      "product_details": "Cat Eye Fashion Sunglasses offer a chic, retro-inspired silhouette with curved frames that accentuate facial features. The polarized lenses reduce glare and protect eyes from harmful UVA and UVB rays. Crafted from high-quality acetate and metal accents, these sunglasses are lightweight, comfortable, and durable for long-term use. Perfect for beach outings, shopping, or social events, they provide a bold fashion statement while ensuring vision clarity. The UV400-rated lenses ensure complete eye protection, while the sturdy hinges maintain the frame’s structural integrity. Ideal for fashion-conscious individuals, these sunglasses combine functionality, elegance, and trendsetting design.",
      "additional_info": {
        "material": "Acetate + Polycarbonate lenses + Metal hinges",
        "color": "Black frame, Dark Grey lenses",
        "weight": "50g",
        "dimensions": "Lens width: 53mm, Bridge: 18mm, Temple: 135mm",
        "care_instructions": "Use microfiber cloth for cleaning; avoid high heat",
        "durability": "Polarized lenses, reinforced metal hinges",
        "brand": "StyleEye",
        "model": "SE-Cat01",
        "origin": "Italy"
      },
      "price": 85,
      "quantity": 55,
      "shippingFee": 15,
      "tags": [{ "name": "Cat Eye" }, { "name": "Fashion" }],
      "product_type": "simple"
    },
    {
      "name": "Sport Wraparound Sunglasses",
      "category": "Accessories",
      "subCategory": "Sunglasses",
      "description": "Aerodynamic wraparound sunglasses with shatterproof lenses for sports.",
      "product_details": "Sport Wraparound Sunglasses are designed for high-performance activities, offering a snug, aerodynamic fit that stays secure during sports. The shatterproof polycarbonate lenses provide complete UV400 protection while reducing glare and enhancing visual clarity. Lightweight yet durable, the frame contours to the face for optimal coverage, preventing debris or wind from reaching the eyes. Ideal for running, cycling, or outdoor adventures, these sunglasses combine functionality with style. Adjustable nose pads and flexible temple tips ensure maximum comfort, even during extended use. The sporty design and high-performance lenses make these sunglasses perfect for athletes or active individuals seeking both protection and modern aesthetics.",
      "additional_info": {
        "material": "Polycarbonate + Rubber",
        "color": "Black frame, Grey lenses",
        "weight": "45g",
        "dimensions": "Lens width: 60mm, Bridge: 15mm, Temple: 130mm",
        "care_instructions": "Rinse with water after use; wipe with microfiber cloth; store in case",
        "durability": "Shatterproof lenses, flexible rubber frame",
        "brand": "ActiveView",
        "model": "AV-Wrap01",
        "origin": "USA"
      },
      "price": 90,
      "quantity": 50,
      "shippingFee": 15,
      "tags": [{ "name": "Sport" }, { "name": "Wraparound" }],
      "product_type": "simple"
    },
    {
      "name": "Polarized Classic Square Sunglasses",
      "category": "Accessories",
      "subCategory": "Sunglasses",
      "description": "Square-frame sunglasses with polarized lenses for glare reduction.",
      "product_details": "Polarized Classic Square Sunglasses provide superior glare reduction, making them perfect for driving, outdoor work, or leisure. The sturdy acetate frame ensures comfort and long-term durability, while the UV400 lenses protect eyes from harmful rays. The square design complements most face shapes, offering both style and functionality. Lightweight construction allows all-day wear without discomfort, and the polished finish adds a touch of sophistication. Ideal for fashion-conscious individuals or professionals seeking practical sun protection, these sunglasses merge style, comfort, and high-performance lens technology. Perfect for daily use or as a travel accessory.",
      "additional_info": {
        "material": "Acetate + Polarized Polycarbonate lenses",
        "color": "Tortoise frame, Brown lenses",
        "weight": "55g",
        "dimensions": "Lens width: 55mm, Bridge: 17mm, Temple: 140mm",
        "care_instructions": "Clean with microfiber cloth; avoid dropping or bending frame",
        "durability": "Polarized lenses, scratch-resistant frame",
        "brand": "VisionPro",
        "model": "VP-Square01",
        "origin": "Italy"
      },
      "price": 95,
      "quantity": 60,
      "shippingFee": 15,
      "tags": [{ "name": "Square" }, { "name": "Polarized" }],
      "product_type": "simple"
    },
    {
      "name": "Oversized Fashion Sunglasses",
      "category": "Accessories",
      "subCategory": "Sunglasses",
      "description": "Trendy oversized sunglasses with gradient UV400 lenses.",
      "product_details": "Oversized Fashion Sunglasses feature a bold, contemporary design with wide frames and gradient lenses that provide 100% UV400 protection. The lightweight acetate construction ensures comfortable all-day wear, while the oversized lenses shield the eyes from sunlight at multiple angles. Perfect for fashion-forward individuals, these sunglasses enhance style while maintaining full functionality. The durable hinges and polished finish provide long-lasting elegance. Ideal for beach outings, city walks, or special events, they combine glamour, eye protection, and comfort. A statement accessory that complements both casual and chic ensembles, ensuring the wearer stands out with sophistication.",
      "additional_info": {
        "material": "Acetate + Polycarbonate lenses",
        "color": "Black frame, Gradient Grey lenses",
        "weight": "65g",
        "dimensions": "Lens width: 62mm, Bridge: 18mm, Temple: 140mm",
        "care_instructions": "Wipe with microfiber cloth; avoid dropping; store in case",
        "durability": "Scratch-resistant lenses, reinforced frame",
        "brand": "GlamVision",
        "model": "GV-Oversized01",
        "origin": "Italy"
      },
      "price": 100,
      "quantity": 45,
      "shippingFee": 15,
      "tags": [{ "name": "Oversized" }, { "name": "Fashion" }],
      "product_type": "simple"
    },
    {
      "name": "Mirrored Lens Aviator Sunglasses",
      "category": "Accessories",
      "subCategory": "Sunglasses",
      "description": "Aviator sunglasses with reflective mirrored lenses and metal frame.",
      "product_details": "Mirrored Lens Aviator Sunglasses combine classic aviator styling with mirrored polycarbonate lenses, providing enhanced glare reduction and full UV400 protection. The lightweight metal frame ensures comfortable wear throughout the day, while adjustable nose pads allow a custom fit. Ideal for outdoor activities, driving, or casual wear, the mirrored lenses offer both protection and a bold, stylish appearance. Polarization reduces reflective glare, enhancing clarity and comfort. The durable construction ensures longevity, while the timeless aviator design complements a wide range of outfits. Perfect for fashion-conscious individuals seeking both style and functional eye protection.",
      "additional_info": {
        "material": "Metal + Mirrored Polycarbonate lenses",
        "color": "Silver frame, Blue mirrored lenses",
        "weight": "60g",
        "dimensions": "Lens width: 58mm, Bridge: 14mm, Temple: 135mm",
        "care_instructions": "Clean lenses with microfiber cloth; avoid chemicals; store in case",
        "durability": "Scratch-resistant lenses, sturdy metal frame",
        "brand": "Reflecta",
        "model": "RF-Aviator01",
        "origin": "Italy"
      },
      "price": 85,
      "quantity": 50,
      "shippingFee": 15,
      "tags": [{ "name": "Mirrored" }, { "name": "Aviator" }],
      "product_type": "simple"
    },
    {
      "name": "Retro Square Sunglasses",
      "category": "Accessories",
      "subCategory": "Sunglasses",
      "description": "Vintage-inspired square sunglasses with UV protection.",
      "product_details": "Retro Square Sunglasses offer a fashionable yet practical design, featuring high-quality lenses that block 100% of harmful UVA and UVB rays. The acetate frame is sturdy, lightweight, and shaped to complement a variety of face types. Perfect for casual outings or city walks, these sunglasses merge vintage aesthetics with modern comfort. Polarized lenses reduce glare, providing clear vision even in bright sunlight. Durable hinges and scratch-resistant materials ensure long-lasting performance. Ideal for individuals seeking a combination of retro charm, eye protection, and everyday wearability.",
      "additional_info": {
        "material": "Acetate + Polycarbonate lenses",
        "color": "Tortoise frame, Dark Brown lenses",
        "weight": "55g",
        "dimensions": "Lens width: 54mm, Bridge: 17mm, Temple: 140mm",
        "care_instructions": "Clean with microfiber cloth; avoid extreme heat",
        "durability": "Scratch-resistant lenses, reinforced frame",
        "brand": "RetroStyle",
        "model": "RS-Square01",
        "origin": "France"
      },
      "price": 80,
      "quantity": 50,
      "shippingFee": 15,
      "tags": [{ "name": "Retro" }, { "name": "Square" }],
      "product_type": "simple"
    },
    {
      "name": "Classic Wayfarer Sunglasses",
      "category": "Accessories",
      "subCategory": "Sunglasses",
      "description": "Iconic wayfarer sunglasses with polarized lenses for everyday use.",
      "product_details": "Classic Wayfarer Sunglasses feature a timeless design suitable for all occasions. The polarized lenses reduce glare and provide 100% UV400 protection. The sturdy acetate frame ensures long-lasting durability while remaining lightweight and comfortable. Ideal for casual, professional, or travel wear, these sunglasses combine classic style with modern lens technology. Scratch-resistant lenses maintain clarity, while the reinforced hinges provide additional frame stability. Perfect for fashion-conscious individuals seeking style, comfort, and eye protection in one accessory.",
      "additional_info": {
        "material": "Acetate + Polarized Polycarbonate lenses",
        "color": "Black frame, Dark Grey lenses",
        "weight": "55g",
        "dimensions": "Lens width: 52mm, Bridge: 18mm, Temple: 145mm",
        "care_instructions": "Clean with microfiber cloth; avoid dropping or bending frame",
        "durability": "Polarized lenses, durable frame",
        "brand": "WayStyle",
        "model": "WS-Classic01",
        "origin": "Italy"
      },
      "price": 90,
      "quantity": 60,
      "shippingFee": 15,
      "tags": [{ "name": "Wayfarer" }, { "name": "Polarized" }],
      "product_type": "simple"
    },
    {
      "name": "Gradient Lens Cat Eye Sunglasses",
      "category": "Accessories",
      "subCategory": "Sunglasses",
      "description": "Chic cat eye sunglasses with gradient lenses and UV protection.",
      "product_details": "Gradient Lens Cat Eye Sunglasses combine retro-inspired design with modern eye protection. The gradient polycarbonate lenses provide 100% UV400 protection and reduce glare. The acetate frame is lightweight and contoured for comfort, while reinforced hinges enhance durability. Perfect for social outings, shopping, or outdoor events, these sunglasses add a fashionable touch to any outfit. The cat eye silhouette complements facial features, offering elegance and style. Ideal for those seeking both functionality and trendy aesthetics in a daily wearable accessory.",
      "additional_info": {
        "material": "Acetate + Polycarbonate lenses",
        "color": "Black frame, Gradient Brown lenses",
        "weight": "50g",
        "dimensions": "Lens width: 53mm, Bridge: 18mm, Temple: 135mm",
        "care_instructions": "Clean lenses with microfiber cloth; avoid heat; store in case",
        "durability": "Scratch-resistant lenses, reinforced frame",
        "brand": "FashionEyes",
        "model": "FE-Cat01",
        "origin": "Italy"
      },
      "price": 95,
      "quantity": 55,
      "shippingFee": 15,
      "tags": [{ "name": "Cat Eye" }, { "name": "Gradient" }],
      "product_type": "simple"
    },
    {
      "name": "Elegant Leather Tote Bag",
      "category": "Accessories",
      "subCategory": "Bags",
      "description": "Spacious leather tote bag perfect for everyday use and work.",
      "product_details": "The Elegant Leather Tote Bag is designed for both style and functionality. Crafted from high-quality genuine leather, it features multiple compartments to organize essentials such as laptops, notebooks, wallets, and personal items. The smooth leather exterior is complemented by reinforced stitching for long-lasting durability. Lightweight and comfortable, it includes sturdy handles for easy shoulder or hand carry. Ideal for work, shopping, or casual outings, this tote combines elegance with practicality. The interior lining protects belongings while adding a touch of sophistication. Timeless design makes it a versatile accessory for women seeking fashion and utility in one premium bag.",
      "additional_info": {
        "material": "Genuine Leather + Polyester lining",
        "color": "Tan",
        "weight": "700g",
        "dimensions": "Height: 30cm, Width: 40cm, Depth: 15cm",
        "care_instructions": "Wipe with damp cloth; condition leather occasionally; avoid moisture",
        "durability": "Reinforced stitching, high-quality leather, sturdy handles",
        "brand": "BagMaster",
        "model": "BM-Tote01",
        "origin": "Italy"
      },
      "price": 120,
      "quantity": 30,
      "shippingFee": 15,
      "tags": [{ "name": "Tote" }, { "name": "Leather" }],
      "product_type": "simple"
    },
    {
      "name": "Baby First Aid Kit",
      "category": "Baby Products",
      "subCategory": "Health & Care",
      "description": "Comprehensive first aid kit for babies, includes essential health items.",
      "product_details": "Includes thermometers, nail clippers, medicine droppers, antiseptic wipes, baby scissors, and bandages. Compact and portable. Safe for infants and toddlers. Easy to store and access. Non-toxic and child-safe materials. Essential for home and travel. Lightweight and durable case. Helps parents respond to minor injuries and health issues quickly. Convenient organization compartments for easy use.",
      "additional_info": {
        "material": "Plastic",
        "color": "Blue",
        "weight": "500g",
        "brand": "BabyCare",
        "model": "BC-FA01"
      },
      "price": 35,
      "sale_price": 28,
      "on_sale": true,
      "sale_start": "2025-11-05T00:00:00Z",
      "sale_end": "2025-12-05T23:59:59Z",
      "quantity": 40,
      "shippingFee": 15,
      "tags": [
        { "name": "Baby" },
        { "name": "Health" },
        { "name": "First Aid" }
      ],
      "product_type": "simple"
    },
    {
      "name": "Luxury Leather Backpack",
      "category": "Accessories",
      "subCategory": "Bags",
      "description": "Premium leather backpack suitable for work, school, or travel.",
      "product_details": "The Luxury Leather Backpack is a versatile accessory designed to carry essentials securely and stylishly. Made from top-grain leather, it provides a soft yet durable exterior, resistant to scratches and daily wear. Multiple compartments, including a padded laptop sleeve and front organizer pockets, allow easy access to electronics, documents, and personal items. Adjustable padded shoulder straps ensure comfortable carrying even for extended periods. The interior is lined with premium fabric for protection and style. Ideal for professionals, students, and travelers, this backpack combines practicality, fashion, and quality craftsmanship in a single sophisticated design.",
      "additional_info": {
        "material": "Top-grain Leather + Fabric lining",
        "color": "Dark Brown",
        "weight": "900g",
        "dimensions": "Height: 42cm, Width: 32cm, Depth: 16cm",
        "care_instructions": "Wipe leather with damp cloth; avoid overloading; keep away from moisture",
        "durability": "Scratch-resistant leather, reinforced stitching, padded straps",
        "brand": "BagMaster",
        "model": "BM-Backpack01",
        "origin": "Italy"
      },
      "price": 180,
      "quantity": 25,
      "shippingFee": 15,
      "tags": [{ "name": "Backpack" }, { "name": "Leather" }],
      "product_type": "simple"
    },
    {
      "name": "Stylish Crossbody Bag",
      "category": "Accessories",
      "subCategory": "Bags",
      "description": "Compact crossbody bag perfect for casual outings and travel.",
      "product_details": "The Stylish Crossbody Bag is lightweight, convenient, and ideal for carrying essentials like phones, wallets, and keys. Made from high-quality leather, it features a smooth finish and elegant stitching. The adjustable strap allows for customized comfort, worn across the body or over the shoulder. Inside, multiple small compartments and pockets ensure organized storage, while the secure zipper closure keeps belongings safe. Perfect for shopping, travel, or casual daily use, this bag blends fashion, utility, and durability. Its timeless design makes it suitable for a variety of outfits and occasions, offering both convenience and style in a premium accessory.",
      "additional_info": {
        "material": "Leather + Fabric lining",
        "color": "Black",
        "weight": "400g",
        "dimensions": "Height: 20cm, Width: 25cm, Depth: 8cm",
        "care_instructions": "Wipe leather with soft cloth; avoid moisture; keep away from direct sunlight",
        "durability": "Reinforced stitching, sturdy zipper, premium leather",
        "brand": "BagMaster",
        "model": "BM-Cross01",
        "origin": "Italy"
      },
      "price": 90,
      "quantity": 40,
      "shippingFee": 15,
      "tags": [{ "name": "Crossbody" }, { "name": "Leather" }],
      "product_type": "simple"
    },
    {
      "name": "Soft Infant Booties",
      "category": "Baby Products",
      "subCategory": "Footwear",
      "description": "Comfortable and cozy booties for newborns and infants.",
      "product_details": "Made from soft plush fabric with non-slip soles. Gentle on baby feet. Elastic opening for easy wear and secure fit. Lightweight and breathable. Ideal for indoor use and nursery. Machine washable and durable. Available in multiple colors. Protects and warms tiny feet. Promotes natural movement. Perfect for daily wear or gifting.",
      "additional_info": {
        "material": "Plush Fabric",
        "color": "Pink",
        "weight": "50g",
        "brand": "LittleSteps",
        "model": "LS-BB01"
      },
      "price": 12,
      "sale_price": 10,
      "on_sale": true,
      "sale_start": "2025-11-05T00:00:00Z",
      "sale_end": "2025-12-05T23:59:59Z",
      "quantity": 120,
      "shippingFee": 15,
      "tags": [
        { "name": "Baby" },
        { "name": "Footwear" },
        { "name": "Booties" }
      ],
      "product_type": "simple"
    },
    {
      "name": "Premium Shoulder Bag",
      "category": "Accessories",
      "subCategory": "Bags",
      "description": "Elegant leather shoulder bag designed for work and daily use.",
      "product_details": "The Premium Shoulder Bag combines elegance and practicality. Crafted from supple leather, it offers a smooth, luxurious feel and long-lasting durability. The spacious interior includes multiple compartments for organization, including a secure zip pocket for valuables. Padded handles provide comfortable carrying, and the detachable strap offers versatility. Ideal for office use, meetings, or casual outings, it balances functionality and style. Reinforced stitching and high-quality hardware ensure long-term reliability. This shoulder bag is perfect for professionals seeking a sophisticated, stylish, and durable leather accessory that complements formal or casual attire.",
      "additional_info": {
        "material": "Leather + Polyester lining",
        "color": "Burgundy",
        "weight": "650g",
        "dimensions": "Height: 28cm, Width: 35cm, Depth: 12cm",
        "care_instructions": "Wipe with damp cloth; condition leather periodically; store in dust bag",
        "durability": "Reinforced stitching, durable hardware, premium leather",
        "brand": "BagMaster",
        "model": "BM-Shoulder01",
        "origin": "Italy"
      },
      "price": 140,
      "quantity": 30,
      "shippingFee": 15,
      "tags": [{ "name": "Shoulder" }, { "name": "Leather" }],
      "product_type": "simple"
    },
    {
      "name": "Chic Leather Handbag",
      "category": "Accessories",
      "subCategory": "Bags",
      "description": "Sophisticated leather handbag suitable for office or formal events.",
      "product_details": "The Chic Leather Handbag offers a refined design with a luxurious feel. Made from premium leather, it features elegant stitching, a spacious main compartment, and inner pockets for organization. The top handles provide comfortable carrying, while a detachable strap allows for versatility. Ideal for professional or formal occasions, it combines functionality with classic style. The interior lining protects belongings, and the secure zipper closure ensures safety. Reinforced hardware and durable leather guarantee longevity, making this handbag a stylish and practical accessory for women seeking elegance and reliability in a single product.",
      "additional_info": {
        "material": "Premium Leather + Fabric lining",
        "color": "Navy Blue",
        "weight": "600g",
        "dimensions": "Height: 25cm, Width: 32cm, Depth: 12cm",
        "care_instructions": "Wipe leather with soft cloth; avoid exposure to moisture; store in dust bag",
        "durability": "Durable leather, reinforced stitching, secure zipper",
        "brand": "BagMaster",
        "model": "BM-Handbag01",
        "origin": "Italy"
      },
      "price": 130,
      "quantity": 35,
      "shippingFee": 15,
      "tags": [{ "name": "Handbag" }, { "name": "Leather" }],
      "product_type": "simple"
    },
    {
      "name": "Compact Leather Sling Bag",
      "category": "Accessories",
      "subCategory": "Bags",
      "description": "Lightweight sling bag for casual use or travel.",
      "product_details": "The Compact Leather Sling Bag is perfect for hands-free convenience during travel or daily outings. Crafted from high-quality leather, it features a soft exterior, secure zipper compartments, and adjustable straps for comfort. The interior is lined with durable fabric and includes small pockets for organization. Ideal for carrying essentials like phones, wallets, and small gadgets, it combines style, practicality, and durability. The lightweight design ensures ease of use, while the sleek, modern look makes it a fashionable accessory for both men and women seeking a versatile leather bag.",
      "additional_info": {
        "material": "Leather + Fabric lining",
        "color": "Brown",
        "weight": "350g",
        "dimensions": "Height: 22cm, Width: 28cm, Depth: 7cm",
        "care_instructions": "Clean leather with soft cloth; avoid overstuffing; store away from moisture",
        "durability": "Durable stitching, sturdy zipper, quality leather",
        "brand": "BagMaster",
        "model": "BM-Sling01",
        "origin": "Italy"
      },
      "price": 85,
      "quantity": 40,
      "shippingFee": 15,
      "tags": [{ "name": "Sling" }, { "name": "Leather" }],
      "product_type": "simple"
    },
    {
      "name": "Leather Braided Key Chain",
      "category": "Accessories",
      "subCategory": "Key Chain",
      "description": "Premium braided leather key chain with sturdy metal clasp.",
      "product_details": "Handcrafted braided leather provides a stylish and comfortable grip. Durable metal clasp ensures keys stay secure. Lightweight and portable. Resistant to wear and tear. Ideal for daily use or gifting. Smooth texture prevents scratches on keys. Elegant design complements modern accessories. Long-lasting and flexible leather. Compatible with multiple key types. Easy to clean and maintain.",
      "additional_info": {
        "material": "Leather & Metal",
        "color": "Dark Brown",
        "weight": "50g",
        "brand": "KeyMaster",
        "model": "KM-LB02"
      },
      "price": 30,
      "sale_price": 25,
      "on_sale": true,
      "sale_start": "2025-11-05T00:00:00Z",
      "sale_end": "2025-12-05T23:59:59Z",
      "quantity": 120,
      "shippingFee": 15,
      "tags": [
        { "name": "Key Chain" },
        { "name": "Leather" },
        { "name": "Braided" }
      ],
      "product_type": "simple"
    },
    {
      "name": "Titanium Key Chain",
      "category": "Accessories",
      "subCategory": "Key Chain",
      "description": "Lightweight and durable titanium key chain with a sleek modern design.",
      "product_details": "Made from high-quality titanium, corrosion-resistant, extremely strong. Smooth finish ensures comfortable handling. Key ring securely holds multiple keys. Minimalist design perfect for everyday use. Resistant to bending or breaking. Compact and lightweight for portability. Ideal as a gift or personal use. Rust-proof and long-lasting. Attention to detail in craftsmanship. Easy to clean and maintain. Stylish yet functional.",
      "additional_info": {
        "material": "Titanium",
        "color": "Gunmetal Gray",
        "weight": "45g",
        "brand": "KeyTech",
        "model": "KT-TI01",
        "water_resistant": "Yes"
      },
      "price": 32,
      "sale_price": 28,
      "on_sale": true,
      "sale_start": "2025-11-05T00:00:00Z",
      "sale_end": "2025-12-05T23:59:59Z",
      "quantity": 150,
      "shippingFee": 15,
      "tags": [
        { "name": "Key Chain" },
        { "name": "Titanium" },
        { "name": "Durable" }
      ],
      "product_type": "simple"
    },
    {
      "name": "Professional Leather Laptop Bag",
      "category": "Accessories",
      "subCategory": "Bags",
      "description": "Premium leather laptop bag with multiple compartments and padding.",
      "product_details": "Professional Leather Laptop Bag is designed for business and professional use, featuring a padded compartment for laptops up to 15.6 inches, multiple organizer pockets, and a durable leather exterior. The adjustable shoulder strap and top handles offer comfort and versatility. Interior compartments keep documents, gadgets, and personal items organized and secure. High-quality leather ensures longevity, while reinforced stitching provides durability. Perfect for commuting, office meetings, or travel, this laptop bag combines functionality, professionalism, and premium style in one sophisticated accessory.",
      "additional_info": {
        "material": "Genuine Leather + Fabric lining",
        "color": "Black",
        "weight": "1.2kg",
        "dimensions": "Height: 30cm, Width: 42cm, Depth: 12cm",
        "care_instructions": "Wipe leather with damp cloth; condition periodically; avoid moisture",
        "durability": "Reinforced stitching, durable leather, padded compartments",
        "brand": "BagMaster",
        "model": "BM-Laptop01",
        "origin": "Italy"
      },
      "price": 200,
      "quantity": 20,
      "shippingFee": 15,
      "tags": [{ "name": "Laptop" }, { "name": "Leather" }],
      "product_type": "simple"
    },
    {
      "name": "Baby Digital Scale",
      "category": "Baby Products",
      "subCategory": "Health & Care",
      "description": "Accurate digital scale for monitoring infant weight at home.",
      "product_details": "The Baby Digital Scale provides precise weight measurements for infants and toddlers, supporting healthy growth tracking. Designed with a curved, comfortable platform, it ensures baby safety during weighing. Made from non-toxic, durable materials with an easy-to-read LCD display. Features include tare function, memory storage, and automatic shut-off. Lightweight and portable, suitable for home or clinical use. Helps parents monitor growth trends and detect potential health issues early. Compact design ensures easy storage, while anti-slip pads provide stability during use.",
      "additional_info": {
        "material": "BPA-free plastic",
        "color": "White",
        "weight": "1.2kg",
        "dimensions": "Length: 30cm, Width: 20cm, Height: 5cm",
        "care_instructions": "Wipe with damp cloth; avoid immersion in water",
        "age_range": "0-36 months",
        "brand": "HealthMate",
        "model": "HM-DS01",
        "origin": "USA",
        "battery": "2x AAA included"
      },
      "price": 55,
      "quantity": 35,
      "shippingFee": 15,
      "tags": [{ "name": "Baby" }, { "name": "Digital Scale" }],
      "product_type": "simple"
    },
    {
      "name": "Travel Leather Duffel Bag",
      "category": "Accessories",
      "subCategory": "Bags",
      "description": "Spacious leather duffel bag ideal for weekend trips or travel.",
      "product_details": "The Travel Leather Duffel Bag offers generous storage space with a durable leather exterior and a lined interior. Multiple compartments and pockets help organize clothing, accessories, and essentials. Comfortable handles and a detachable shoulder strap provide versatility and convenience for carrying. Reinforced stitching and quality zippers enhance longevity and reliability. Ideal for short trips, gym use, or business travel, this duffel bag combines practicality, style, and durability. The elegant leather finish ensures a sophisticated look, making it a premium travel companion for frequent travelers seeking fashion and functionality.",
      "additional_info": {
        "material": "Genuine Leather + Fabric lining",
        "color": "Dark Brown",
        "weight": "1.5kg",
        "dimensions": "Height: 28cm, Width: 50cm, Depth: 22cm",
        "care_instructions": "Wipe exterior with soft cloth; condition leather periodically; avoid moisture",
        "durability": "Reinforced stitching, durable handles, sturdy zippers",
        "brand": "BagMaster",
        "model": "BM-Duffel01",
        "origin": "Italy"
      },
      "price": 250,
      "quantity": 15,
      "shippingFee": 15,
      "tags": [{ "name": "Duffel" }, { "name": "Travel" }],
      "product_type": "simple"
    },
    {
      "name": "Baby Grooming Kit",
      "category": "Baby Products",
      "subCategory": "Health & Care",
      "description": "Complete grooming kit including nail clippers, combs, and scissors for infants.",
      "product_details": "The Baby Grooming Kit includes ergonomically designed nail clippers, soft hair brushes, combs, scissors, and other essentials to care for an infant’s delicate hair and nails. All items are made from non-toxic, BPA-free, and hypoallergenic materials to ensure safety. Compact and organized, it can be used at home or carried during travel. Easy to clean, sterilize, and store. Promotes hygiene and grooming habits while preventing accidental cuts or injuries. Ideal for daily use, providing parents with all necessary grooming tools in one convenient kit.",
      "additional_info": {
        "material": "BPA-free plastic and stainless steel",
        "color": "Blue and white",
        "weight": "150g",
        "dimensions": "Case length: 15cm, Width: 10cm, Height: 3cm",
        "care_instructions": "Wipe tools with disinfectant; do not immerse metal parts in water",
        "age_range": "0-36 months",
        "brand": "SafeHealth",
        "model": "SH-GK01",
        "origin": "USA",
        "portable": "Yes"
      },
      "price": 25,
      "quantity": 70,
      "shippingFee": 15,
      "tags": [{ "name": "Baby" }, { "name": "Grooming Kit" }],
      "product_type": "simple"
    },
    {
      "name": "Casual Canvas Leather Hybrid Bag",
      "category": "Accessories",
      "subCategory": "Bags",
      "description": "Stylish hybrid bag with canvas and leather combination for casual use.",
      "product_details": "The Casual Canvas Leather Hybrid Bag combines the ruggedness of canvas with the elegance of leather accents. Multiple compartments, secure zipper closures, and adjustable straps provide functionality for daily use. The bag is lightweight yet durable, suitable for commuting, casual outings, or travel. The interior is lined for protection of belongings, and the leather detailing enhances the aesthetic appeal. Perfect for those who want a trendy, practical, and long-lasting bag that balances casual style with premium touches. Ideal for students, professionals, and travelers alike seeking a unique accessory.",
      "additional_info": {
        "material": "Canvas + Leather + Fabric lining",
        "color": "Olive Green + Brown Leather",
        "weight": "800g",
        "dimensions": "Height: 32cm, Width: 40cm, Depth: 14cm",
        "care_instructions": "Spot clean canvas; wipe leather accents; avoid soaking",
        "durability": "Reinforced stitching, durable canvas, leather accents",
        "brand": "BagMaster",
        "model": "BM-Hybrid01",
        "origin": "Italy"
      },
      "price": 150,
      "quantity": 25,
      "shippingFee": 15,
      "tags": [{ "name": "Canvas" }, { "name": "Hybrid" }],
      "product_type": "simple"
    },
    {
      "name": "Premium Leather Clutch Bag",
      "category": "Accessories",
      "subCategory": "Bags",
      "description": "Elegant clutch bag for formal events and evening outings.",
      "product_details": "The Premium Leather Clutch Bag is crafted for sophistication and practicality. High-quality leather provides a soft touch and luxurious appearance. The compact interior offers space for essentials like phones, cards, and makeup items. Magnetic closure ensures security while maintaining sleek aesthetics. Ideal for parties, formal events, or evening outings, the clutch blends fashion with functionality. Reinforced stitching and premium hardware guarantee durability. Its minimalist yet elegant design makes it a versatile accessory, complementing various outfits while offering a stylish and functional solution for carrying essentials on-the-go.",
      "additional_info": {
        "material": "Genuine Leather + Fabric lining",
        "color": "Maroon",
        "weight": "300g",
        "dimensions": "Height: 15cm, Width: 25cm, Depth: 5cm",
        "care_instructions": "Wipe with soft cloth; avoid moisture; store in dust bag",
        "durability": "Reinforced stitching, sturdy magnetic closure, premium leather",
        "brand": "BagMaster",
        "model": "BM-Clutch01",
        "origin": "Italy"
      },
      "price": 95,
      "quantity": 40,
      "shippingFee": 15,
      "tags": [{ "name": "Clutch" }, { "name": "Leather" }],
      "product_type": "simple"
    },
    {
      "name": "Baby Nasal Aspirator",
      "category": "Baby Products",
      "subCategory": "Health & Care",
      "description": "Safe and effective nasal aspirator for clearing baby's nasal passages.",
      "product_details": "The Baby Nasal Aspirator is designed to safely clear nasal congestion in infants and toddlers. Made from soft, medical-grade silicone, it gently suctions mucus without causing discomfort. The ergonomic design ensures ease of use for parents, while multiple tips accommodate different ages. Easy to disassemble and clean, it is dishwasher safe or can be sterilized. Non-toxic and BPA-free, it promotes healthy breathing, better sleep, and comfort for babies. Ideal for use during colds, allergies, or congestion, this device provides a practical and safe solution for everyday baby health care needs.",
      "additional_info": {
        "material": "Medical-grade silicone",
        "color": "Transparent",
        "weight": "30g",
        "dimensions": "Length: 12cm, Width: 3cm, Height: 2cm",
        "care_instructions": "Wash after every use; sterilize as needed",
        "age_range": "0-36 months",
        "brand": "HealthMate",
        "model": "HM-NA01",
        "origin": "USA",
        "portable": "Yes"
      },
      "price": 12,
      "quantity": 100,
      "shippingFee": 15,
      "tags": [{ "name": "Baby" }, { "name": "Nasal Aspirator" }],
      "product_type": "simple"
    },
    {
      "name": "Baby Medicine Dispenser",
      "category": "Baby Products",
      "subCategory": "Health & Care",
      "description": "Easy-to-use medicine dispenser for accurate baby dosage.",
      "product_details": "The Baby Medicine Dispenser allows parents to safely administer liquid medication with precision. Made from BPA-free, non-toxic materials, it ensures accurate dosing and prevents spills. Features an ergonomic design for comfort and control, and includes multiple measurement markings for different ages. Easy to clean, sterilize, and store. Promotes safe and stress-free medication administration for infants and toddlers, ensuring the correct dosage every time. Ideal for home use, daycare, and travel. Compact, portable, and hygienic, this dispenser is an essential health care accessory for parents.",
      "additional_info": {
        "material": "BPA-free plastic",
        "color": "White with blue markings",
        "weight": "25g",
        "dimensions": "Length: 10cm, Width: 2cm, Height: 2cm",
        "care_instructions": "Disassemble and wash after each use; sterilize if needed",
        "age_range": "0-36 months",
        "brand": "SafeHealth",
        "model": "SH-MD01",
        "origin": "USA",
        "portable": "Yes"
      },
      "price": 8,
      "quantity": 120,
      "shippingFee": 15,
      "tags": [{ "name": "Baby" }, { "name": "Medicine Dispenser" }],
      "product_type": "simple"
    },
    {
      "name": "Soft Cotton Baby Romper",
      "category": "Baby Products",
      "subCategory": "Clothing",
      "description": "Comfortable cotton romper for newborns and infants.",
      "product_details": "The Soft Cotton Baby Romper is crafted from 100% premium cotton, ensuring a soft, breathable, and gentle touch on delicate baby skin. Designed with snap buttons along the inseam for easy diaper changes, it provides convenience and comfort. Reinforced stitching makes it durable through multiple washes, while the lightweight fabric ensures comfort for playtime, sleep, or outings. Adorable prints and colors add style while maintaining practicality. Machine washable, the romper retains softness and shape after repeated cleaning, making it a versatile and essential wardrobe piece for newborns and infants.",
      "additional_info": {
        "material": "100% Cotton",
        "color": "Blue",
        "weight": "100g",
        "dimensions": "Sizes: 0-3M, 3-6M, 6-12M",
        "care_instructions": "Machine washable; tumble dry low; avoid bleach",
        "durability": "Reinforced stitching, shrink-resistant cotton",
        "brand": "BabyComfort",
        "model": "BC-RM01",
        "origin": "USA"
      },
      "price": 20,
      "quantity": 50,
      "shippingFee": 15,
      "tags": [{ "name": "Baby" }, { "name": "Clothing" }],
      "product_type": "simple"
    },
    {
      "name": "Organic Cotton Baby Onesie",
      "category": "Baby Products",
      "subCategory": "Clothing",
      "description": "Soft organic cotton onesie for sensitive newborn skin.",
      "product_details": "This Organic Cotton Baby Onesie is made from 100% certified organic cotton, free from harmful chemicals. The soft and breathable fabric ensures comfort for delicate skin, reducing irritation and allergies. Snap buttons along the bottom make diaper changes easy. The long sleeves provide warmth, while the lightweight cotton allows for movement during playtime. The onesie is machine washable, retaining softness and vibrant colors even after repeated washing. Stylish prints and colors make it a perfect combination of safety, comfort, and fashion for newborns and infants.",
      "additional_info": {
        "material": "100% Organic Cotton",
        "color": "White with pastel prints",
        "weight": "90g",
        "dimensions": "Sizes: 0-3M, 3-6M, 6-12M",
        "care_instructions": "Machine washable; tumble dry low; do not bleach",
        "durability": "Soft, long-lasting organic fabric",
        "brand": "EcoBaby",
        "model": "EB-ON01",
        "origin": "USA"
      },
      "price": 25,
      "quantity": 40,
      "shippingFee": 15,
      "tags": [{ "name": "Baby" }, { "name": "Clothing" }],
      "product_type": "simple"
    },
    {
      "name": "Knit Baby Sweater",
      "category": "Baby Products",
      "subCategory": "Clothing",
      "description": "Hand-knit soft sweater for babies, ideal for cold weather.",
      "product_details": "The Knit Baby Sweater is carefully hand-knitted from premium soft yarn, providing warmth and comfort for babies in colder seasons. The breathable knit ensures a cozy feel without overheating. Easy-to-wear button closures at the front allow parents to dress babies effortlessly. Designed to be gentle on delicate skin, the sweater combines fashion and functionality. Its durable material withstands multiple washes, maintaining softness and shape. Available in various colors, it adds a charming touch to baby outfits while ensuring warmth and comfort.",
      "additional_info": {
        "material": "Soft Acrylic Yarn",
        "color": "Cream",
        "weight": "150g",
        "dimensions": "Sizes: 0-3M, 3-6M, 6-12M",
        "care_instructions": "Hand wash recommended; lay flat to dry; avoid bleach",
        "durability": "Hand-knit craftsmanship, soft yarn",
        "brand": "CozyBaby",
        "model": "CB-SW01",
        "origin": "Germany"
      },
      "price": 30,
      "quantity": 30,
      "shippingFee": 15,
      "tags": [{ "name": "Baby" }, { "name": "Clothing" }],
      "product_type": "simple"
    },
    {
      "name": "Baby Pajama Set",
      "category": "Baby Products",
      "subCategory": "Clothing",
      "description": "Soft cotton pajama set for comfortable sleep.",
      "product_details": "This Baby Pajama Set includes a long-sleeve top and pants made from 100% soft cotton, ensuring breathability and comfort for a restful night's sleep. Elastic waistbands provide a snug but flexible fit, while reinforced stitching increases durability. The fabric is gentle on sensitive skin and machine washable for easy maintenance. Cute patterns and vibrant colors add style to bedtime. Ideal for newborns and infants, this pajama set combines comfort, practicality, and charm for nighttime wear.",
      "additional_info": {
        "material": "100% Cotton",
        "color": "Pastel Yellow",
        "weight": "120g",
        "dimensions": "Sizes: 0-3M, 3-6M, 6-12M",
        "care_instructions": "Machine washable; tumble dry low; avoid bleach",
        "durability": "Elastic waist, reinforced seams, soft cotton",
        "brand": "SleepyBaby",
        "model": "SB-PJ01",
        "origin": "USA"
      },
      "price": 22,
      "quantity": 50,
      "shippingFee": 15,
      "tags": [{ "name": "Baby" }, { "name": "Clothing" }],
      "product_type": "simple"
    },
    {
      "name": "Baby Hooded Jacket",
      "category": "Baby Products",
      "subCategory": "Clothing",
      "description": "Warm hooded jacket for babies, perfect for outdoor wear.",
      "product_details": "The Baby Hooded Jacket is made from soft fleece material, offering warmth and protection during cooler days. The attached hood shields the head and ears from wind, while the front zipper allows easy dressing and removal. Soft inner lining ensures gentle contact with sensitive skin. Durable stitching and quality material guarantee long-lasting wear. Stylish colors and patterns make it a fashionable addition to baby outfits. Ideal for daily use, walks, or outings, this jacket keeps infants cozy and comfortable in colder environments.",
      "additional_info": {
        "material": "Fleece + Cotton Lining",
        "color": "Gray",
        "weight": "200g",
        "dimensions": "Sizes: 0-3M, 3-6M, 6-12M",
        "care_instructions": "Machine washable; tumble dry low; avoid bleach",
        "durability": "Soft fleece, reinforced zipper stitching",
        "brand": "WarmBaby",
        "model": "WB-JK01",
        "origin": "USA"
      },
      "price": 28,
      "quantity": 40,
      "shippingFee": 15,
      "tags": [{ "name": "Baby" }, { "name": "Clothing" }],
      "product_type": "simple"
    },
    {
      "name": "Baby Leggings Set",
      "category": "Baby Products",
      "subCategory": "Clothing",
      "description": "Stretchable leggings set for babies, ideal for daily wear.",
      "product_details": "This Baby Leggings Set includes soft, stretchable leggings made from premium cotton and spandex blend. The elastic waistband ensures a comfortable fit without restricting movement. Lightweight and breathable fabric keeps babies cozy while allowing free mobility. Suitable for daily wear, playtime, or layering under dresses, the leggings are machine washable and maintain softness and shape after multiple washes. Available in various colors and patterns, this set is stylish, practical, and perfect for any baby wardrobe.",
      "additional_info": {
        "material": "Cotton + Spandex",
        "color": "Pink",
        "weight": "80g",
        "dimensions": "Sizes: 0-3M, 3-6M, 6-12M",
        "care_instructions": "Machine washable; tumble dry low; avoid bleach",
        "durability": "Elastic waistband, reinforced stitching",
        "brand": "TinyFashion",
        "model": "TF-LG01",
        "origin": "USA"
      },
      "price": 18,
      "quantity": 50,
      "shippingFee": 15,
      "tags": [{ "name": "Baby" }, { "name": "Clothing" }],
      "product_type": "simple"
    },
    {
      "name": "Baby Summer Dress",
      "category": "Baby Products",
      "subCategory": "Clothing",
      "description": "Lightweight summer dress for baby girls, perfect for outings.",
      "product_details": "The Baby Summer Dress is made from soft, breathable cotton, ensuring comfort during warm weather. Features include short sleeves, gentle elastic at the waist, and easy-to-wear back buttons for effortless dressing. The dress allows free movement, keeping babies comfortable while playing or napping. Adorable patterns and vibrant colors make it suitable for casual outings or special occasions. Machine washable and durable, it retains softness and shape even after repeated washes. This dress combines style, practicality, and comfort for baby girls' summer wardrobe.",
      "additional_info": {
        "material": "100% Cotton",
        "color": "Pastel Pink",
        "weight": "100g",
        "dimensions": "Sizes: 0-3M, 3-6M, 6-12M",
        "care_instructions": "Machine washable; tumble dry low; avoid bleach",
        "durability": "Soft cotton, reinforced seams",
        "brand": "BabyStyle",
        "model": "BS-DR01",
        "origin": "USA"
      },
      "price": 24,
      "quantity": 40,
      "shippingFee": 15,
      "tags": [{ "name": "Baby" }, { "name": "Clothing" }],
      "product_type": "simple"
    },
    {
      "name": "Baby Winter Onesie",
      "category": "Baby Products",
      "subCategory": "Clothing",
      "description": "Thick winter onesie for warmth and comfort in cold weather.",
      "product_details": "The Baby Winter Onesie is made from a soft, thick fleece material, keeping babies warm during cold seasons. Full-length sleeves and covered feet provide maximum coverage. Snap buttons along the front and legs make diaper changes quick and easy. The onesie is breathable, soft on sensitive skin, and durable, maintaining warmth and shape after multiple washes. Available in various colors and cute patterns, it combines comfort, functionality, and style for newborns and infants during winter months.",
      "additional_info": {
        "material": "Fleece + Cotton Lining",
        "color": "Light Gray",
        "weight": "250g",
        "dimensions": "Sizes: 0-3M, 3-6M, 6-12M",
        "care_instructions": "Machine washable; tumble dry low; avoid bleach",
        "durability": "Soft fleece, reinforced stitching",
        "brand": "CozyBaby",
        "model": "CB-WO01",
        "origin": "USA"
      },
      "price": 30,
      "quantity": 35,
      "shippingFee": 15,
      "tags": [{ "name": "Baby" }, { "name": "Clothing" }],
      "product_type": "simple"
    },
    {
      "name": "Baby Hooded Romper",
      "category": "Baby Products",
      "subCategory": "Clothing",
      "description": "Hooded romper combining comfort, warmth, and style for infants.",
      "product_details": "The Baby Hooded Romper is crafted from premium soft cotton and fleece blend, providing warmth and comfort. The attached hood shields the head from cold drafts. Snap closures along the front and legs allow easy diaper changes, while the lightweight, breathable fabric ensures comfort during play or sleep. Cute prints and vibrant colors enhance style, making it perfect for outings or indoor wear. Machine washable, this romper maintains softness and shape even after repeated washes, offering a practical yet stylish solution for infants' daily wear.",
      "additional_info": {
        "material": "Cotton + Fleece",
        "color": "Mint Green",
        "weight": "180g",
        "dimensions": "Sizes: 0-3M, 3-6M, 6-12M",
        "care_instructions": "Machine washable; tumble dry low; avoid bleach",
        "durability": "Soft fleece, reinforced stitching, durable fabric",
        "brand": "BabyComfort",
        "model": "BC-HR01",
        "origin": "USA"
      },
      "price": 28,
      "quantity": 40,
      "shippingFee": 15,
      "tags": [{ "name": "Baby" }, { "name": "Clothing" }],
      "product_type": "simple"
    },
    {
      "name": "Digital Baby Thermometer",
      "category": "Baby Products",
      "subCategory": "Health & Care",
      "description": "Fast and accurate digital thermometer to monitor baby's temperature.",
      "product_details": "The Digital Baby Thermometer provides fast, reliable, and accurate temperature readings in seconds, ensuring parents can monitor their baby's health efficiently. Designed for oral, rectal, or underarm use, it features a flexible tip for comfort and safety. The thermometer includes a clear LCD display, memory recall for previous readings, and an automatic shut-off function to save battery. Waterproof design allows easy cleaning and sanitation. Ideal for infants and toddlers, it is made from non-toxic, BPA-free materials that are safe for baby contact. Compact, portable, and easy to use, it is an essential tool for every nursery.",
      "additional_info": {
        "material": "BPA-free plastic",
        "color": "White with blue accents",
        "weight": "50g",
        "dimensions": "Length: 15cm, Width: 2cm, Height: 1.5cm",
        "care_instructions": "Wipe with disinfectant; do not immerse in water",
        "age_range": "0-36 months",
        "brand": "HealthMate",
        "model": "HM-TH01",
        "origin": "USA",
        "battery": "1x AAA included"
      },
      "price": 15,
      "quantity": 60,
      "shippingFee": 15,
      "tags": [{ "name": "Baby" }, { "name": "Thermometer" }],
      "product_type": "simple"
    },
    {
      "name": "Baby First Aid Kit",
      "category": "Baby Products",
      "subCategory": "Health & Care",
      "description": "Comprehensive first aid kit for babies and toddlers.",
      "product_details": "The Baby First Aid Kit contains all essential items to manage minor injuries, cuts, scrapes, and emergencies for infants and toddlers. Includes baby-safe scissors, nasal aspirator, thermometers, bandages, antiseptic wipes, and medicine droppers. All items are made from non-toxic, hypoallergenic materials and packaged in a compact, portable case for home, travel, or daycare use. Clear labeling and organized compartments ensure quick access during emergencies. Provides peace of mind for parents by keeping medical necessities at hand, promoting baby safety, and supporting proper health care practices.",
      "additional_info": {
        "material": "Plastic case with non-toxic components",
        "color": "Blue and white",
        "weight": "500g",
        "dimensions": "Length: 25cm, Width: 15cm, Height: 10cm",
        "care_instructions": "Wipe case with damp cloth; sanitize tools before use",
        "age_range": "0-36 months",
        "brand": "SafeHealth",
        "model": "SH-FAK01",
        "origin": "USA",
        "portable": "Yes"
      },
      "price": 35,
      "quantity": 40,
      "shippingFee": 15,
      "tags": [{ "name": "Baby" }, { "name": "First Aid" }],
      "product_type": "simple"
    },
    {
      "name": "Baby Cardigan Set",
      "category": "Baby Products",
      "subCategory": "Clothing",
      "description": "Soft cardigan and pants set for comfortable layered wear.",
      "product_details": "The Baby Cardigan Set includes a soft knitted cardigan and matching pants, providing warmth and comfort for infants. Made from breathable cotton and acrylic blend, it is gentle on sensitive skin. Easy-to-wear button closures on the cardigan allow hassle-free dressing. The set is machine washable and maintains shape and softness after multiple washes. Perfect for layering in cooler weather, the stylish design and charming patterns make it ideal for outings, daily wear, or photoshoots. Durable fabric ensures long-lasting use and comfort.",
      "additional_info": {
        "material": "Cotton + Acrylic",
        "color": "Light Beige",
        "weight": "200g",
        "dimensions": "Sizes: 0-3M, 3-6M, 6-12M",
        "care_instructions": "Machine washable; lay flat to dry; avoid bleach",
        "durability": "Soft knit, reinforced seams, breathable fabric",
        "brand": "CozyBaby",
        "model": "CB-CS01",
        "origin": "Germany"
      },
      "price": 32,
      "quantity": 35,
      "shippingFee": 15,
      "tags": [{ "name": "Baby" }, { "name": "Clothing" }],
      "product_type": "simple"
    },
    {
      "name": "Soft Cotton Baby Booties",
      "category": "Baby Products",
      "subCategory": "Footwear",
      "description": "Soft cotton booties for newborns, ideal for keeping tiny feet warm.",
      "product_details": "These Soft Cotton Baby Booties are made from premium, breathable cotton, providing warmth and comfort to newborn feet without causing irritation. The flexible sole allows natural movement, while the soft fabric ensures gentle contact with sensitive skin. Elastic openings make it easy to slip the booties on and off, and reinforced stitching ensures durability through multiple washes. Available in charming colors and patterns, these booties are perfect for daily wear, sleep, or outings. Machine washable and lightweight, they combine practicality, safety, and style for infants' tiny feet.",
      "additional_info": {
        "material": "100% Cotton",
        "color": "White",
        "weight": "50g",
        "dimensions": "Fits newborns up to 3 months",
        "care_instructions": "Machine washable; tumble dry low; avoid bleach",
        "durability": "Soft cotton, reinforced stitching, flexible sole",
        "brand": "TinySteps",
        "model": "TS-BT01",
        "origin": "USA"
      },
      "price": 12,
      "quantity": 50,
      "shippingFee": 15,
      "tags": [{ "name": "Baby" }, { "name": "Footwear" }],
      "product_type": "simple"
    },
    {
      "name": "Baby Soft Leather Moccasins",
      "category": "Baby Products",
      "subCategory": "Footwear",
      "description": "Premium leather moccasins designed for style and comfort.",
      "product_details": "The Baby Soft Leather Moccasins are made from genuine, soft leather, ensuring durability while remaining gentle on sensitive baby skin. The flexible sole allows babies to move naturally while learning to walk. Soft inner lining provides comfort, and the moccasins feature decorative stitching for a stylish look. Elastic around the ankle ensures a secure fit without constricting the feet. Perfect for both casual wear and special occasions, these moccasins are lightweight, breathable, and designed for long-lasting comfort and practicality for infants.",
      "additional_info": {
        "material": "Genuine Leather + Soft Lining",
        "color": "Brown",
        "weight": "70g",
        "dimensions": "Fits infants 3-12 months",
        "care_instructions": "Wipe clean with damp cloth; air dry; avoid direct sunlight",
        "durability": "Soft leather, flexible sole, reinforced stitching",
        "brand": "TinySteps",
        "model": "TS-LM01",
        "origin": "Italy"
      },
      "price": 25,
      "quantity": 40,
      "shippingFee": 15,
      "tags": [{ "name": "Baby" }, { "name": "Footwear" }],
      "product_type": "simple"
    },
    {
      "name": "Digital Baby Blood Pressure Monitor",
      "category": "Baby Products",
      "subCategory": "Health & Care",
      "description": "Gentle and accurate blood pressure monitor designed for infants and toddlers.",
      "product_details": "The Digital Baby Blood Pressure Monitor is specifically designed to measure blood pressure safely and accurately in infants and young children. Soft adjustable cuffs provide comfort without restricting circulation. LCD display shows readings clearly, while memory recall stores previous measurements. Non-toxic and BPA-free materials ensure baby safety. Portable, lightweight, and easy to use at home or in clinical settings. Supports parents and caregivers in monitoring child health and detecting early signs of circulatory issues. Designed with pediatric accuracy and gentle operation in mind.",
      "additional_info": {
        "material": "BPA-free plastic with soft cuff",
        "color": "White with gray cuff",
        "weight": "200g",
        "dimensions": "Length: 15cm, Width: 10cm, Height: 5cm",
        "care_instructions": "Wipe with disinfectant; avoid submerging in water",
        "age_range": "0-36 months",
        "brand": "HealthMate",
        "model": "HM-BP01",
        "origin": "USA",
        "battery": "2x AAA included"
      },
      "price": 60,
      "quantity": 30,
      "shippingFee": 15,
      "tags": [{ "name": "Baby" }, { "name": "Blood Pressure" }],
      "product_type": "simple"
    },
    {
      "name": "Baby Oral Care Kit",
      "category": "Baby Products",
      "subCategory": "Health & Care",
      "description": "Comprehensive oral care kit for infants and toddlers’ teeth and gums.",
      "product_details": "The Baby Oral Care Kit includes soft silicone toothbrushes, finger brushes, and teething pads to ensure proper oral hygiene for infants and toddlers. Made from BPA-free, non-toxic, and hypoallergenic materials, it is safe for sensitive gums and developing teeth. Ergonomically designed handles provide comfort and control for parents during brushing. Easy to clean and sterilize. Promotes healthy dental habits from an early age while preventing gum irritation or dental issues. Ideal for daily use and travel, supporting the overall health and hygiene of young children.",
      "additional_info": {
        "material": "BPA-free silicone and plastic",
        "color": "Blue and white",
        "weight": "80g",
        "dimensions": "Brush length: 12cm, Brush head: 2cm diameter",
        "care_instructions": "Wash before first use; sterilize regularly",
        "age_range": "0-36 months",
        "brand": "SafeHealth",
        "model": "SH-OC01",
        "origin": "USA",
        "portable": "Yes"
      },
      "price": 18,
      "quantity": 80,
      "shippingFee": 15,
      "tags": [{ "name": "Baby" }, { "name": "Oral Care" }],
      "product_type": "simple"
    },
    {
      "name": "Knitted Baby Socks Set",
      "category": "Baby Products",
      "subCategory": "Footwear",
      "description": "Set of knitted socks keeping baby feet warm and cozy.",
      "product_details": "This Knitted Baby Socks Set includes multiple pairs made from soft, breathable cotton-acrylic blend. The snug fit keeps the socks in place, while the flexible material allows natural movement. Gentle on sensitive skin, the socks provide warmth without overheating. Vibrant colors and cute patterns add style to daily outfits. The reinforced heel and toe ensure durability even after multiple washes. Ideal for newborns and infants, this socks set combines comfort, practicality, and design, making it an essential addition to any baby wardrobe.",
      "additional_info": {
        "material": "Cotton + Acrylic",
        "color": "Assorted Colors",
        "weight": "30g per pair",
        "dimensions": "Fits 0-12 months",
        "care_instructions": "Machine washable; tumble dry low; avoid bleach",
        "durability": "Reinforced heel and toe, soft and flexible fabric",
        "brand": "CozyBaby",
        "model": "CB-SK01",
        "origin": "Germany"
      },
      "price": 15,
      "quantity": 60,
      "shippingFee": 15,
      "tags": [{ "name": "Baby" }, { "name": "Footwear" }],
      "product_type": "simple"
    },
    {
      "name": "Silver Classic Watch",
      "category": "Accessories",
      "subCategory": "Watches",
      "description": "Classic silver wrist watch with stainless steel strap and precise movement.",
      "product_details": "High-quality stainless steel strap and case. Quartz movement ensures accurate timekeeping. Water-resistant for daily activities. Scratch-resistant glass protects the dial. Adjustable clasp for a comfortable fit. Sleek and timeless design suitable for any outfit. Lightweight and durable for long-term wear. Smooth polished finish for elegance. Ideal as a gift. Combines style, functionality, and reliability.",
      "additional_info": {
        "material": "Stainless Steel",
        "color": "Silver",
        "weight": "130g",
        "brand": "TimeMaster",
        "model": "TM-SW01"
      },
      "price": 280,
      "sale_price": 240,
      "on_sale": true,
      "sale_start": "2025-11-05T00:00:00Z",
      "sale_end": "2025-12-05T23:59:59Z",
      "quantity": 35,
      "shippingFee": 15,
      "tags": [{ "name": "Watch" }, { "name": "Metal" }, { "name": "Classic" }],
      "product_type": "simple"
    },
    {
      "name": "Baby Sneakers",
      "category": "Baby Products",
      "subCategory": "Footwear",
      "description": "Lightweight sneakers for infants, supporting first steps.",
      "product_details": "Baby Sneakers are designed for infants learning to walk, offering lightweight support and flexibility. The breathable fabric prevents overheating, while a soft cushioned insole ensures comfort. Non-slip rubber soles reduce the risk of slipping, making them ideal for indoor and outdoor use. Easy-to-use hook-and-loop closures allow parents to put them on and remove them quickly. Stylish colors and designs make them perfect for casual outings or playdates. Durable construction ensures longevity, while maintaining softness and flexibility for growing feet.",
      "additional_info": {
        "material": "Fabric + Rubber Sole",
        "color": "Blue & White",
        "weight": "80g",
        "dimensions": "Sizes: 3-12 months",
        "care_instructions": "Wipe with damp cloth; air dry; avoid machine wash",
        "durability": "Non-slip sole, reinforced stitching, lightweight",
        "brand": "TinySteps",
        "model": "TS-SN01",
        "origin": "USA"
      },
      "price": 20,
      "quantity": 50,
      "shippingFee": 15,
      "tags": [{ "name": "Baby" }, { "name": "Footwear" }],
      "product_type": "simple"
    },
    {
      "name": "Soft Baby Slippers",
      "category": "Baby Products",
      "subCategory": "Footwear",
      "description": "Soft, cozy slippers for indoor use, keeping baby feet warm.",
      "product_details": "These Soft Baby Slippers are crafted from plush fabric to provide warmth and comfort for infants. Lightweight and flexible, they allow natural foot movement. The elasticized opening ensures they stay securely on tiny feet. Soft cushioned soles add comfort while maintaining flexibility. Machine washable and durable, these slippers are ideal for indoor play or naptime. Available in adorable colors and patterns, they combine practicality, comfort, and style for daily infant wear.",
      "additional_info": {
        "material": "Plush Fabric + Soft Sole",
        "color": "Pink",
        "weight": "60g",
        "dimensions": "Fits 0-12 months",
        "care_instructions": "Machine washable; air dry; avoid bleach",
        "durability": "Soft fabric, flexible sole, reinforced seams",
        "brand": "CozyBaby",
        "model": "CB-SP01",
        "origin": "China"
      },
      "price": 15,
      "quantity": 50,
      "shippingFee": 15,
      "tags": [{ "name": "Baby" }, { "name": "Footwear" }],
      "product_type": "simple"
    },
    {
      "name": "Baby Mary Jane Shoes",
      "category": "Baby Products",
      "subCategory": "Footwear",
      "description": "Classic Mary Jane shoes for baby girls, stylish and comfortable.",
      "product_details": "These Baby Mary Jane Shoes are made from soft, breathable fabric and lightweight synthetic material for comfort. The adjustable strap with a hook-and-loop closure ensures a secure fit without restricting movement. Soft cushioned insoles provide support for early steps, while non-slip flexible soles reduce the risk of slipping. The shoes feature charming designs and colors perfect for casual wear, parties, or outings. Machine washable and durable, they combine fashion, comfort, and practicality for infant girls' footwear.",
      "additional_info": {
        "material": "Fabric + Synthetic Sole",
        "color": "Pink",
        "weight": "70g",
        "dimensions": "Sizes: 3-12 months",
        "care_instructions": "Wipe clean with damp cloth; air dry; avoid direct heat",
        "durability": "Flexible sole, reinforced strap, soft insole",
        "brand": "TinySteps",
        "model": "TS-MJ01",
        "origin": "Italy"
      },
      "price": 22,
      "quantity": 40,
      "shippingFee": 15,
      "tags": [{ "name": "Baby" }, { "name": "Footwear" }],
      "product_type": "simple"
    },
    {
      "name": "Portable Infant Car Seat",
      "category": "Baby Products",
      "subCategory": "Strollers & Car Seats",
      "description": "Lightweight ergonomic car seat for infants with adjustable harness.",
      "product_details": "Durable plastic shell with padded interior for comfort. Adjustable 5-point harness ensures safety. Side-impact protection. Removable washable cover. Compatible with travel systems. Compact and ergonomic design. Lightweight for easy installation. Safety-tested and certified. Smooth belt adjustment. Stylish and practical for daily use. Ensures maximum comfort and security.",
      "additional_info": {
        "material": "Plastic & Fabric",
        "color": "Black & Gray",
        "weight": "6.5kg",
        "brand": "SafeRide",
        "model": "SR-CS02"
      },
      "price": 185,
      "sale_price": 160,
      "on_sale": true,
      "sale_start": "2025-11-05T00:00:00Z",
      "sale_end": "2025-12-05T23:59:59Z",
      "quantity": 35,
      "shippingFee": 15,
      "tags": [
        { "name": "Baby" },
        { "name": "Car Seat" },
        { "name": "Safety" }
      ],
      "product_type": "simple"
    },
    {
      "name": "Baby High-Top Sneakers",
      "category": "Baby Products",
      "subCategory": "Footwear",
      "description": "Stylish high-top sneakers designed for infant first steps.",
      "product_details": "Baby High-Top Sneakers are made from breathable fabric with a soft cushioned interior to ensure maximum comfort. The high-top design provides gentle ankle support, perfect for babies learning to walk. Flexible non-slip rubber soles improve traction, while hook-and-loop straps make dressing quick and easy. These sneakers are durable, lightweight, and maintain shape even after repeated use. Available in trendy colors, they combine style, support, and practicality for daily wear, outings, or playtime.",
      "additional_info": {
        "material": "Fabric + Rubber Sole",
        "color": "Red & White",
        "weight": "85g",
        "dimensions": "Sizes: 3-12 months",
        "care_instructions": "Wipe clean; air dry; avoid machine washing",
        "durability": "Flexible sole, cushioned interior, reinforced stitching",
        "brand": "TinySteps",
        "model": "TS-HT01",
        "origin": "USA"
      },
      "price": 24,
      "quantity": 40,
      "shippingFee": 15,
      "tags": [{ "name": "Baby" }, { "name": "Footwear" }],
      "product_type": "simple"
    },
    {
      "name": "Baby Soft Sandals",
      "category": "Baby Products",
      "subCategory": "Footwear",
      "description": "Lightweight, breathable sandals perfect for warm weather.",
      "product_details": "Baby Soft Sandals are designed with breathable fabric and soft soles to keep infants’ feet cool and comfortable during summer. Adjustable straps ensure a secure fit, while flexible soles allow natural movement. Soft inner lining prevents irritation and ensures comfort. Stylish and colorful designs make these sandals suitable for casual outings or playtime. Machine washable and lightweight, they provide practicality, safety, and comfort for babies while ensuring feet stay cool and protected.",
      "additional_info": {
        "material": "Fabric + Soft Rubber Sole",
        "color": "Yellow",
        "weight": "60g",
        "dimensions": "Sizes: 3-12 months",
        "care_instructions": "Wipe with damp cloth; air dry; avoid bleach",
        "durability": "Soft soles, adjustable straps, breathable fabric",
        "brand": "CozyBaby",
        "model": "CB-SD01",
        "origin": "China"
      },
      "price": 18,
      "quantity": 50,
      "shippingFee": 15,
      "tags": [{ "name": "Baby" }, { "name": "Footwear" }],
      "product_type": "simple"
    },
    {
      "name": "Baby Winter Boots",
      "category": "Baby Products",
      "subCategory": "Footwear",
      "description": "Warm winter boots for infants, keeping feet cozy in cold weather.",
      "product_details": "These Baby Winter Boots are made from soft, insulated fabric with a plush inner lining, ensuring warmth during cold months. Non-slip rubber soles provide traction and prevent slipping. Adjustable velcro straps make it easy to wear and remove, while keeping boots securely on tiny feet. The boots are lightweight, comfortable, and durable for everyday use. Stylish designs and colors make them perfect for outdoor winter walks or casual wear, combining functionality, safety, and fashion for babies.",
      "additional_info": {
        "material": "Insulated Fabric + Plush Lining + Rubber Sole",
        "color": "Gray",
        "weight": "120g",
        "dimensions": "Sizes: 3-12 months",
        "care_instructions": "Wipe clean; air dry; avoid direct heat",
        "durability": "Insulated lining, reinforced stitching, non-slip sole",
        "brand": "CozyBaby",
        "model": "CB-WB01",
        "origin": "Germany"
      },
      "price": 28,
      "quantity": 35,
      "shippingFee": 15,
      "tags": [{ "name": "Baby" }, { "name": "Footwear" }],
      "product_type": "simple"
    },
    {
      "name": "Baby Slip-On Shoes",
      "category": "Baby Products",
      "subCategory": "Footwear",
      "description": "Easy slip-on shoes for infants, perfect for daily wear.",
      "product_details": "Baby Slip-On Shoes are crafted from soft, breathable fabric with a flexible sole, making them comfortable for tiny feet. The elasticized opening allows parents to easily slip them on and off, while keeping shoes secure. Lightweight and durable, they are perfect for indoor and outdoor play. Non-slip soles enhance safety as babies explore walking. Stylish colors and patterns make these shoes ideal for casual outings. Machine washable and gentle on sensitive skin, they combine practicality, comfort, and style for infants.",
      "additional_info": {
        "material": "Fabric + Flexible Rubber Sole",
        "color": "Green",
        "weight": "65g",
        "dimensions": "Sizes: 3-12 months",
        "care_instructions": "Wipe clean; air dry; machine washable",
        "durability": "Flexible sole, elastic opening, soft insole",
        "brand": "TinySteps",
        "model": "TS-SO01",
        "origin": "USA"
      },
      "price": 20,
      "quantity": 45,
      "shippingFee": 15,
      "tags": [{ "name": "Baby" }, { "name": "Footwear" }],
      "product_type": "simple"
    },
    {
      "name": "Baby Gentle Moisturizer",
      "category": "Baby Products",
      "subCategory": "Bath & Skincare",
      "description": "Hydrating moisturizer for baby skin, gentle and fragrance-free.",
      "product_details": "Hypoallergenic formula, enriched with natural oils, free from parabens and dyes, fast absorbing, gentle on sensitive skin, suitable for daily use, keeps skin soft and smooth, dermatologically tested, lightweight texture, safe for newborns and infants, promotes healthy skin barrier, mild and nourishing, easy to apply, non-greasy finish.",
      "additional_info": {
        "material": "Cream",
        "color": "White",
        "weight": "150g",
        "brand": "BabyCare",
        "model": "BC-MO01"
      },
      "price": 16,
      "sale_price": 13,
      "on_sale": true,
      "sale_start": "2025-11-05T00:00:00Z",
      "sale_end": "2025-12-05T23:59:59Z",
      "quantity": 70,
      "shippingFee": 15,
      "tags": [
        { "name": "Baby" },
        { "name": "Skincare" },
        { "name": "Moisturizer" }
      ],
      "product_type": "simple"
    },
    {
      "name": "Gentle Baby Diapers Pack",
      "category": "Baby Products",
      "subCategory": "Diapers & Wipes",
      "description": "Soft and absorbent diapers for newborns and infants.",
      "product_details": "Gentle Baby Diapers are crafted from a hypoallergenic cotton blend that is soft and gentle on delicate baby skin, preventing irritation or rashes. These diapers offer 12-hour absorption with a moisture-lock technology, keeping babies dry and comfortable. Elastic waistbands and stretchy side panels provide a snug yet flexible fit for active infants. The breathable top sheet ensures proper airflow to reduce heat and moisture build-up. Convenient tear-away tabs allow easy diaper changes. Suitable for newborns, these diapers are dermatologically tested, ensuring safety and comfort for daily use. Available in various sizes to fit babies from birth to 12 months, they provide reliability and convenience for parents while maintaining the highest hygiene standards.",
      "additional_info": {
        "material": "Cotton blend",
        "color": "White",
        "weight": "500g per pack",
        "dimensions": "Sizes: Newborn, 0-3M, 3-6M, 6-12M",
        "care_instructions": "Store in a cool dry place; avoid moisture",
        "absorbency": "12-hour moisture lock, breathable top sheet",
        "brand": "BabyCare",
        "model": "BC-DP01",
        "origin": "USA"
      },
      "price": 30,
      "quantity": 100,
      "shippingFee": 15,
      "tags": [{ "name": "Baby" }, { "name": "Diapers" }],
      "product_type": "simple"
    },
    {
      "name": "Eco-Friendly Baby Diapers Pack",
      "category": "Baby Products",
      "subCategory": "Diapers & Wipes",
      "description": "Biodegradable and gentle diapers made for eco-conscious parents.",
      "product_details": "Eco-Friendly Baby Diapers are designed with environmentally conscious materials without compromising comfort. Made from biodegradable, plant-based fibers, these diapers are soft, breathable, and gentle on delicate baby skin. They offer excellent absorption with leak-proof layers and an elastic waistband for a secure, flexible fit. The hypoallergenic, dermatologically tested surface ensures safety while minimizing the risk of rashes. Easy-to-use adhesive tabs allow quick changes. Available in multiple sizes, these diapers are ideal for parents who want sustainable options without sacrificing performance, ensuring babies stay dry, comfortable, and happy throughout the day and night.",
      "additional_info": {
        "material": "Plant-based biodegradable fibers",
        "color": "Off-white",
        "weight": "480g per pack",
        "dimensions": "Sizes: Newborn, 0-3M, 3-6M, 6-12M",
        "care_instructions": "Store in a cool dry place; avoid moisture",
        "absorbency": "10-12 hours, breathable layers",
        "brand": "EcoBaby",
        "model": "EB-DP01",
        "origin": "Germany"
      },
      "price": 35,
      "quantity": 80,
      "shippingFee": 15,
      "tags": [{ "name": "Baby" }, { "name": "Diapers" }],
      "product_type": "simple"
    },
    {
      "name": "Premium Overnight Baby Diapers",
      "category": "Baby Products",
      "subCategory": "Diapers & Wipes",
      "description": "Extra absorbent overnight diapers for a dry and comfortable night.",
      "product_details": "Premium Overnight Baby Diapers provide superior absorption for overnight use. Made from soft, hypoallergenic materials, they are gentle on sensitive skin and prevent rashes. Innovative multi-layer design locks moisture away, keeping babies dry for up to 12 hours. Elastic waistbands and adjustable tabs ensure a snug, secure fit even for active sleepers. The breathable outer layer maintains airflow and prevents heat build-up. Conveniently packed, these diapers are perfect for parents looking for a reliable solution to keep babies comfortable and dry all night. Suitable for infants from newborn to 12 months, they combine performance, comfort, and safety.",
      "additional_info": {
        "material": "Hypoallergenic cotton blend",
        "color": "White",
        "weight": "520g per pack",
        "dimensions": "Sizes: Newborn, 0-3M, 3-6M, 6-12M",
        "care_instructions": "Store in a cool dry place; avoid moisture",
        "absorbency": "Up to 12 hours, moisture-lock core",
        "brand": "BabyComfort",
        "model": "BC-DP02",
        "origin": "USA"
      },
      "price": 32,
      "quantity": 90,
      "shippingFee": 15,
      "tags": [{ "name": "Baby" }, { "name": "Diapers" }],
      "product_type": "simple"
    },
    {
      "name": "Sensitive Skin Baby Diapers",
      "category": "Baby Products",
      "subCategory": "Diapers & Wipes",
      "description": "Diapers specifically designed for babies with extremely sensitive skin.",
      "product_details": "Sensitive Skin Baby Diapers are made from ultra-soft, hypoallergenic cotton that minimizes irritation and prevents rashes. The high-absorbency core locks moisture efficiently, while breathable layers ensure proper airflow, keeping the skin dry and comfortable. Flexible side panels and adjustable adhesive tabs provide a secure fit without constriction. Dermatologically tested and free from harmful chemicals, these diapers are perfect for newborns and infants with delicate skin. Each diaper maintains softness and comfort throughout use, making them ideal for daily care. Available in multiple sizes, they provide reliable protection and comfort for babies.",
      "additional_info": {
        "material": "Hypoallergenic cotton",
        "color": "Soft Beige",
        "weight": "500g per pack",
        "dimensions": "Sizes: Newborn, 0-3M, 3-6M, 6-12M",
        "care_instructions": "Store in a cool dry place; avoid moisture",
        "absorbency": "12-hour absorption, breathable layers",
        "brand": "GentleCare",
        "model": "GC-DP01",
        "origin": "France"
      },
      "price": 33,
      "quantity": 85,
      "shippingFee": 15,
      "tags": [{ "name": "Baby" }, { "name": "Diapers" }],
      "product_type": "simple"
    },
    {
      "name": "Baby Wipes Pack",
      "category": "Baby Products",
      "subCategory": "Diapers & Wipes",
      "description": "Soft, hypoallergenic wipes for daily baby care.",
      "product_details": "Baby Wipes Pack contains soft, gentle wipes made from hypoallergenic materials suitable for sensitive baby skin. Each wipe is infused with natural aloe and chamomile extract, ensuring soothing care while cleaning. The durable yet soft texture prevents irritation and allows effective cleaning during diaper changes. Conveniently packaged in resealable packs to maintain moisture, these wipes are ideal for daily use at home or on the go. Dermatologically tested and free from harmful chemicals, they provide safe and comfortable cleaning for newborns and infants, keeping skin fresh, hydrated, and irritation-free.",
      "additional_info": {
        "material": "Hypoallergenic non-woven fabric",
        "color": "White",
        "weight": "300g per pack",
        "dimensions": "80 wipes per pack",
        "care_instructions": "Keep sealed; store in cool place; avoid sunlight",
        "moisturizing": "Contains aloe and chamomile extract",
        "brand": "BabyCare",
        "model": "BC-WP01",
        "origin": "USA"
      },
      "price": 12,
      "quantity": 100,
      "shippingFee": 15,
      "tags": [{ "name": "Baby" }, { "name": "Wipes" }],
      "product_type": "simple"
    },
    {
      "name": "Soft Plush Baby Toy - Elephant",
      "category": "Baby Products",
      "subCategory": "Toys",
      "description": "Adorable plush elephant toy for infants and toddlers.",
      "product_details": "Non-toxic plush fabric, soft and cuddly, machine washable, safe for newborns and toddlers, lightweight and portable, colorful and engaging design, promotes sensory and tactile development, stitched securely with no choking hazards, ideal for nursery, daycare, and travel, gentle on sensitive skin, durable for everyday play, encourages imaginative play and comfort.",
      "additional_info": {
        "material": "Plush Fabric",
        "color": "Gray & Yellow",
        "weight": "150g",
        "dimensions": "18cm x 22cm",
        "brand": "ToyBaby",
        "model": "TB-PL03"
      },
      "price": 22,
      "sale_price": 18,
      "on_sale": true,
      "sale_start": "2025-11-05T00:00:00Z",
      "sale_end": "2025-12-05T23:59:59Z",
      "quantity": 60,
      "shippingFee": 15,
      "tags": [{ "name": "Baby" }, { "name": "Toys" }, { "name": "Plush" }],
      "product_type": "simple"
    },
    {
      "name": "Organic Cotton Baby Diapers",
      "category": "Baby Products",
      "subCategory": "Diapers & Wipes",
      "description": "Diapers made from 100% organic cotton, safe and eco-friendly.",
      "product_details": "Organic Cotton Baby Diapers are crafted from certified organic cotton, providing gentle and chemical-free protection for delicate baby skin. The absorbent core locks moisture efficiently, preventing leaks and keeping babies dry for hours. Soft elastic waistbands and stretchy side panels ensure a snug and flexible fit without constriction. These diapers are biodegradable, environmentally conscious, and dermatologically tested to minimize skin irritation. Available in multiple sizes for newborns and infants up to 12 months, they combine sustainability, comfort, and reliability for everyday use. Perfect for eco-conscious parents who want safe, gentle care for their baby while reducing environmental impact.",
      "additional_info": {
        "material": "100% Organic Cotton",
        "color": "Natural White",
        "weight": "500g per pack",
        "dimensions": "Sizes: Newborn, 0-3M, 3-6M, 6-12M",
        "care_instructions": "Store in cool dry place; avoid moisture",
        "absorbency": "Up to 12 hours, breathable layers",
        "brand": "EcoBaby",
        "model": "EB-DP02",
        "origin": "Germany"
      },
      "price": 38,
      "quantity": 70,
      "shippingFee": 15,
      "tags": [{ "name": "Baby" }, { "name": "Diapers" }],
      "product_type": "simple"
    },
    {
      "name": "Ultra Absorb Baby Diapers",
      "category": "Baby Products",
      "subCategory": "Diapers & Wipes",
      "description": "High-performance diapers for maximum dryness and comfort.",
      "product_details": "Ultra Absorb Baby Diapers feature a high-performance core that quickly absorbs and locks away moisture, ensuring babies stay dry and comfortable throughout the day and night. The soft, hypoallergenic top layer prevents irritation, while breathable side panels allow proper airflow. Stretchable waistbands and easy-open adhesive tabs provide a secure and flexible fit. Ideal for active infants, these diapers maintain shape and absorbency even during extended wear. Dermatologically tested and free from harmful chemicals, Ultra Absorb Diapers combine safety, reliability, and comfort for both babies and parents, available in multiple sizes for newborns to 12 months old.",
      "additional_info": {
        "material": "Hypoallergenic cotton blend + Absorbent core",
        "color": "White",
        "weight": "520g per pack",
        "dimensions": "Sizes: Newborn, 0-3M, 3-6M, 6-12M",
        "care_instructions": "Store in a cool, dry place; avoid moisture",
        "absorbency": "12-14 hours, leak-proof core",
        "brand": "BabyComfort",
        "model": "BC-DP03",
        "origin": "USA"
      },
      "price": 34,
      "quantity": 80,
      "shippingFee": 15,
      "tags": [{ "name": "Baby" }, { "name": "Diapers" }],
      "product_type": "simple"
    },
    {
      "name": "Sensitive Baby Wipes Pack",
      "category": "Baby Products",
      "subCategory": "Diapers & Wipes",
      "description": "Gentle wipes suitable for babies with delicate or sensitive skin.",
      "product_details": "Sensitive Baby Wipes Pack includes soft, hypoallergenic wipes infused with natural chamomile and aloe vera extracts to soothe and clean sensitive skin gently. Each wipe is thick yet soft, ensuring durability and comfort during use. The wipes are free from alcohol, parabens, and harsh chemicals, minimizing the risk of irritation or rashes. Convenient resealable packaging keeps wipes moist and hygienic. Ideal for daily diaper changes or on-the-go care, these wipes provide gentle cleansing while maintaining skin hydration, comfort, and safety for newborns and infants with delicate skin.",
      "additional_info": {
        "material": "Hypoallergenic non-woven fabric",
        "color": "White",
        "weight": "320g per pack",
        "dimensions": "80 wipes per pack",
        "care_instructions": "Keep sealed; store in a cool, dry place; avoid sunlight",
        "moisturizing": "Chamomile & aloe vera infused",
        "brand": "GentleCare",
        "model": "GC-WP01",
        "origin": "France"
      },
      "price": 13,
      "quantity": 90,
      "shippingFee": 15,
      "tags": [{ "name": "Baby" }, { "name": "Wipes" }],
      "product_type": "simple"
    },
    {
      "name": "Baby Feeding Bottle Set - Glass",
      "category": "Baby Products",
      "subCategory": "Feeding & Nursing",
      "description": "Safe and durable glass feeding bottles for infants, with anti-colic nipples.",
      "product_details": "Set of 2 glass bottles with anti-colic nipples. BPA-free and chemical-free. Easy to clean and sterilize. Durable and safe for infants. Transparent design for monitoring feeding amounts. Comfortable grip for parents. Travel-friendly design. Lightweight and ergonomic. Compatible with bottle warmers and sterilizers. Smooth finish ensures no residue. Ideal for everyday use at home or on the go.",
      "additional_info": {
        "material": "Glass",
        "color": "Transparent",
        "weight": "250g",
        "quantity": 2,
        "shippingFee": 15,
        "brand": "BabyFeed",
        "model": "BF-GB01"
      },
      "price": 35,
      "sale_price": 28,
      "on_sale": true,
      "sale_start": "2025-11-05T00:00:00Z",
      "sale_end": "2025-12-05T23:59:59Z",
      "quantity": 70,
      "shippingFee": 15,
      "tags": [{ "name": "Baby" }, { "name": "Feeding" }, { "name": "Glass" }],
      "product_type": "simple"
    },
    {
      "name": "Travel Pack Baby Diapers",
      "category": "Baby Products",
      "subCategory": "Diapers & Wipes",
      "description": "Compact diaper packs designed for travel convenience.",
      "product_details": "Travel Pack Baby Diapers are perfect for on-the-go parents who need convenience without compromising comfort. Each diaper is made from soft, hypoallergenic material with a highly absorbent core to keep babies dry during outings. Elastic waistbands and adjustable tabs provide a secure and comfortable fit. Compact packaging allows easy storage in diaper bags, making them ideal for travel, day trips, or visits. Dermatologically tested and free from harsh chemicals, these diapers offer reliable protection, comfort, and convenience for infants, ensuring parents have a practical and safe solution wherever they go.",
      "additional_info": {
        "material": "Hypoallergenic cotton blend",
        "color": "White",
        "weight": "200g per pack",
        "dimensions": "10 diapers per pack, Sizes: 0-12 months",
        "care_instructions": "Store in a cool dry place; avoid moisture",
        "absorbency": "6-8 hours, leak-proof core",
        "brand": "BabyCare",
        "model": "BC-DP04",
        "origin": "USA"
      },
      "price": 10,
      "quantity": 120,
      "shippingFee": 15,
      "tags": [{ "name": "Baby" }, { "name": "Diapers" }],
      "product_type": "simple"
    },
    {
      "name": "Eco Sensitive Baby Wipes",
      "category": "Baby Products",
      "subCategory": "Diapers & Wipes",
      "description": "Eco-friendly wipes made from natural fibers for gentle cleansing.",
      "product_details": "Eco Sensitive Baby Wipes are crafted from biodegradable, plant-based fibers and infused with natural aloe extract, ensuring gentle cleansing for delicate baby skin. These wipes are thick yet soft, free from alcohol, parabens, and harsh chemicals. Resealable packaging keeps wipes moist and hygienic, making them perfect for daily use, travel, or diaper changes. Designed for babies with sensitive skin, they provide safe, soothing, and eco-conscious cleaning, helping parents reduce environmental impact while maintaining the highest level of comfort and care for their infants.",
      "additional_info": {
        "material": "Biodegradable plant-based fibers",
        "color": "Natural White",
        "weight": "300g per pack",
        "dimensions": "80 wipes per pack",
        "care_instructions": "Keep sealed; store in a cool dry place; avoid sunlight",
        "moisturizing": "Natural aloe extract",
        "brand": "EcoBaby",
        "model": "EB-WP01",
        "origin": "Germany"
      },
      "price": 15,
      "quantity": 85,
      "shippingFee": 15,
      "tags": [{ "name": "Baby" }, { "name": "Wipes" }],
      "product_type": "simple"
    },
    {
      "name": "BPA-Free Baby Feeding Bottle Set",
      "category": "Baby Products",
      "subCategory": "Feeding & Nursing",
      "description": "Safe and durable BPA-free bottles for newborns and infants.",
      "product_details": "This BPA-Free Baby Feeding Bottle Set is crafted from high-quality, BPA-free plastic, ensuring safe feeding for newborns and infants. Each bottle features clear measurement markings for accurate portion control, a wide-neck design for easy filling and cleaning, and a soft silicone nipple that mimics natural breastfeeding. The anti-colic vent reduces air intake, minimizing the risk of gas and discomfort. Lightweight, durable, and leak-proof, these bottles are suitable for daily feeding, travel, or daycare use. Easy to assemble, sterilize, and clean, they provide convenience and safety for parents while ensuring babies receive a comfortable and hygienic feeding experience.",
      "additional_info": {
        "material": "BPA-free plastic, silicone nipple",
        "color": "Transparent",
        "weight": "200g per bottle",
        "dimensions": "150ml and 250ml bottles included",
        "care_instructions": "Sterilize before first use; dishwasher safe; avoid boiling plastic directly",
        "anti_colic": "Yes, vented design to reduce gas",
        "brand": "FeedMate",
        "model": "FM-BF01",
        "origin": "USA"
      },
      "price": 25,
      "quantity": 40,
      "shippingFee": 15,
      "tags": [{ "name": "Baby" }, { "name": "Feeding" }],
      "product_type": "simple"
    },
    {
      "name": "Glass Baby Feeding Bottles",
      "category": "Baby Products",
      "subCategory": "Feeding & Nursing",
      "description": "Durable and safe glass bottles for feeding infants.",
      "product_details": "Glass Baby Feeding Bottles offer a safe and durable feeding solution for infants. Made from tempered, BPA-free glass, these bottles are resistant to scratches and thermal shock. Each bottle comes with a soft silicone nipple for comfortable feeding and precise flow control. Measurement markings are easy to read, ensuring accurate feeding portions. The wide-neck design allows for simple cleaning and sterilization. Ideal for parents who prefer glass over plastic, these bottles are lightweight yet sturdy, easy to handle, and suitable for daily use, travel, or daycare. Designed for newborns and infants up to 12 months, they combine safety, durability, and comfort for babies.",
      "additional_info": {
        "material": "Tempered glass, silicone nipple",
        "color": "Transparent",
        "weight": "250g per bottle",
        "dimensions": "150ml and 250ml bottles included",
        "care_instructions": "Sterilize before first use; dishwasher safe; handle with care",
        "anti_colic": "Yes, vented design included",
        "brand": "BabyGlass",
        "model": "BG-BF01",
        "origin": "Germany"
      },
      "price": 35,
      "quantity": 35,
      "shippingFee": 15,
      "tags": [{ "name": "Baby" }, { "name": "Feeding" }],
      "product_type": "simple"
    },
    {
      "name": "Silicone Baby Feeding Bottle Set",
      "category": "Baby Products",
      "subCategory": "Feeding & Nursing",
      "description": "Flexible silicone bottles for easy, safe feeding.",
      "product_details": "Silicone Baby Feeding Bottles are made from soft, food-grade silicone, offering a flexible and safe feeding solution for infants. The bottles are lightweight, easy to squeeze, and gentle on tiny hands, allowing controlled milk flow. Soft silicone nipples mimic breastfeeding for a natural feeding experience, while anti-colic vents reduce air intake to prevent gas and discomfort. Dishwasher and sterilizer safe, these bottles are ideal for daily use, travel, or daycare. Durable and resistant to deformation, they maintain shape and hygiene even after repeated use. Suitable for newborns and infants up to 12 months, these bottles combine comfort, convenience, and safety for babies and parents alike.",
      "additional_info": {
        "material": "Food-grade silicone",
        "color": "Translucent Pink",
        "weight": "150g per bottle",
        "dimensions": "120ml and 200ml bottles included",
        "care_instructions": "Sterilize before first use; dishwasher safe",
        "anti_colic": "Yes, vented silicone nipple",
        "brand": "SilicoBaby",
        "model": "SB-BF01",
        "origin": "Italy"
      },
      "price": 28,
      "quantity": 45,
      "shippingFee": 15,
      "tags": [{ "name": "Baby" }, { "name": "Feeding" }],
      "product_type": "simple"
    },
    {
      "name": "Baby Nursing Bottle Warmer",
      "category": "Baby Products",
      "subCategory": "Feeding & Nursing",
      "description": "Convenient bottle warmer for safe and fast feeding.",
      "product_details": "The Baby Nursing Bottle Warmer allows parents to quickly and safely heat milk or formula to the perfect temperature. Compatible with most standard baby bottles, it features an adjustable temperature setting and automatic shut-off for safety. The compact design makes it ideal for home, travel, or daycare use. Gentle warming preserves essential nutrients and prevents hot spots that can burn baby’s mouth. Easy to use, clean, and maintain, this bottle warmer ensures parents provide consistently comfortable and hygienic feedings. Lightweight, portable, and energy-efficient, it’s an essential accessory for modern feeding routines.",
      "additional_info": {
        "material": "Plastic and stainless steel components",
        "color": "White",
        "weight": "400g",
        "dimensions": "Compact design, fits standard bottles",
        "care_instructions": "Wipe clean; do not immerse in water",
        "temperature_control": "Adjustable with auto shut-off",
        "brand": "FeedMate",
        "model": "FM-BW01",
        "origin": "USA"
      },
      "price": 40,
      "quantity": 50,
      "shippingFee": 15,
      "tags": [{ "name": "Baby" }, { "name": "Nursing" }],
      "product_type": "simple"
    },
    {
      "name": "Portable Baby Bottle Warmer",
      "category": "Baby Products",
      "subCategory": "Feeding & Nursing",
      "description": "Travel-friendly bottle warmer for feeding on the go.",
      "product_details": "The Portable Baby Bottle Warmer is designed for parents who need a convenient feeding solution while traveling. Lightweight and compact, it fits easily into diaper bags or car cup holders. Compatible with most standard baby bottles, it gently warms milk or formula to the ideal temperature without hot spots. Powered via USB or car adapter, it’s perfect for day trips, vacations, or long drives. Easy to operate, clean, and maintain, this warmer ensures babies receive warm milk anytime, anywhere. Safe and efficient, it provides peace of mind to parents on the go, combining practicality, comfort, and reliability.",
      "additional_info": {
        "material": "Plastic and stainless steel",
        "color": "Blue",
        "weight": "350g",
        "dimensions": "Fits standard baby bottles",
        "care_instructions": "Wipe clean; do not immerse in water",
        "temperature_control": "Gentle warming, portable design",
        "brand": "FeedMate",
        "model": "FM-BW02",
        "origin": "USA"
      },
      "price": 38,
      "quantity": 45,
      "shippingFee": 15,
      "tags": [{ "name": "Baby" }, { "name": "Nursing" }],
      "product_type": "simple"
    },
    {
      "name": "Baby Milk Powder Dispenser",
      "category": "Baby Products",
      "subCategory": "Feeding & Nursing",
      "description": "Compact dispenser for pre-measured milk powder, perfect for travel.",
      "product_details": "The Baby Milk Powder Dispenser provides a convenient way to store and carry pre-measured portions of milk powder, making feeding on the go simple and mess-free. Each compartment holds the exact amount needed for a single feed, reducing preparation time and ensuring accuracy. Made from BPA-free plastic, it is safe for baby use. The leak-proof design prevents spills, and the compact size fits easily in diaper bags or stroller compartments. Ideal for travel, daycare, or night feeds, this dispenser helps parents maintain hygiene and convenience while ensuring babies get perfectly measured feeds every time.",
      "additional_info": {
        "material": "BPA-free plastic",
        "color": "Transparent with blue lid",
        "weight": "150g",
        "dimensions": "4 compartments, each 30g capacity",
        "care_instructions": "Wash with warm soapy water; sterilize before first use",
        "brand": "FeedMate",
        "model": "FM-MPD01",
        "origin": "USA"
      },
      "price": 15,
      "quantity": 50,
      "shippingFee": 15,
      "tags": [{ "name": "Baby" }, { "name": "Feeding" }],
      "product_type": "simple"
    },
    {
      "name": "Baby Nursing Pillow",
      "category": "Baby Products",
      "subCategory": "Feeding & Nursing",
      "description": "Ergonomic pillow designed to support both baby and parent during feeding.",
      "product_details": "The Baby Nursing Pillow provides ergonomic support for both parent and baby during breastfeeding or bottle feeding. Contoured to fit comfortably around the waist, it helps position the baby at the right height to reduce strain on arms, shoulders, and back. Made with soft, breathable fabric and filled with hypoallergenic material, it ensures maximum comfort and safety for infants. The removable, machine-washable cover allows easy cleaning. Lightweight and portable, it is perfect for home use or travel. Designed to support proper posture and enhance feeding comfort, this pillow is ideal for newborns and infants up to 12 months old.",
      "additional_info": {
        "material": "Cotton cover, hypoallergenic polyester filling",
        "color": "Pastel Blue",
        "weight": "700g",
        "dimensions": "55cm x 35cm x 15cm",
        "care_instructions": "Machine wash cover; do not wash inner pillow",
        "brand": "BabyComfort",
        "model": "BC-NP01",
        "origin": "USA"
      },
      "price": 40,
      "quantity": 30,
      "shippingFee": 15,
      "tags": [{ "name": "Baby" }, { "name": "Nursing" }],
      "product_type": "simple"
    },
    {
      "name": "Multi-Purpose Baby Furniture Organizer",
      "category": "Baby Products",
      "subCategory": "Furniture",
      "description": "Compact and multi-functional baby furniture for storage and organization.",
      "product_details": "Made from sturdy wood and non-toxic paint. Multiple compartments for storage. Lightweight yet durable. Easy to assemble and clean. Stylish design fits modern nurseries. Safe edges and corners. Portable for moving around the house. Provides organized space for toys, clothes, and baby essentials. Perfect for small apartments. Enhances nursery decor while being functional.",
      "additional_info": {
        "material": "Wood",
        "color": "Natural",
        "weight": "12kg",
        "brand": "NurseryPlus",
        "model": "NP-FU01"
      },
      "price": 120,
      "sale_price": 100,
      "on_sale": true,
      "sale_start": "2025-11-05T00:00:00Z",
      "sale_end": "2025-12-05T23:59:59Z",
      "quantity": 25,
      "shippingFee": 15,
      "tags": [
        { "name": "Baby" },
        { "name": "Furniture" },
        { "name": "Organizer" }
      ],
      "product_type": "simple"
    },
    {
      "name": "Baby Bottle Sterilizer",
      "category": "Baby Products",
      "subCategory": "Feeding & Nursing",
      "description": "Efficient electric sterilizer to clean bottles and accessories safely.",
      "product_details": "The Baby Bottle Sterilizer is designed to quickly and effectively sterilize baby bottles, nipples, pacifiers, and small feeding accessories. Using steam technology, it kills 99.9% of harmful bacteria without chemicals, ensuring a hygienic feeding environment. The sterilizer has a large capacity to hold multiple bottles at once and features an automatic shut-off function for safety. Easy to assemble, clean, and use, it is suitable for home or travel. Compact and lightweight, it is ideal for busy parents who want safe and efficient sterilization, maintaining baby health and hygiene at all times.",
      "additional_info": {
        "material": "BPA-free plastic, stainless steel heating element",
        "color": "White",
        "weight": "1.2kg",
        "dimensions": "28cm x 20cm x 20cm",
        "care_instructions": "Wipe clean; do not immerse base in water",
        "brand": "FeedMate",
        "model": "FM-BS01",
        "origin": "USA"
      },
      "price": 60,
      "quantity": 25,
      "shippingFee": 15,
      "tags": [{ "name": "Baby" }, { "name": "Sterilizer" }],
      "product_type": "simple"
    },
    {
      "name": "Insulated Baby Bottle Bag",
      "category": "Baby Products",
      "subCategory": "Feeding & Nursing",
      "description": "Thermal bag to keep bottles warm or cool while on the go.",
      "product_details": "The Insulated Baby Bottle Bag is designed to maintain the temperature of baby bottles during travel. Featuring high-quality insulation and durable, BPA-free materials, it keeps milk or formula warm or cool for several hours. The bag includes separate compartments for bottles, milk powder containers, and small accessories. Lightweight, compact, and easy to carry, it fits into strollers or diaper bags conveniently. Easy to clean and water-resistant, this bag ensures safe, hygienic, and temperature-controlled feeding wherever parents go. Ideal for day trips, outings, and daycare, it enhances convenience and comfort for babies and parents alike.",
      "additional_info": {
        "material": "BPA-free insulated fabric",
        "color": "Gray with blue accents",
        "weight": "400g",
        "dimensions": "25cm x 15cm x 15cm",
        "care_instructions": "Wipe clean with damp cloth; air dry",
        "temperature_control": "Maintains warm or cool temperature up to 4 hours",
        "brand": "FeedMate",
        "model": "FM-IBB01",
        "origin": "USA"
      },
      "price": 30,
      "quantity": 40,
      "shippingFee": 15,
      "tags": [{ "name": "Baby" }, { "name": "Feeding" }],
      "product_type": "simple"
    },
    {
      "name": "Baby Formula Mixer Bottle",
      "category": "Baby Products",
      "subCategory": "Feeding & Nursing",
      "description": "Innovative bottle that mixes formula effortlessly without clumps.",
      "product_details": "The Baby Formula Mixer Bottle allows parents to prepare baby formula quickly and efficiently, preventing clumps or powder residue. The built-in mixing mechanism ensures smooth, evenly blended milk, saving time and effort during busy feeding sessions. Made from BPA-free, food-grade plastic, the bottle is safe, durable, and lightweight. The soft silicone nipple provides a natural feeding experience, while clear measurement markings allow accurate portioning. Dishwasher and sterilizer safe, this bottle is ideal for newborns and infants up to 12 months, combining convenience, hygiene, and comfort for both babies and parents.",
      "additional_info": {
        "material": "BPA-free plastic, silicone nipple",
        "color": "Transparent with green lid",
        "weight": "220g",
        "dimensions": "250ml capacity",
        "care_instructions": "Sterilize before first use; dishwasher safe",
        "anti_clump": "Built-in mixing mechanism prevents clumps",
        "brand": "MixMate",
        "model": "MM-BF01",
        "origin": "USA"
      },
      "price": 28,
      "quantity": 50,
      "shippingFee": 15,
      "tags": [{ "name": "Baby" }, { "name": "Feeding" }],
      "product_type": "simple"
    },
    {
      "name": "Soft Plush Baby Toy",
      "category": "Baby Products",
      "subCategory": "Toys",
      "description": "Cute and soft plush toy for babies to cuddle and play with.",
      "product_details": "This Soft Plush Baby Toy is designed for newborns and infants, providing comfort, entertainment, and sensory stimulation. Made from premium non-toxic plush fabric, it is soft to the touch and safe for babies to cuddle or chew. The toy encourages early tactile exploration and can help develop fine motor skills through grasping and squeezing. Its lightweight design makes it easy for tiny hands to hold, and machine-washable construction ensures hygienic use. With vibrant colors and friendly design, this toy keeps babies engaged while providing comfort and security, making it an essential companion for playtime and naptime.",
      "additional_info": {
        "material": "Plush fabric, non-toxic",
        "color": "Yellow",
        "weight": "150g",
        "dimensions": "15cm x 15cm x 10cm",
        "care_instructions": "Machine wash cold; air dry; do not bleach",
        "age_range": "0-12 months",
        "brand": "ToyBaby",
        "model": "TB-PL01",
        "origin": "USA"
      },
      "price": 18,
      "quantity": 60,
      "shippingFee": 15,
      "tags": [{ "name": "Baby" }, { "name": "Toys" }],
      "product_type": "simple"
    },
    {
      "name": "Rattling Baby Toy Set",
      "category": "Baby Products",
      "subCategory": "Toys",
      "description": "Set of colorful rattles to stimulate baby's senses.",
      "product_details": "The Rattling Baby Toy Set includes multiple lightweight rattles designed to stimulate auditory and visual senses of infants. Each rattle produces soft, pleasant sounds when shaken, encouraging hand-eye coordination, grasping skills, and sensory development. Made from BPA-free, non-toxic materials, these rattles are safe for babies to handle and chew. The colorful and textured surfaces promote tactile exploration, while the compact size allows easy grasping for tiny hands. Perfect for newborns and infants up to 12 months, this toy set provides safe entertainment, developmental stimulation, and interactive play, supporting early learning through fun and engaging activities.",
      "additional_info": {
        "material": "BPA-free plastic",
        "color": "Multicolor",
        "weight": "100g per rattle",
        "dimensions": "10cm x 5cm per rattle",
        "care_instructions": "Wipe clean with damp cloth; do not boil",
        "age_range": "0-12 months",
        "brand": "BabyJoy",
        "model": "BJ-RT01",
        "origin": "Germany"
      },
      "price": 22,
      "quantity": 70,
      "shippingFee": 15,
      "tags": [{ "name": "Baby" }, { "name": "Toys" }],
      "product_type": "simple"
    },
    {
      "name": "Interactive Baby Activity Gym",
      "category": "Baby Products",
      "subCategory": "Toys",
      "description": "Multi-sensory activity gym with hanging toys and play mat.",
      "product_details": "The Interactive Baby Activity Gym provides a safe and stimulating environment for infants to explore. It includes a soft, padded play mat with vibrant colors and patterns to capture attention, along with multiple detachable hanging toys that promote grasping, batting, and reaching. Mirrors, crinkly textures, and soft rattles encourage sensory development, coordination, and early motor skills. Made from non-toxic, BPA-free materials, the gym is safe for babies to interact with and easy to clean. Suitable for newborns up to 12 months, it offers an engaging play experience that combines fun, comfort, and early developmental support.",
      "additional_info": {
        "material": "Soft fabric, BPA-free plastic, non-toxic fibers",
        "color": "Multicolor",
        "weight": "1kg",
        "dimensions": "90cm x 60cm x 50cm",
        "care_instructions": "Machine wash mat cover; wipe toys clean",
        "age_range": "0-12 months",
        "brand": "PlaySmart",
        "model": "PS-AG01",
        "origin": "USA"
      },
      "price": 55,
      "quantity": 35,
      "shippingFee": 15,
      "tags": [{ "name": "Baby" }, { "name": "Activity Gym" }],
      "product_type": "simple"
    },
    {
      "name": "Teething Ring Set",
      "category": "Baby Products",
      "subCategory": "Toys",
      "description": "Safe silicone teething rings to soothe baby gums.",
      "product_details": "The Teething Ring Set is crafted from soft, food-grade silicone that is gentle on baby gums during teething. The textured surfaces provide soothing relief, while encouraging hand-eye coordination and grasping skills. The rings are lightweight and easy for babies to hold and chew, reducing discomfort during teething phases. BPA-free, non-toxic, and easy to clean, these rings are safe for everyday use. Their compact design makes them perfect for home or on-the-go use, supporting healthy oral development and sensory stimulation. Suitable for infants 3 months and older, they offer comfort and fun during a crucial developmental stage.",
      "additional_info": {
        "material": "Food-grade silicone",
        "color": "Pastel Blue and Pink",
        "weight": "80g",
        "dimensions": "10cm diameter per ring",
        "care_instructions": "Boil for 3 minutes before first use; wash regularly",
        "age_range": "3-12 months",
        "brand": "TinyTeeth",
        "model": "TT-TR01",
        "origin": "USA"
      },
      "price": 15,
      "quantity": 80,
      "shippingFee": 15,
      "tags": [{ "name": "Baby" }, { "name": "Teething" }],
      "product_type": "simple"
    },
    {
      "name": "Baby Musical Toy Set",
      "category": "Baby Products",
      "subCategory": "Toys",
      "description": "Set of musical toys to introduce babies to sounds and rhythm.",
      "product_details": "The Baby Musical Toy Set includes a variety of sound-producing toys such as mini tambourines, maracas, and xylophones, designed to introduce babies to music and rhythm. Each toy is lightweight, easy to grasp, and made from BPA-free, non-toxic materials. Gentle, melodic sounds stimulate auditory development, while vibrant colors and textures engage visual and tactile senses. This set encourages early coordination, creativity, and interactive play, supporting cognitive and motor skill development. Ideal for infants 6-12 months, these toys provide a safe, fun, and educational playtime experience, enhancing early sensory exploration and musical interest.",
      "additional_info": {
        "material": "BPA-free plastic, wood",
        "color": "Multicolor",
        "weight": "200g per toy",
        "dimensions": "Varies per toy, 10-15cm",
        "care_instructions": "Wipe clean with damp cloth; do not submerge in water",
        "age_range": "6-12 months",
        "brand": "MusicBaby",
        "model": "MB-MT01",
        "origin": "Germany"
      },
      "price": 35,
      "quantity": 40,
      "shippingFee": 15,
      "tags": [{ "name": "Baby" }, { "name": "Musical" }],
      "product_type": "simple"
    },
    {
      "name": "Adjustable Baby Bedding Set",
      "category": "Baby Products",
      "subCategory": "Bedding",
      "description": "Soft and cozy bedding set for infants, includes pillow and blanket.",
      "product_details": "Made from soft cotton blend, breathable and comfortable. Includes a small pillow and a baby blanket. Hypoallergenic and chemical-free. Easy to wash and maintain. Lightweight and portable. Stylish pastel colors. Designed for cribs and baby cots. Safe for newborn skin. Durable and long-lasting fabric. Perfect for daily use or gifting.",
      "additional_info": {
        "material": "Cotton Blend",
        "color": "Light Blue",
        "weight": "450g",
        "brand": "BabySoft",
        "model": "BS-BD01"
      },
      "price": 40,
      "sale_price": 35,
      "on_sale": true,
      "sale_start": "2025-11-05T00:00:00Z",
      "sale_end": "2025-12-05T23:59:59Z",
      "quantity": 50,
      "shippingFee": 15,
      "tags": [{ "name": "Baby" }, { "name": "Bedding" }, { "name": "Soft" }],
      "product_type": "simple"
    },
    {
      "name": "Stacking and Sorting Blocks",
      "category": "Baby Products",
      "subCategory": "Toys",
      "description": "Colorful blocks that help babies develop hand-eye coordination and problem-solving skills.",
      "product_details": "The Stacking and Sorting Blocks set features vibrant, lightweight blocks designed to promote early cognitive and motor development. Babies can stack, sort, and arrange the blocks, improving hand-eye coordination, spatial awareness, and problem-solving skills. Made from non-toxic, BPA-free plastic, these blocks are safe for babies to handle and chew. Each block is easy to grasp for tiny hands, with smooth edges for safety. Ideal for infants 6-12 months, this educational toy encourages interactive play, creativity, and learning while providing hours of entertainment. Compact and easy to store, it’s perfect for home or daycare use.",
      "additional_info": {
        "material": "BPA-free plastic",
        "color": "Multicolor",
        "weight": "250g",
        "dimensions": "12 blocks, sizes 5cm x 5cm x 5cm",
        "care_instructions": "Wipe clean with damp cloth; avoid boiling",
        "age_range": "6-12 months",
        "brand": "EduBaby",
        "model": "EB-SB01",
        "origin": "USA"
      },
      "price": 25,
      "quantity": 50,
      "shippingFee": 15,
      "tags": [{ "name": "Baby" }, { "name": "Blocks" }],
      "product_type": "simple"
    },
    {
      "name": "Soft Baby Book Set",
      "category": "Baby Products",
      "subCategory": "Toys",
      "description": "Fabric books with colorful pages and textures for early learning.",
      "product_details": "The Soft Baby Book Set includes multiple fabric books with colorful, engaging illustrations, textures, and interactive elements. Designed for newborns and infants, these books encourage early literacy, sensory development, and hand-eye coordination. Each page features tactile elements such as crinkles, flaps, and soft fabrics to stimulate exploration and curiosity. Made from non-toxic, washable materials, the books are safe for babies to handle, chew, and cuddle. Lightweight and portable, they are perfect for bedtime, stroller rides, or playtime. This set promotes early language skills, cognitive development, and a love for reading from an early age.",
      "additional_info": {
        "material": "Cotton fabric, polyester filling",
        "color": "Multicolor",
        "weight": "300g total",
        "dimensions": "15cm x 15cm per book",
        "care_instructions": "Machine wash cold; air dry",
        "age_range": "0-12 months",
        "brand": "TinyReaders",
        "model": "TR-BS01",
        "origin": "USA"
      },
      "price": 20,
      "quantity": 60,
      "shippingFee": 15,
      "tags": [{ "name": "Baby" }, { "name": "Books" }],
      "product_type": "simple"
    },
    {
      "name": "Compact Messenger Bag",
      "category": "Accessories",
      "subCategory": "Bags",
      "description": "Sleek and compact messenger bag with multiple pockets and adjustable strap.",
      "product_details": "Durable synthetic material with smooth finish. Multiple compartments for laptop, documents, and accessories. Adjustable shoulder strap for comfort. Lightweight and portable. Strong zippers for security. Stylish and professional design. Resistant to scratches and wear. Easy to clean and maintain. Ideal for work, school, or travel. Versatile for everyday use. High-quality craftsmanship.",
      "additional_info": {
        "material": "Synthetic Leather",
        "color": "Black",
        "weight": "600g",
        "brand": "UrbanCarry",
        "model": "UC-MB02"
      },
      "price": 60,
      "sale_price": 50,
      "on_sale": true,
      "sale_start": "2025-11-05T00:00:00Z",
      "sale_end": "2025-12-05T23:59:59Z",
      "quantity": 70,
      "shippingFee": 15,
      "tags": [
        { "name": "Bag" },
        { "name": "Messenger" },
        { "name": "Compact" }
      ],
      "product_type": "simple"
    },
    {
      "name": "Baby Pull-Along Toy",
      "category": "Baby Products",
      "subCategory": "Toys",
      "description": "Rolling toy that encourages crawling and walking practice.",
      "product_details": "The Baby Pull-Along Toy is designed to encourage mobility, crawling, and walking practice. Featuring a lightweight, durable design with smooth-rolling wheels and a pull string, it motivates babies to move and explore their surroundings. Made from non-toxic, BPA-free plastic and wood, this toy is safe for daily play. The bright colors and interactive elements such as rattles, spinning beads, and movable parts engage visual, auditory, and tactile senses. Suitable for infants 6-12 months, it supports gross motor skills, coordination, and early muscle development. Compact and easy to store, this toy combines fun, learning, and mobility enhancement for babies.",
      "additional_info": {
        "material": "BPA-free plastic, wood, non-toxic paint",
        "color": "Multicolor",
        "weight": "500g",
        "dimensions": "20cm x 10cm x 12cm",
        "care_instructions": "Wipe clean with damp cloth; avoid submerging in water",
        "age_range": "6-12 months",
        "brand": "MoveBaby",
        "model": "MB-PT01",
        "origin": "USA"
      },
      "price": 28,
      "quantity": 40,
      "shippingFee": 15,
      "tags": [{ "name": "Baby" }, { "name": "Pull-Along" }],
      "product_type": "simple"
    },
    {
      "name": "Baby Sensory Balls Set",
      "category": "Baby Products",
      "subCategory": "Toys",
      "description": "Textured balls that develop touch, grip, and sensory skills.",
      "product_details": "The Baby Sensory Balls Set includes multiple soft, textured balls designed to stimulate tactile exploration, grip strength, and sensory development. Each ball has unique patterns, textures, and sizes to enhance fine motor skills, hand-eye coordination, and cognitive learning. Lightweight and safe for babies to grasp, chew, or roll, the balls are made from non-toxic, BPA-free materials. Bright colors and interactive designs encourage visual and auditory exploration. Suitable for infants 3-12 months, this set promotes safe play, developmental skills, and interactive fun. Easy to clean and store, it’s perfect for home or daycare environments.",
      "additional_info": {
        "material": "BPA-free rubber and plastic",
        "color": "Multicolor",
        "weight": "80g per ball",
        "dimensions": "Diameter 7cm per ball",
        "care_instructions": "Wipe clean; boil for sterilization if needed",
        "age_range": "3-12 months",
        "brand": "SensoryBaby",
        "model": "SB-SB01",
        "origin": "USA"
      },
      "price": 25,
      "quantity": 50,
      "shippingFee": 15,
      "tags": [{ "name": "Baby" }, { "name": "Sensory" }],
      "product_type": "simple"
    },
    {
      "name": "Baby Soft Rattle Shoes",
      "category": "Baby Products",
      "subCategory": "Toys",
      "description": "Interactive shoes that rattle with each step for fun and sensory play.",
      "product_details": "The Baby Soft Rattle Shoes combine comfort and play by making gentle rattling sounds with each step, encouraging walking practice and sensory exploration. Made from soft, breathable fabric and safe non-toxic materials, these shoes are lightweight, flexible, and gentle on tiny feet. The soft sole supports early walking while providing tactile stimulation. Ideal for infants 6-12 months learning to crawl and walk, these shoes promote auditory, tactile, and gross motor development. Easy to clean, machine-washable, and stylish, they offer parents a fun and interactive way to keep babies engaged while encouraging mobility and coordination.",
      "additional_info": {
        "material": "Fabric, non-toxic rattles",
        "color": "Pink",
        "weight": "80g per pair",
        "dimensions": "Size suitable for 6-12 months",
        "care_instructions": "Machine wash cold; air dry",
        "age_range": "6-12 months",
        "brand": "TinySteps",
        "model": "TS-RS01",
        "origin": "USA"
      },
      "price": 20,
      "quantity": 50,
      "shippingFee": 15,
      "tags": [{ "name": "Baby" }, { "name": "Interactive" }],
      "product_type": "simple"
    },
    {
      "name": "Lightweight Infant Stroller",
      "category": "Baby Products",
      "subCategory": "Strollers & Car Seats",
      "description": "Compact and foldable stroller for easy travel and everyday use.",
      "product_details": "The Lightweight Infant Stroller is designed for parents seeking convenience, comfort, and safety. Its compact, foldable design allows easy storage and transportation, making it perfect for urban environments and travel. Equipped with a multi-position recline and adjustable canopy, it ensures comfort for infants during naps or outings. The stroller features smooth, swivel front wheels for effortless maneuverability and a secure braking system for safety. Made from durable, lightweight materials, it supports infants up to 15kg. The seat is padded and lined with soft, breathable fabric for extra comfort, and storage space is included for essentials, combining functionality, safety, and style.",
      "additional_info": {
        "material": "Aluminum frame, polyester seat fabric",
        "color": "Gray",
        "weight": "7kg",
        "dimensions": "90cm x 50cm x 100cm",
        "care_instructions": "Wipe clean with damp cloth; machine wash seat cover",
        "age_range": "0-12 months",
        "brand": "SafeRide",
        "model": "SR-ST01",
        "foldable": "Yes, one-hand fold",
        "origin": "USA"
      },
      "price": 200,
      "quantity": 20,
      "shippingFee": 15,
      "tags": [{ "name": "Baby" }, { "name": "Stroller" }],
      "product_type": "simple"
    },
    {
      "name": "Travel System Stroller with Car Seat",
      "category": "Baby Products",
      "subCategory": "Strollers & Car Seats",
      "description": "All-in-one stroller and infant car seat system for seamless travel.",
      "product_details": "The Travel System Stroller with Car Seat offers a complete solution for parents on the go. The infant car seat securely clicks into the stroller frame, allowing smooth transitions between car and walk without disturbing the baby. The stroller features adjustable reclining positions, extendable canopy, and ample storage basket for daily essentials. It is lightweight, foldable, and designed for easy maneuvering in tight spaces. Made from durable aluminum and high-quality fabrics, the system ensures safety, comfort, and durability. Ideal for newborns up to 12 months, it provides parents with convenience, versatility, and peace of mind during travel and daily outings.",
      "additional_info": {
        "material": "Aluminum frame, polyester fabric, plastic car seat",
        "color": "Black",
        "weight": "10kg",
        "dimensions": "Stroller: 95cm x 55cm x 105cm, Car seat: 30cm x 45cm x 65cm",
        "care_instructions": "Wipe stroller and car seat; remove fabric for machine wash",
        "age_range": "0-12 months",
        "brand": "SafeRide",
        "model": "SR-TS01",
        "origin": "USA"
      },
      "price": 350,
      "quantity": 15,
      "shippingFee": 15,
      "tags": [{ "name": "Baby" }, { "name": "Travel System" }],
      "product_type": "simple"
    },
    {
      "name": "Jogging Stroller",
      "category": "Baby Products",
      "subCategory": "Strollers & Car Seats",
      "description": "Sturdy stroller designed for parents who enjoy jogging or outdoor activities.",
      "product_details": "The Jogging Stroller combines safety, comfort, and performance for active parents. Designed with large air-filled tires and front wheel suspension, it ensures smooth rides over various terrains. The stroller has a secure five-point harness, adjustable seat recline, and large canopy for sun protection. The ergonomic handlebar offers comfort during long runs, while the lightweight aluminum frame allows easy folding and portability. Made from durable, weather-resistant materials, it is suitable for infants 6-36 months. This stroller supports active lifestyles, offering stability, safety, and comfort for both parent and child during jogging and outdoor adventures.",
      "additional_info": {
        "material": "Aluminum frame, polyester fabric, rubber tires",
        "color": "Red",
        "weight": "12kg",
        "dimensions": "105cm x 65cm x 105cm",
        "care_instructions": "Wipe fabric; air dry",
        "age_range": "6-36 months",
        "brand": "ActiveBaby",
        "model": "AB-JS01",
        "suspension": "Front wheel shock absorption",
        "origin": "USA"
      },
      "price": 400,
      "quantity": 10,
      "shippingFee": 15,
      "tags": [{ "name": "Baby" }, { "name": "Jogging Stroller" }],
      "product_type": "simple"
    },
    {
      "name": "Luxury Bassinet Stroller",
      "category": "Baby Products",
      "subCategory": "Strollers & Car Seats",
      "description": "Elegant stroller with detachable bassinet for newborn comfort.",
      "product_details": "The Luxury Bassinet Stroller offers premium comfort for newborns and convenience for parents. The detachable bassinet is soft, padded, and designed for flat-lying sleep, providing a cozy environment for infants. The stroller features adjustable canopy, storage basket, and shock-absorbing wheels for a smooth ride. Lightweight and foldable, it is easy to carry and store. High-quality fabrics and durable frame ensure longevity, safety, and style. Suitable for newborns up to 6 months, this stroller allows parents to transition from bassinet to seat mode as the baby grows. Elegant design meets functionality and safety, ideal for parents seeking a luxurious option.",
      "additional_info": {
        "material": "Aluminum frame, polyester fabric, padded bassinet",
        "color": "Cream",
        "weight": "9kg",
        "dimensions": "Stroller: 95cm x 55cm x 100cm, Bassinet: 30cm x 45cm x 70cm",
        "care_instructions": "Remove fabric for machine wash; wipe frame clean",
        "age_range": "0-6 months",
        "brand": "LuxBaby",
        "model": "LB-BS01",
        "foldable": "Yes, compact fold",
        "origin": "Italy"
      },
      "price": 500,
      "quantity": 12,
      "shippingFee": 15,
      "tags": [{ "name": "Baby" }, { "name": "Bassinet" }],
      "product_type": "simple"
    },
    {
      "name": "Twin Baby Stroller",
      "category": "Baby Products",
      "subCategory": "Strollers & Car Seats",
      "description": "Double stroller designed to comfortably carry two babies at once.",
      "product_details": "The Twin Baby Stroller is designed for parents of twins or siblings close in age. Featuring two side-by-side seats with adjustable recline and canopy, it ensures comfort for both children. The stroller includes a large storage basket, cup holders, and easy-to-use braking system for safety. Smooth swivel front wheels allow maneuverability in tight spaces. Made from durable, lightweight aluminum and premium fabric, it supports infants up to 15kg each. Suitable for daily walks, shopping trips, and outdoor activities, this double stroller combines convenience, safety, and style, allowing parents to travel comfortably with two babies simultaneously.",
      "additional_info": {
        "material": "Aluminum frame, polyester fabric",
        "color": "Blue",
        "weight": "14kg",
        "dimensions": "110cm x 70cm x 105cm",
        "care_instructions": "Wipe clean; machine wash seat covers",
        "age_range": "0-24 months",
        "brand": "TwinRide",
        "model": "TR-DS01",
        "foldable": "Yes, compact fold",
        "origin": "USA"
      },
      "price": 450,
      "quantity": 8,
      "shippingFee": 15,
      "tags": [{ "name": "Baby" }, { "name": "Twin Stroller" }],
      "product_type": "simple"
    },
    {
      "name": "Convertible Car Seat",
      "category": "Baby Products",
      "subCategory": "Strollers & Car Seats",
      "description": "Car seat that converts from rear-facing to forward-facing for growing babies.",
      "product_details": "The Convertible Car Seat is engineered for maximum safety, comfort, and adaptability as your child grows. Initially rear-facing for infants, it can easily convert to a forward-facing seat for toddlers, supporting children up to 36kg. It features side-impact protection, energy-absorbing foam, and a five-point harness system to ensure safety during travel. The seat is padded with soft, breathable fabric to provide comfort on long journeys. Easy to install with ISOFIX or seat belt, it offers convenience and peace of mind. Suitable for newborns to toddlers, it combines durability, safety certifications, and comfort for everyday car rides.",
      "additional_info": {
        "material": "Polyester fabric, impact-resistant plastic",
        "color": "Gray",
        "weight": "10kg",
        "dimensions": "65cm x 45cm x 50cm",
        "care_instructions": "Remove cover for machine wash; wipe frame clean",
        "age_range": "0-6 years",
        "brand": "SafeRide",
        "model": "SR-CS01",
        "safety_certifications": "ECE R44/04",
        "origin": "USA"
      },
      "price": 280,
      "quantity": 25,
      "shippingFee": 15,
      "tags": [{ "name": "Baby" }, { "name": "Car Seat" }],
      "product_type": "simple"
    },
    {
      "name": "Reversible Stroller Seat",
      "category": "Baby Products",
      "subCategory": "Strollers & Car Seats",
      "description": "Stroller with reversible seat that can face parent or outward.",
      "product_details": "The Reversible Stroller Seat provides flexibility and comfort for babies and parents. The seat can easily be rotated to face the parent, offering interaction and bonding, or outward for exploration of the surroundings. Equipped with adjustable recline, padded harness, and extendable canopy, it ensures safety and comfort. The lightweight aluminum frame, smooth-rolling wheels, and foldable design make it convenient for travel and storage. Suitable for infants 0-36 months, it promotes both security and engagement during walks. Durable fabrics and high-quality construction guarantee long-lasting performance, combining style, practicality, and child-friendly design.",
      "additional_info": {
        "material": "Aluminum frame, polyester fabric",
        "color": "Navy Blue",
        "weight": "8.5kg",
        "dimensions": "95cm x 55cm x 100cm",
        "care_instructions": "Wipe clean; machine wash seat cover",
        "age_range": "0-36 months",
        "brand": "FlexiBaby",
        "model": "FB-RS01",
        "foldable": "Yes, compact fold",
        "origin": "USA"
      },
      "price": 220,
      "quantity": 20,
      "shippingFee": 15,
      "tags": [{ "name": "Baby" }, { "name": "Reversible Stroller" }],
      "product_type": "simple"
    },
    {
      "name": "All-Terrain Stroller",
      "category": "Baby Products",
      "subCategory": "Strollers & Car Seats",
      "description": "Durable stroller designed for rough terrains and outdoor adventures.",
      "product_details": "The All-Terrain Stroller is built for parents who enjoy outdoor activities. It features large, air-filled tires and front-wheel suspension for a smooth ride over sand, gravel, or grass. The stroller comes with a reclining seat, five-point harness, and adjustable canopy for safety and comfort. Its lightweight aluminum frame allows easy folding and portability. High-quality, water-resistant fabrics provide durability and easy cleaning. Suitable for infants 6-36 months, it supports active families seeking adventure without compromising safety. This stroller encourages outdoor exploration, development of gross motor skills, and parent-baby bonding through versatile and reliable performance.",
      "additional_info": {
        "material": "Aluminum frame, polyester fabric, rubber tires",
        "color": "Green",
        "weight": "13kg",
        "dimensions": "105cm x 60cm x 105cm",
        "care_instructions": "Wipe frame; machine wash fabric covers",
        "age_range": "6-36 months",
        "brand": "AdventureBaby",
        "model": "AB-AT01",
        "suspension": "Front and rear wheel shock absorption",
        "origin": "USA"
      },
      "price": 380,
      "quantity": 12,
      "shippingFee": 15,
      "tags": [{ "name": "Baby" }, { "name": "All-Terrain" }],
      "product_type": "simple"
    },
    {
      "name": "Umbrella Stroller",
      "category": "Baby Products",
      "subCategory": "Strollers & Car Seats",
      "description": "Lightweight umbrella stroller ideal for travel and quick trips.",
      "product_details": "The Umbrella Stroller is designed for parents needing a lightweight, compact, and easy-to-fold solution for everyday travel. Its minimalistic frame allows easy maneuverability in crowded spaces, while the canopy provides sun protection. Suitable for children 6-36 months, it features a comfortable seat with a safety harness. The umbrella-style fold makes it extremely portable, perfect for public transport or short trips. Durable, water-resistant fabrics and non-toxic materials ensure longevity and safety. This stroller is ideal for families who require convenience, quick storage, and lightweight functionality without compromising essential safety and comfort features.",
      "additional_info": {
        "material": "Aluminum frame, polyester fabric",
        "color": "Red",
        "weight": "5kg",
        "dimensions": "90cm x 45cm x 100cm",
        "care_instructions": "Wipe fabric; do not machine wash",
        "age_range": "6-36 months",
        "brand": "TravelLite",
        "model": "TL-US01",
        "foldable": "Yes, umbrella fold",
        "origin": "USA"
      },
      "price": 120,
      "quantity": 30,
      "shippingFee": 15,
      "tags": [{ "name": "Baby" }, { "name": "Umbrella Stroller" }],
      "product_type": "simple"
    },
    {
      "name": "Compact Fold Car Seat Stroller Combo",
      "category": "Baby Products",
      "subCategory": "Strollers & Car Seats",
      "description": "Space-saving stroller that integrates with infant car seat for travel convenience.",
      "product_details": "The Compact Fold Car Seat Stroller Combo is perfect for urban parents with limited storage space. The stroller integrates seamlessly with a compatible infant car seat, allowing smooth transitions between car and walk without disturbing the baby. Lightweight aluminum frame and easy-fold mechanism ensure portability and storage convenience. Adjustable reclining seat, extendable canopy, and safety harness provide comfort and security. Suitable for newborns up to 12 months, this combo supports daily commuting, shopping, and travel. Durable fabrics and sturdy construction ensure long-lasting use, while compact fold design maximizes practicality for busy families seeking efficient, all-in-one solutions.",
      "additional_info": {
        "material": "Aluminum frame, polyester fabric, plastic car seat",
        "color": "Black",
        "weight": "9kg",
        "dimensions": "Stroller: 95cm x 50cm x 100cm, Car seat: 30cm x 45cm x 65cm",
        "care_instructions": "Wipe frame; machine wash removable seat fabric",
        "age_range": "0-12 months",
        "brand": "UrbanBaby",
        "model": "UB-CF01",
        "foldable": "Yes, compact fold",
        "origin": "USA"
      },
      "price": 300,
      "quantity": 18,
      "shippingFee": 15,
      "tags": [{ "name": "Baby" }, { "name": "Car Seat Combo" }],
      "product_type": "simple"
    },
    {
      "name": "Gentle Baby Shampoo",
      "category": "Baby Products",
      "subCategory": "Bath & Skincare",
      "description": "Tear-free shampoo suitable for newborns, keeps hair soft and clean.",
      "product_details": "Gentle Baby Shampoo is specially formulated for newborns and infants with delicate scalps. It features a tear-free, hypoallergenic formula that cleans hair without irritation. Enriched with natural extracts and mild surfactants, it keeps hair soft, shiny, and healthy while preserving natural moisture. The shampoo is dermatologically tested and free from parabens, sulfates, and artificial fragrances. Ideal for daily use, it ensures a gentle and soothing bath experience. Perfect for babies with sensitive skin, this shampoo promotes hair and scalp health while being safe, mild, and nurturing for little ones.",
      "additional_info": {
        "material": "Liquid formulation with natural extracts",
        "color": "Transparent",
        "weight": "250g",
        "dimensions": "Height: 18cm, Width: 5cm",
        "care_instructions": "Rinse immediately if contact with eyes; store in cool, dry place",
        "age_range": "0-24 months",
        "brand": "BabyCare",
        "model": "BC-SH01",
        "scent": "Mild floral",
        "origin": "USA"
      },
      "price": 12,
      "quantity": 100,
      "shippingFee": 15,
      "tags": [{ "name": "Baby" }, { "name": "Shampoo" }],
      "product_type": "simple"
    },
    {
      "name": "Premium Leather Watch",
      "category": "Accessories",
      "subCategory": "Watches",
      "description": "Elegant premium leather watch with water-resistant stainless steel case.",
      "product_details": "Genuine leather strap ensures comfort and durability. Quartz movement for precise timekeeping. Stainless steel case resists corrosion and maintains shine. Water-resistant up to 50 meters. Scratch-resistant mineral glass. Classic design suits casual and formal outfits. Adjustable buckle for perfect fit. Lightweight yet solid. Ideal for gifting. Elegant craftsmanship with attention to detail. Long-lasting and reliable for everyday wear.",
      "additional_info": {
        "material": "Leather & Stainless Steel",
        "color": "Brown & Silver",
        "weight": "125g",
        "brand": "TimeMaster",
        "model": "TM-LW02"
      },
      "price": 260,
      "sale_price": 220,
      "on_sale": true,
      "sale_start": "2025-11-05T00:00:00Z",
      "sale_end": "2025-12-05T23:59:59Z",
      "quantity": 40,
      "shippingFee": 15,
      "tags": [
        { "name": "Watch" },
        { "name": "Leather" },
        { "name": "Luxury" }
      ],
      "product_type": "simple"
    },
    {
      "name": "Soothing Baby Body Wash",
      "category": "Baby Products",
      "subCategory": "Bath & Skincare",
      "description": "Gentle body wash that cleanses skin without drying it out.",
      "product_details": "The Soothing Baby Body Wash is a mild, tear-free cleanser designed to gently wash a baby’s delicate skin. Formulated with natural moisturizers like aloe vera and chamomile extract, it nourishes and protects the skin while creating a rich lather. Hypoallergenic and free from harmful chemicals, this body wash maintains the skin’s natural barrier and prevents dryness. Suitable for daily use, it provides a calming bath experience while leaving skin soft, smooth, and hydrated. Dermatologist-tested and pediatrician-approved, it ensures safety and care for newborns and infants, making bath time both enjoyable and nurturing.",
      "additional_info": {
        "material": "Liquid with aloe vera and chamomile extract",
        "color": "Light green",
        "weight": "300g",
        "dimensions": "Height: 20cm, Width: 6cm",
        "care_instructions": "Rinse off completely; store away from sunlight",
        "age_range": "0-24 months",
        "brand": "BabyCare",
        "model": "BC-BW01",
        "scent": "Chamomile",
        "origin": "USA"
      },
      "price": 15,
      "quantity": 80,
      "shippingFee": 15,
      "tags": [{ "name": "Baby" }, { "name": "Body Wash" }],
      "product_type": "simple"
    },
    {
      "name": "Moisturizing Baby Lotion",
      "category": "Baby Products",
      "subCategory": "Bath & Skincare",
      "description": "Hydrating lotion that keeps baby's skin soft and nourished.",
      "product_details": "The Moisturizing Baby Lotion is crafted to maintain soft, supple skin for infants. Enriched with natural oils and vitamins, it provides long-lasting hydration, preventing dryness and irritation. The lightweight formula absorbs quickly without leaving a greasy residue, making it ideal for daily use. Hypoallergenic and free of parabens, sulfates, and artificial dyes, it is safe for sensitive skin. Gently massage onto baby’s skin after bath time to lock in moisture and promote healthy skin barrier development. Dermatologically tested, this lotion ensures comfort, protection, and nourishment for delicate baby skin.",
      "additional_info": {
        "material": "Lotion with shea butter, coconut oil, and vitamins",
        "color": "White",
        "weight": "200g",
        "dimensions": "Height: 15cm, Width: 5cm",
        "care_instructions": "Store in a cool, dry place; avoid contact with eyes",
        "age_range": "0-24 months",
        "brand": "BabyCare",
        "model": "BC-LT01",
        "scent": "Mild vanilla",
        "origin": "USA"
      },
      "price": 18,
      "quantity": 90,
      "shippingFee": 15,
      "tags": [{ "name": "Baby" }, { "name": "Lotion" }],
      "product_type": "simple"
    },
    {
      "name": "Baby Diaper Rash Cream",
      "category": "Baby Products",
      "subCategory": "Bath & Skincare",
      "description": "Protective cream that soothes and prevents diaper rash.",
      "product_details": "Baby Diaper Rash Cream is formulated to soothe and prevent irritation in the diaper area. Containing natural zinc oxide, aloe vera, and chamomile, it creates a protective barrier while calming redness and discomfort. The cream is gentle, hypoallergenic, and free from harsh chemicals, making it safe for frequent use. It absorbs quickly without leaving sticky residue, keeping the skin soft and dry. Ideal for newborns and infants, this cream supports healthy skin, protects against rashes, and provides comfort. Regular application ensures babies stay happy, comfortable, and rash-free throughout the day.",
      "additional_info": {
        "material": "Cream with zinc oxide, aloe vera, chamomile",
        "color": "White",
        "weight": "100g",
        "dimensions": "Height: 5cm, Diameter: 5cm",
        "care_instructions": "Apply to clean, dry skin; store in cool place",
        "age_range": "0-24 months",
        "brand": "BabyCare",
        "model": "BC-RC01",
        "origin": "USA"
      },
      "price": 14,
      "quantity": 120,
      "shippingFee": 15,
      "tags": [{ "name": "Baby" }, { "name": "Rash Cream" }],
      "product_type": "simple"
    },
    {
      "name": "Soothing Baby Oil",
      "category": "Baby Products",
      "subCategory": "Bath & Skincare",
      "description": "Gentle baby oil that moisturizes and softens skin after bath.",
      "product_details": "Soothing Baby Oil is a lightweight, gentle oil formulated to nourish and protect infant skin. Enriched with natural plant oils such as almond and jojoba, it locks in moisture and maintains skin softness. Perfect for daily massage, it promotes relaxation and healthy skin development. Hypoallergenic and free of synthetic fragrances, this oil is safe for sensitive baby skin. It absorbs easily without leaving a greasy residue and can be used on body and scalp. Dermatologically tested, Soothing Baby Oil ensures hydration, protection, and a soothing sensory experience for babies after bath or anytime skin needs gentle care.",
      "additional_info": {
        "material": "Natural almond oil, jojoba oil",
        "color": "Clear",
        "weight": "150ml",
        "dimensions": "Height: 18cm, Width: 4cm",
        "care_instructions": "Apply gently; store away from direct sunlight",
        "age_range": "0-24 months",
        "brand": "BabyCare",
        "model": "BC-BO01",
        "origin": "USA"
      },
      "price": 16,
      "quantity": 100,
      "shippingFee": 15,
      "tags": [{ "name": "Baby" }, { "name": "Oil" }],
      "product_type": "simple"
    },
    {
      "name": "Baby Bath Sponge Set",
      "category": "Baby Products",
      "subCategory": "Bath & Skincare",
      "description": "Soft and gentle sponges for safe and fun baby bath time.",
      "product_details": "The Baby Bath Sponge Set includes soft, hypoallergenic sponges designed for gentle cleansing during bath time. Crafted from high-quality, non-toxic materials, they provide a soft touch on sensitive baby skin while removing dirt and impurities. Ergonomic shapes ensure easy handling by parents and comfort for babies. The set encourages sensory play and makes bath time enjoyable, safe, and effective. Easy to rinse and quick-drying, the sponges maintain hygiene and durability. Ideal for infants 0-24 months, these sponges enhance bath routines by combining practicality, safety, and comfort.",
      "additional_info": {
        "material": "Non-toxic foam and soft polyester fibers",
        "color": "Pastel mix",
        "weight": "50g per sponge",
        "dimensions": "10cm x 10cm x 3cm",
        "care_instructions": "Rinse thoroughly after use; air dry",
        "age_range": "0-24 months",
        "brand": "SoftBaby",
        "model": "SB-BS01",
        "origin": "USA"
      },
      "price": 12,
      "quantity": 80,
      "shippingFee": 15,
      "tags": [{ "name": "Baby" }, { "name": "Bath Sponge" }],
      "product_type": "simple"
    },
    {
      "name": "Baby Moisturizing Wipes",
      "category": "Baby Products",
      "subCategory": "Bath & Skincare",
      "description": "Soft, hypoallergenic wipes for cleaning and moisturizing delicate skin.",
      "product_details": "Baby Moisturizing Wipes are designed for gentle cleansing and hydration of sensitive skin. Infused with aloe vera and chamomile, they remove dirt and impurities while keeping the skin soft and moisturized. Hypoallergenic, alcohol-free, and free from parabens, these wipes are safe for daily use on newborns and infants. Each wipe is thick, durable, and soft, preventing irritation during cleaning. Ideal for diaper changes, hands, and face, these wipes provide a convenient, effective, and safe solution for busy parents while promoting skin health and comfort.",
      "additional_info": {
        "material": "Non-woven fabric with aloe vera and chamomile",
        "color": "White",
        "weight": "500g pack",
        "dimensions": "20cm x 15cm per wipe",
        "care_instructions": "Dispose after single use; store in a sealed package",
        "age_range": "0-24 months",
        "brand": "BabyCare",
        "model": "BC-WP01",
        "origin": "USA"
      },
      "price": 10,
      "quantity": 200,
      "shippingFee": 15,
      "tags": [{ "name": "Baby" }, { "name": "Wipes" }],
      "product_type": "simple"
    },
    {
      "name": "Soothing Baby Bath Gel",
      "category": "Baby Products",
      "subCategory": "Bath & Skincare",
      "description": "Gentle bath gel that cleanses while soothing sensitive skin.",
      "product_details": "Soothing Baby Bath Gel is a gentle, tear-free cleanser enriched with natural ingredients like chamomile and calendula. It cleanses without drying the skin, maintaining natural moisture balance. Suitable for daily use, the bath gel promotes skin health, reduces irritation, and provides a calming scent for a relaxing bath experience. Hypoallergenic, dermatologically tested, and free from harmful chemicals, it ensures safe use for newborns and infants. The soft lather makes bath time enjoyable, while the nourishing formula supports healthy, hydrated, and comfortable baby skin throughout the day.",
      "additional_info": {
        "material": "Liquid with chamomile and calendula extract",
        "color": "Light yellow",
        "weight": "250ml",
        "dimensions": "Height: 18cm, Width: 5cm",
        "care_instructions": "Rinse thoroughly; avoid eye contact",
        "age_range": "0-24 months",
        "brand": "BabyCare",
        "model": "BC-BG01",
        "origin": "USA"
      },
      "price": 14,
      "quantity": 90,
      "shippingFee": 15,
      "tags": [{ "name": "Baby" }, { "name": "Bath Gel" }],
      "product_type": "simple"
    },
    {
      "name": "Hypoallergenic Baby Powder",
      "category": "Baby Products",
      "subCategory": "Bath & Skincare",
      "description": "Lightweight powder that absorbs moisture and keeps skin dry.",
      "product_details": "Hypoallergenic Baby Powder is formulated to keep infants’ skin dry, soft, and comfortable. The talc-free, natural formulation gently absorbs excess moisture and reduces friction in sensitive areas, preventing irritation and rashes. Safe for daily use, the powder is dermatologist-tested and free from harmful chemicals, fragrances, or allergens. Ideal for diaper area and folds, it ensures a soothing touch while maintaining skin health. The fine, lightweight texture makes application smooth and mess-free. Regular use promotes comfort, prevents chafing, and leaves skin feeling fresh, soft, and healthy.",
      "additional_info": {
        "material": "Cornstarch-based powder with natural minerals",
        "color": "White",
        "weight": "150g",
        "dimensions": "Height: 12cm, Diameter: 5cm",
        "care_instructions": "Apply sparingly; store in cool, dry place",
        "age_range": "0-24 months",
        "brand": "BabyCare",
        "model": "BC-BP01",
        "origin": "USA"
      },
      "price": 8,
      "quantity": 100,
      "shippingFee": 15,
      "tags": [{ "name": "Baby" }, { "name": "Powder" }],
      "product_type": "simple"
    },
    {
      "name": "Natural Baby Soap Bar",
      "category": "Baby Products",
      "subCategory": "Bath & Skincare",
      "description": "Mild soap bar made with natural ingredients for sensitive skin.",
      "product_details": "Natural Baby Soap Bar is crafted from gentle, organic ingredients to cleanse without drying or irritating sensitive skin. Enriched with coconut oil, shea butter, and chamomile, it maintains skin hydration, softness, and comfort. Free from artificial fragrances, colors, and harsh chemicals, it is ideal for newborns and infants. The soap lathers easily, providing a soothing bath experience. Dermatologist-tested and hypoallergenic, it helps maintain healthy skin while promoting gentle cleansing. Compact and easy to store, this soap bar is perfect for daily use at home or on-the-go, combining safety, nourishment, and mildness for delicate baby skin.",
      "additional_info": {
        "material": "Organic coconut oil, shea butter, chamomile",
        "color": "Cream",
        "weight": "100g",
        "dimensions": "Length: 8cm, Width: 5cm, Height: 2cm",
        "care_instructions": "Store in a dry place; avoid direct moisture",
        "age_range": "0-24 months",
        "brand": "BabyCare",
        "model": "BC-SB01",
        "origin": "USA"
      },
      "price": 10,
      "quantity": 80,
      "shippingFee": 15,
      "tags": [{ "name": "Baby" }, { "name": "Soap Bar" }],
      "product_type": "simple"
    },
    {
      "name": "Cotton Baby Bedding Set",
      "category": "Baby Products",
      "subCategory": "Bedding",
      "description": "Soft and comfortable bedding set for newborns and infants.",
      "product_details": "The Cotton Baby Bedding Set is crafted from 100% premium cotton, providing a soft, breathable, and hypoallergenic sleeping environment for newborns and infants. The set includes a fitted sheet, pillow cover, and blanket, all designed with gentle pastel colors and playful patterns. Machine washable and durable, the fabrics maintain softness even after multiple washes. Designed to support healthy sleep and skin comfort, this bedding set is free from harmful dyes and chemicals. Perfect for cribs, bassinets, or toddler beds, it ensures safety, comfort, and durability while creating a cozy and nurturing sleep environment for babies.",
      "additional_info": {
        "material": "100% cotton",
        "color": "Pastel Blue",
        "weight": "1.5kg",
        "dimensions": "Fitted Sheet: 120x60cm, Blanket: 100x70cm, Pillow: 30x20cm",
        "care_instructions": "Machine wash cold; tumble dry low; do not bleach",
        "age_range": "0-24 months",
        "brand": "BabyComfort",
        "model": "BC-BD01",
        "origin": "USA",
        "pattern": "Stars and clouds"
      },
      "price": 50,
      "quantity": 30,
      "shippingFee": 15,
      "tags": [{ "name": "Baby" }, { "name": "Bedding" }],
      "product_type": "simple"
    },
    {
      "name": "Organic Cotton Baby Bedding Set",
      "category": "Baby Products",
      "subCategory": "Bedding",
      "description": "Eco-friendly organic cotton bedding for sensitive baby skin.",
      "product_details": "The Organic Cotton Baby Bedding Set is made from certified organic cotton that is free from pesticides and harmful chemicals, providing a safe and gentle environment for newborns and infants. This eco-friendly bedding includes a fitted sheet, pillow cover, and light blanket. The breathable fabrics maintain comfort and softness, ensuring restful sleep. Designed for durability, the set withstands frequent washing while preserving its texture and colors. With hypoallergenic properties and soft pastel designs, this bedding promotes a healthy sleep routine while being kind to the environment. Perfect for cribs and bassinets.",
      "additional_info": {
        "material": "100% organic cotton",
        "color": "Cream",
        "weight": "1.6kg",
        "dimensions": "Fitted Sheet: 120x60cm, Blanket: 100x70cm, Pillow: 30x20cm",
        "care_instructions": "Machine wash cold; air dry recommended",
        "age_range": "0-24 months",
        "brand": "EcoBaby",
        "model": "EB-BD01",
        "origin": "USA",
        "pattern": "Floral"
      },
      "price": 60,
      "quantity": 25,
      "shippingFee": 15,
      "tags": [{ "name": "Baby" }, { "name": "Organic Bedding" }],
      "product_type": "simple"
    },
    {
      "name": "Soft Plush Baby Bedding Set",
      "category": "Baby Products",
      "subCategory": "Bedding",
      "description": "Cozy plush bedding for warmth and comfort during sleep.",
      "product_details": "The Soft Plush Baby Bedding Set is designed to provide warmth, comfort, and a cozy sleeping environment for infants. Made with high-quality plush materials, this set includes a soft blanket, fitted sheet, and pillow cover. The fabric is hypoallergenic, gentle on delicate skin, and machine washable for easy cleaning. Soft textures and pastel colors create a soothing environment, promoting restful sleep. Perfect for colder climates or for babies who need extra warmth, this bedding set combines durability, softness, and safety, offering an ideal solution for parents looking to provide maximum comfort during sleep time.",
      "additional_info": {
        "material": "Plush polyester",
        "color": "Light Pink",
        "weight": "2kg",
        "dimensions": "Fitted Sheet: 120x60cm, Blanket: 110x80cm, Pillow: 30x20cm",
        "care_instructions": "Machine wash cold; gentle cycle; tumble dry low",
        "age_range": "0-24 months",
        "brand": "SoftBaby",
        "model": "SB-BD01",
        "origin": "USA",
        "pattern": "Solid pastel"
      },
      "price": 70,
      "quantity": 20,
      "shippingFee": 15,
      "tags": [{ "name": "Baby" }, { "name": "Plush Bedding" }],
      "product_type": "simple"
    },
    {
      "name": "Luxury Baby Bedding Set",
      "category": "Baby Products",
      "subCategory": "Bedding",
      "description": "Premium bedding set with high-quality fabrics and elegant designs.",
      "product_details": "The Luxury Baby Bedding Set is crafted with fine fabrics such as Egyptian cotton and soft muslin, providing a premium sleeping experience for infants. The set includes a fitted sheet, pillow cover, blanket, and crib bumper. Elegant embroidery and delicate pastel designs add a touch of sophistication to your baby’s nursery. Breathable, hypoallergenic, and durable, the fabrics ensure comfort and safety while maintaining softness after multiple washes. Ideal for parents seeking a luxurious, comfortable, and visually appealing bedding set for their newborns or toddlers. Designed for long-lasting use and premium feel.",
      "additional_info": {
        "material": "Egyptian cotton and muslin",
        "color": "White with pastel accents",
        "weight": "2.2kg",
        "dimensions": "Fitted Sheet: 120x60cm, Blanket: 110x80cm, Pillow: 30x20cm, Crib Bumper: 120x30cm",
        "care_instructions": "Machine wash gentle; tumble dry low",
        "age_range": "0-24 months",
        "brand": "BabyLuxury",
        "model": "BL-BD01",
        "origin": "USA",
        "pattern": "Elegant embroidery"
      },
      "price": 120,
      "quantity": 15,
      "shippingFee": 15,
      "tags": [{ "name": "Baby" }, { "name": "Luxury Bedding" }],
      "product_type": "simple"
    },
    {
      "name": "Portable Baby Bedding Set",
      "category": "Baby Products",
      "subCategory": "Bedding",
      "description": "Compact bedding set ideal for travel and outdoor naps.",
      "product_details": "The Portable Baby Bedding Set is designed for parents on the go, providing comfort and safety during travel, naps, or visits. Lightweight and foldable, this set includes a fitted sheet, blanket, and pillow cover. Made from soft, hypoallergenic cotton, it ensures gentle contact with delicate baby skin. The bedding is easy to carry, clean, and store, making it perfect for cribs, strollers, or travel cots. Durable and breathable, this set guarantees a comfortable sleep environment wherever your baby goes. Soft colors and simple designs add convenience and style while maintaining comfort.",
      "additional_info": {
        "material": "100% cotton",
        "color": "Mint Green",
        "weight": "1.2kg",
        "dimensions": "Fitted Sheet: 120x60cm, Blanket: 100x70cm, Pillow: 30x20cm",
        "care_instructions": "Machine wash cold; tumble dry low",
        "age_range": "0-24 months",
        "brand": "TravelBaby",
        "model": "TB-BD01",
        "origin": "USA",
        "pattern": "Solid color"
      },
      "price": 45,
      "quantity": 40,
      "shippingFee": 15,
      "tags": [{ "name": "Baby" }, { "name": "Portable Bedding" }],
      "product_type": "simple"
    },
    {
      "name": "Waterproof Baby Bedding Set",
      "category": "Baby Products",
      "subCategory": "Bedding",
      "description": "Bedding set with waterproof lining to protect against spills and accidents.",
      "product_details": "The Waterproof Baby Bedding Set includes a fitted sheet, blanket, and pillow cover with an integrated waterproof lining. Designed for infants and toddlers, it protects the mattress and bedding from spills, leaks, and accidents while maintaining comfort. The soft cotton exterior ensures gentle contact with baby skin, while the breathable waterproof layer keeps the baby dry. Machine washable and durable, this bedding set provides convenience, hygiene, and comfort. Perfect for everyday use, daycare, or travel, it combines safety, practicality, and softness to create a worry-free sleeping environment for babies.",
      "additional_info": {
        "material": "Cotton exterior with waterproof layer",
        "color": "Light Yellow",
        "weight": "1.8kg",
        "dimensions": "Fitted Sheet: 120x60cm, Blanket: 100x70cm, Pillow: 30x20cm",
        "care_instructions": "Machine wash cold; do not bleach",
        "age_range": "0-24 months",
        "brand": "SafeSleep",
        "model": "SS-BD01",
        "origin": "USA",
        "pattern": "Polka dots"
      },
      "price": 55,
      "quantity": 35,
      "shippingFee": 15,
      "tags": [{ "name": "Baby" }, { "name": "Waterproof Bedding" }],
      "product_type": "simple"
    },
    {
      "name": "Breathable Mesh Baby Bedding Set",
      "category": "Baby Products",
      "subCategory": "Bedding",
      "description": "Lightweight bedding set with breathable mesh for air circulation.",
      "product_details": "The Breathable Mesh Baby Bedding Set includes a fitted sheet, pillow cover, and lightweight blanket made from cotton and mesh materials that allow maximum air circulation. Designed for hot climates or warmer seasons, this set ensures that babies stay cool and comfortable while sleeping. Hypoallergenic and soft, the fabrics are gentle on sensitive skin. Easy to clean and maintain, the bedding provides a hygienic and cozy sleeping environment. The pastel colors and breathable mesh design combine functionality, comfort, and safety, promoting healthy sleep and well-being for infants and toddlers.",
      "additional_info": {
        "material": "Cotton and breathable mesh",
        "color": "Light Gray",
        "weight": "1.3kg",
        "dimensions": "Fitted Sheet: 120x60cm, Blanket: 100x70cm, Pillow: 30x20cm",
        "care_instructions": "Machine wash cold; air dry recommended",
        "age_range": "0-24 months",
        "brand": "CoolBaby",
        "model": "CB-BD01",
        "origin": "USA",
        "pattern": "Mesh panels with pastel trim"
      },
      "price": 50,
      "quantity": 25,
      "shippingFee": 15,
      "tags": [{ "name": "Baby" }, { "name": "Breathable Bedding" }],
      "product_type": "simple"
    },
    {
      "name": "Seasonal Baby Bedding Set",
      "category": "Baby Products",
      "subCategory": "Bedding",
      "description": "Bedding set designed for all seasons with temperature-regulating fabrics.",
      "product_details": "The Seasonal Baby Bedding Set features temperature-regulating fabrics that keep babies comfortable in both warm and cool conditions. The set includes a fitted sheet, pillow cover, and blanket made from soft cotton blends that provide gentle touch and breathability. Hypoallergenic and safe for sensitive skin, it supports healthy sleep cycles year-round. Durable and machine washable, the bedding retains softness and color even after multiple washes. Ideal for cribs and bassinets, it combines comfort, safety, and practicality, making it a versatile solution for infants in any season.",
      "additional_info": {
        "material": "Cotton blend with temperature-regulating fibers",
        "color": "Mint and White",
        "weight": "1.5kg",
        "dimensions": "Fitted Sheet: 120x60cm, Blanket: 100x70cm, Pillow: 30x20cm",
        "care_instructions": "Machine wash cold; tumble dry low",
        "age_range": "0-24 months",
        "brand": "AllSeasonBaby",
        "model": "ASB-BD01",
        "origin": "USA",
        "pattern": "Stripes and solids"
      },
      "price": 60,
      "quantity": 30,
      "shippingFee": 15,
      "tags": [{ "name": "Baby" }, { "name": "Seasonal Bedding" }],
      "product_type": "simple"
    },
    {
      "name": "Eco-Friendly Bamboo Baby Bedding Set",
      "category": "Baby Products",
      "subCategory": "Bedding",
      "description": "Bedding set made from sustainable bamboo fibers for softness and breathability.",
      "product_details": "The Eco-Friendly Bamboo Baby Bedding Set is made from 100% bamboo-derived fibers, offering exceptional softness, breathability, and natural antibacterial properties. The set includes a fitted sheet, blanket, and pillow cover with gentle pastel patterns. Ideal for sensitive skin, it provides hypoallergenic and chemical-free comfort. Bamboo fibers are highly durable and maintain softness after multiple washes. This sustainable bedding promotes a cozy, safe, and eco-conscious sleep environment for infants. Lightweight, breathable, and gentle, it is perfect for all seasons and combines environmental responsibility with maximum comfort and durability.",
      "additional_info": {
        "material": "100% bamboo fibers",
        "color": "Natural Beige",
        "weight": "1.4kg",
        "dimensions": "Fitted Sheet: 120x60cm, Blanket: 100x70cm, Pillow: 30x20cm",
        "care_instructions": "Machine wash cold; air dry recommended",
        "age_range": "0-24 months",
        "brand": "EcoBaby",
        "model": "EB-BD02",
        "origin": "USA",
        "pattern": "Pastel nature prints"
      },
      "price": 65,
      "quantity": 20,
      "shippingFee": 15,
      "tags": [{ "name": "Baby" }, { "name": "Bamboo Bedding" }],
      "product_type": "simple"
    },
    {
      "name": "Wooden Baby Crib",
      "category": "Baby Products",
      "subCategory": "Furniture",
      "description": "Sturdy wooden crib with adjustable mattress height for newborns.",
      "product_details": "The Wooden Baby Crib is crafted from high-quality solid wood, providing a safe and durable sleeping environment for infants. The crib features an adjustable mattress height, allowing parents to lower the mattress as the baby grows for added safety. Smooth rounded edges, non-toxic finishes, and secure slats ensure maximum protection against accidents. Designed for easy assembly and stability, the crib supports the baby’s growth and comfort. Its timeless design fits most nursery decors. Hypoallergenic materials and eco-friendly finishes make this crib ideal for sensitive newborn skin and ensure a healthy, safe sleeping space for infants.",
      "additional_info": {
        "material": "Solid wood with non-toxic finish",
        "color": "White",
        "weight": "25kg",
        "dimensions": "Length: 130cm, Width: 70cm, Height: 90cm",
        "care_instructions": "Wipe with a damp cloth; avoid harsh chemicals",
        "age_range": "0-36 months",
        "brand": "SafeSleep",
        "model": "SS-CR01",
        "origin": "USA",
        "assembly_required": "Yes"
      },
      "price": 250,
      "quantity": 15,
      "shippingFee": 15,
      "tags": [{ "name": "Baby" }, { "name": "Crib" }],
      "product_type": "simple"
    },
    {
      "name": "Convertible Baby Crib",
      "category": "Baby Products",
      "subCategory": "Furniture",
      "description": "Crib that converts into toddler bed and daybed as the child grows.",
      "product_details": "The Convertible Baby Crib is a versatile and durable furniture piece designed to grow with your child. Crafted from solid wood with non-toxic paint, it transforms from a crib into a toddler bed and eventually a daybed, providing long-term usability. Adjustable mattress heights, sturdy construction, and smooth finishes ensure safety and comfort. Hypoallergenic materials make it safe for sensitive infant skin. Easy assembly and sleek design make it a stylish addition to any nursery. This crib supports healthy sleep, durability, and functionality, making it a cost-effective choice for parents looking for longevity and safety in nursery furniture.",
      "additional_info": {
        "material": "Solid wood with non-toxic paint",
        "color": "Natural wood",
        "weight": "28kg",
        "dimensions": "Length: 140cm, Width: 75cm, Height: 95cm",
        "care_instructions": "Wipe with damp cloth; avoid harsh cleaners",
        "age_range": "0-72 months",
        "brand": "GrowWithMe",
        "model": "GWM-CR01",
        "origin": "USA",
        "assembly_required": "Yes"
      },
      "price": 300,
      "quantity": 12,
      "shippingFee": 15,
      "tags": [{ "name": "Baby" }, { "name": "Convertible Crib" }],
      "product_type": "simple"
    },
    {
      "name": "Portable Baby Bassinet",
      "category": "Baby Products",
      "subCategory": "Furniture",
      "description": "Lightweight and foldable bassinet ideal for travel or small spaces.",
      "product_details": "The Portable Baby Bassinet provides a comfortable and safe sleeping space for newborns and infants, especially suitable for travel or compact living spaces. Made with breathable mesh sides and soft padded fabric, it ensures airflow and gentle support. The bassinet is foldable for easy portability and storage, with sturdy legs for stability. Hypoallergenic and easy to clean, it provides convenience for parents while maintaining safety standards. Perfect for co-sleeping, naps, or travel, this bassinet combines comfort, mobility, and safety, making it a practical choice for busy families who need a versatile sleeping solution for their baby.",
      "additional_info": {
        "material": "Breathable mesh with padded cotton fabric",
        "color": "Gray",
        "weight": "7kg",
        "dimensions": "Length: 85cm, Width: 45cm, Height: 60cm",
        "care_instructions": "Spot clean with mild detergent; air dry",
        "age_range": "0-6 months",
        "brand": "SafeRide",
        "model": "SR-BS01",
        "origin": "USA",
        "assembly_required": "Minimal"
      },
      "price": 200,
      "quantity": 20,
      "shippingFee": 15,
      "tags": [{ "name": "Baby" }, { "name": "Bassinet" }],
      "product_type": "simple"
    },
    {
      "name": "Baby Changing Table",
      "category": "Baby Products",
      "subCategory": "Furniture",
      "description": "Functional changing table with storage shelves and safety rails.",
      "product_details": "The Baby Changing Table provides a safe and convenient area for diaper changes and dressing. Constructed from solid wood with non-toxic finishes, it features a spacious top surface with raised safety rails, preventing accidental falls. Multiple shelves and drawers offer ample storage for diapers, wipes, clothes, and other essentials, keeping everything organized and within reach. The table is sturdy, durable, and easy to assemble. Smooth edges, ergonomic height, and stable construction ensure comfort and safety for both baby and parents. Ideal for nurseries, this changing table combines practicality, durability, and style.",
      "additional_info": {
        "material": "Solid wood with non-toxic finish",
        "color": "White",
        "weight": "20kg",
        "dimensions": "Length: 100cm, Width: 50cm, Height: 90cm",
        "care_instructions": "Wipe with damp cloth; avoid chemical cleaners",
        "age_range": "0-36 months",
        "brand": "SafeHome",
        "model": "SH-CT01",
        "origin": "USA",
        "assembly_required": "Yes"
      },
      "price": 180,
      "quantity": 15,
      "shippingFee": 15,
      "tags": [{ "name": "Baby" }, { "name": "Changing Table" }],
      "product_type": "simple"
    },
    {
      "name": "Nursery Storage Organizer",
      "category": "Baby Products",
      "subCategory": "Furniture",
      "description": "Multi-compartment storage unit to organize baby essentials.",
      "product_details": "The Nursery Storage Organizer is designed to keep all baby essentials neatly arranged and easily accessible. Made from sturdy wood and reinforced fabric bins, it features multiple compartments for diapers, toys, clothing, and bath items. The smooth edges and safe finishes ensure baby safety, while the modular design allows flexibility in organizing items. Lightweight yet durable, it can be placed anywhere in the nursery. This organizer enhances convenience and efficiency for parents, promoting a tidy and functional nursery environment, while keeping frequently used items within easy reach.",
      "additional_info": {
        "material": "Solid wood frame with fabric bins",
        "color": "Natural wood with pastel bins",
        "weight": "12kg",
        "dimensions": "Length: 90cm, Width: 40cm, Height: 90cm",
        "care_instructions": "Wipe wood with damp cloth; fabric bins machine washable",
        "age_range": "0-36 months",
        "brand": "BabyComfort",
        "model": "BC-OR01",
        "origin": "USA",
        "assembly_required": "Yes"
      },
      "price": 120,
      "quantity": 25,
      "shippingFee": 15,
      "tags": [{ "name": "Baby" }, { "name": "Storage" }],
      "product_type": "simple"
    },
    {
      "name": "Rocking Baby Chair",
      "category": "Baby Products",
      "subCategory": "Furniture",
      "description": "Comfortable rocking chair for soothing and feeding babies.",
      "product_details": "The Rocking Baby Chair is designed to provide comfort to both baby and parent during feeding, reading, or soothing sessions. Constructed from solid wood with a smooth, non-toxic finish, the chair gently rocks back and forth for calming motion. Cushioned seat and back support offer ergonomic comfort, while safety straps ensure infant security during sitting. Lightweight yet sturdy, the chair is perfect for nursery or living room use. The classic design and gentle rocking motion create a relaxing environment for bonding, feeding, and nurturing your baby.",
      "additional_info": {
        "material": "Solid wood with cushioned fabric seat",
        "color": "White with pastel cushion",
        "weight": "15kg",
        "dimensions": "Length: 80cm, Width: 50cm, Height: 90cm",
        "care_instructions": "Wipe with damp cloth; spot clean fabric",
        "age_range": "0-24 months",
        "brand": "SafeRock",
        "model": "SR-RC01",
        "origin": "USA",
        "assembly_required": "Yes"
      },
      "price": 150,
      "quantity": 20,
      "shippingFee": 15,
      "tags": [{ "name": "Baby" }, { "name": "Rocking Chair" }],
      "product_type": "simple"
    },
    {
      "name": "Baby Toy Shelf",
      "category": "Baby Products",
      "subCategory": "Furniture",
      "description": "Compact shelf to store and display baby toys and books.",
      "product_details": "The Baby Toy Shelf is a compact and practical storage solution designed to organize toys, books, and small baby items. Made of solid wood with smooth, safe edges and non-toxic paint, it provides durability and safety. Multiple open compartments allow easy access and visibility, encouraging children to play and explore while keeping the nursery tidy. Lightweight and easy to assemble, the shelf fits into corners or along walls. Ideal for fostering organizational habits, it combines functionality, safety, and child-friendly design.",
      "additional_info": {
        "material": "Solid wood with non-toxic paint",
        "color": "Pastel Multi-color",
        "weight": "10kg",
        "dimensions": "Length: 80cm, Width: 25cm, Height: 80cm",
        "care_instructions": "Wipe with damp cloth; avoid harsh cleaners",
        "age_range": "0-36 months",
        "brand": "PlaySafe",
        "model": "PS-TS01",
        "origin": "USA",
        "assembly_required": "Yes"
      },
      "price": 80,
      "quantity": 30,
      "shippingFee": 15,
      "tags": [{ "name": "Baby" }, { "name": "Toy Shelf" }],
      "product_type": "simple"
    },
    {
      "name": "Multi-Function Baby Dresser",
      "category": "Baby Products",
      "subCategory": "Furniture",
      "description": "Dresser with drawers and changing top, perfect for nursery organization.",
      "product_details": "The Multi-Function Baby Dresser combines storage and convenience, featuring multiple drawers for clothing, accessories, and essentials, along with a removable changing top. Constructed from solid wood with a smooth non-toxic finish, it provides a safe and durable storage solution. The ergonomic height and easy-glide drawers ensure comfort and accessibility for parents. Stylish design complements most nursery decors. Hypoallergenic materials and robust construction make it ideal for everyday use. This dresser supports organized living while keeping all baby necessities within easy reach.",
      "additional_info": {
        "material": "Solid wood with non-toxic finish",
        "color": "White",
        "weight": "35kg",
        "dimensions": "Length: 100cm, Width: 50cm, Height: 95cm",
        "care_instructions": "Wipe with damp cloth; avoid chemical cleaners",
        "age_range": "0-36 months",
        "brand": "SafeHome",
        "model": "SH-DR01",
        "origin": "USA",
        "assembly_required": "Yes"
      },
      "price": 220,
      "quantity": 10,
      "shippingFee": 15,
      "tags": [{ "name": "Baby" }, { "name": "Dresser" }],
      "product_type": "simple"
    },
    {
      "name": "Baby Rocking Bassinet",
      "category": "Baby Products",
      "subCategory": "Furniture",
      "description": "Rocking bassinet with soft padding for newborn sleep and comfort.",
      "product_details": "The Baby Rocking Bassinet combines gentle rocking motion with a padded sleeping area to soothe newborns. Constructed from durable wood and soft, hypoallergenic fabrics, it ensures safety and comfort. Mesh sides provide breathability and visibility, while the gentle rocking motion aids in calming and sleep. Lightweight design allows easy relocation, while the sturdy base ensures stability. Perfect for co-sleeping or nursery placement, this bassinet promotes secure, comfortable sleep and makes nighttime care and feeding more convenient for parents.",
      "additional_info": {
        "material": "Wood frame with padded cotton fabric and mesh sides",
        "color": "Gray with White padding",
        "weight": "9kg",
        "dimensions": "Length: 90cm, Width: 50cm, Height: 60cm",
        "care_instructions": "Spot clean; machine wash padding cover",
        "age_range": "0-6 months",
        "brand": "SafeRock",
        "model": "SR-BS02",
        "origin": "USA",
        "assembly_required": "Yes"
      },
      "price": 210,
      "quantity": 15,
      "shippingFee": 15,
      "tags": [{ "name": "Baby" }, { "name": "Rocking Bassinet" }],
      "product_type": "simple"
    },
    {
      "name": "Adjustable Baby Safety Gate",
      "category": "Baby Products",
      "subCategory": "Baby Safety",
      "description": "Durable and adjustable safety gate to keep babies secure in different spaces.",
      "product_details": "The Adjustable Baby Safety Gate is designed to provide a secure barrier for infants and toddlers, preventing access to stairs, kitchens, or other hazardous areas. Made from sturdy metal with a non-toxic powder-coated finish, it is durable, long-lasting, and safe. The gate features an easy-to-use one-hand locking mechanism, allowing parents to open and close it quickly while keeping children safe. Adjustable width ensures it fits doorways, hallways, and staircases. Installation is simple with included hardware, and the gate can be pressure-mounted or wall-mounted for stability. Its sleek design complements home interiors while offering reliable safety and peace of mind.",
      "additional_info": {
        "material": "Metal with non-toxic powder coating",
        "color": "White",
        "weight": "5kg",
        "dimensions": "Adjustable width: 70-100cm, Height: 75cm",
        "care_instructions": "Wipe with damp cloth; avoid abrasive cleaners",
        "age_range": "6-24 months",
        "brand": "SafeHome",
        "model": "SH-GT01",
        "origin": "USA",
        "installation_type": "Pressure-mounted or wall-mounted"
      },
      "price": 45,
      "quantity": 40,
      "shippingFee": 15,
      "tags": [{ "name": "Baby" }, { "name": "Safety Gate" }],
      "product_type": "simple"
    },
    {
      "name": "Corner Protectors Set",
      "category": "Baby Products",
      "subCategory": "Baby Safety",
      "description": "Soft corner protectors to prevent injuries from sharp furniture edges.",
      "product_details": "The Corner Protectors Set includes multiple soft, flexible guards that attach easily to sharp furniture corners, reducing the risk of injury for crawling babies and toddlers. Made from high-quality, non-toxic silicone, these protectors provide a cushioned barrier while being transparent or color-matched to furniture for minimal visual impact. Easy to install with included adhesive, they are removable without leaving residue. Suitable for tables, countertops, shelves, and other furniture edges. Hypoallergenic and safe for baby contact, these corner protectors enhance home safety and provide peace of mind for parents concerned about bumps and bruises.",
      "additional_info": {
        "material": "Non-toxic silicone",
        "color": "Transparent",
        "weight": "200g",
        "dimensions": "5cm x 5cm x 5cm per protector",
        "care_instructions": "Wipe clean with mild soap and water",
        "age_range": "6-36 months",
        "brand": "SafeBaby",
        "model": "SB-CP01",
        "origin": "USA",
        "quantity_in_set": 12
      },
      "price": 15,
      "quantity": 100,
      "shippingFee": 15,
      "tags": [{ "name": "Baby" }, { "name": "Corner Safety" }],
      "product_type": "simple"
    },
    {
      "name": "Cabinet Safety Locks",
      "category": "Baby Products",
      "subCategory": "Baby Safety",
      "description": "Adjustable locks to prevent babies from opening cabinets and drawers.",
      "product_details": "The Cabinet Safety Locks provide a simple and effective way to secure cabinets, drawers, and appliances from curious toddlers. Made from durable ABS plastic, these locks are non-toxic, sturdy, and child-resistant. Adjustable design allows them to fit various cabinet sizes and configurations. Installation is easy with included adhesive strips or screws, ensuring a secure fit. Removable without damaging furniture. Protects babies from harmful substances, sharp objects, or accidents. Ideal for kitchens, bathrooms, and play areas. Ensures peace of mind while maintaining home functionality and safety for young children.",
      "additional_info": {
        "material": "Durable ABS plastic",
        "color": "White",
        "weight": "150g",
        "dimensions": "Lock length: 12cm, adjustable strap: 5-20cm",
        "care_instructions": "Wipe clean with damp cloth",
        "age_range": "6-36 months",
        "brand": "SafeHome",
        "model": "SH-CL01",
        "origin": "USA",
        "quantity_in_set": 6
      },
      "price": 20,
      "quantity": 80,
      "shippingFee": 15,
      "tags": [{ "name": "Baby" }, { "name": "Cabinet Lock" }],
      "product_type": "simple"
    },
    {
      "name": "Door Handle Safety Cover",
      "category": "Baby Products",
      "subCategory": "Baby Safety",
      "description": "Soft and flexible door handle covers to prevent baby finger injuries.",
      "product_details": "The Door Handle Safety Cover is a practical safety device designed to reduce the risk of finger pinches and accidental openings by toddlers. Made from soft, non-toxic silicone, the cover slips over standard door handles and provides cushioning while limiting door movement. Easy to install and remove, it does not damage doors or handles. Enhances home safety for young children and gives parents peace of mind. Transparent design keeps it discreet, blending with home interiors. Ideal for bedrooms, bathrooms, and other areas where child safety is a concern.",
      "additional_info": {
        "material": "Non-toxic silicone",
        "color": "Transparent",
        "weight": "100g",
        "dimensions": "Fits standard door handles 4-5cm diameter",
        "care_instructions": "Wash with mild soap and water",
        "age_range": "6-36 months",
        "brand": "SafeBaby",
        "model": "SB-DH01",
        "origin": "USA",
        "quantity_in_set": 4
      },
      "price": 12,
      "quantity": 120,
      "shippingFee": 15,
      "tags": [{ "name": "Baby" }, { "name": "Door Safety" }],
      "product_type": "simple"
    },
    {
      "name": "Window Guard Bars",
      "category": "Baby Products",
      "subCategory": "Baby Safety",
      "description": "Secure window guard bars to prevent falls and accidents.",
      "product_details": "Window Guard Bars are essential safety devices that prevent babies and toddlers from climbing out of windows or falling. Made from high-strength steel with a powder-coated finish, these bars provide sturdy protection without compromising window functionality. Adjustable width ensures compatibility with different window sizes. Installation hardware included for easy and secure mounting. The bars are rust-resistant, durable, and safe for baby contact. Ideal for nurseries, bedrooms, or any room with accessible windows. Promotes peace of mind for parents while maintaining visibility and ventilation.",
      "additional_info": {
        "material": "Steel with powder-coated finish",
        "color": "White",
        "weight": "8kg",
        "dimensions": "Adjustable width: 60-100cm, Height: 50cm",
        "care_instructions": "Wipe with damp cloth",
        "age_range": "6-36 months",
        "brand": "SafeHome",
        "model": "SH-WB01",
        "origin": "USA",
        "installation_type": "Screw-mounted"
      },
      "price": 75,
      "quantity": 25,
      "shippingFee": 15,
      "tags": [{ "name": "Baby" }, { "name": "Window Safety" }],
      "product_type": "simple"
    },
    {
      "name": "Outlet Safety Covers",
      "category": "Baby Products",
      "subCategory": "Baby Safety",
      "description": "Covers for electrical outlets to protect babies from shocks.",
      "product_details": "Outlet Safety Covers are designed to prevent babies from inserting objects into electrical sockets, reducing the risk of electric shock. Made from durable, non-toxic plastic, these covers are easy to install and remove when needed. Compact and discrete, they fit standard outlets securely without damaging walls or sockets. Ideal for homes with crawling infants or toddlers who explore electrical outlets. Provides peace of mind for parents while maintaining normal outlet accessibility for adults. Each set contains multiple covers to ensure complete coverage throughout the home.",
      "additional_info": {
        "material": "Non-toxic plastic",
        "color": "White",
        "weight": "100g",
        "dimensions": "Fits standard US outlets",
        "care_instructions": "Wipe clean with damp cloth",
        "age_range": "6-36 months",
        "brand": "SafeBaby",
        "model": "SB-OC01",
        "origin": "USA",
        "quantity_in_set": 12
      },
      "price": 10,
      "quantity": 150,
      "shippingFee": 15,
      "tags": [{ "name": "Baby" }, { "name": "Outlet Safety" }],
      "product_type": "simple"
    },
    {
      "name": "Baby Corner Cushions",
      "category": "Baby Products",
      "subCategory": "Baby Safety",
      "description": "Soft cushions to cover table and furniture corners for injury prevention.",
      "product_details": "Baby Corner Cushions provide additional protection for sharp edges on tables, countertops, and furniture. Made from soft, non-toxic rubber or silicone, they absorb impact from accidental bumps. Adhesive backing allows easy installation and removal without leaving marks. Hypoallergenic, durable, and safe for baby contact. Suitable for nurseries, living rooms, and play areas, these cushions create a safer environment for crawling infants and toddlers. They are color-neutral or transparent, maintaining the aesthetics of home furniture while ensuring safety.",
      "additional_info": {
        "material": "Non-toxic rubber/silicone",
        "color": "Transparent",
        "weight": "150g",
        "dimensions": "5cm x 5cm x 5cm per cushion",
        "care_instructions": "Wipe clean with mild soap and water",
        "age_range": "6-36 months",
        "brand": "SafeHome",
        "model": "SH-CC01",
        "origin": "USA",
        "quantity_in_set": 8
      },
      "price": 18,
      "quantity": 80,
      "shippingFee": 15,
      "tags": [{ "name": "Baby" }, { "name": "Corner Cushion" }],
      "product_type": "simple"
    },
    {
      "name": "Baby Anti-Tip Furniture Straps",
      "category": "Baby Products",
      "subCategory": "Baby Safety",
      "description": "Straps to secure furniture and prevent tipping accidents.",
      "product_details": "Baby Anti-Tip Furniture Straps are essential for securing bookshelves, dressers, and other tall furniture to walls, preventing tipping hazards for curious toddlers. Made from strong nylon webbing with secure metal brackets, the straps are durable, reliable, and non-toxic. Adjustable length ensures compatibility with most furniture types. Installation is easy with included screws and anchors, and straps are removable if needed. Provides enhanced home safety, especially in nurseries and play areas. Protects children from potentially serious injuries caused by tipping furniture while maintaining furniture functionality.",
      "additional_info": {
        "material": "Nylon webbing with metal brackets",
        "color": "Black",
        "weight": "500g",
        "dimensions": "Adjustable length: 60-120cm",
        "care_instructions": "Wipe with damp cloth",
        "age_range": "6-36 months",
        "brand": "SafeBaby",
        "model": "SB-FT01",
        "origin": "USA",
        "quantity_in_set": 2
      },
      "price": 25,
      "quantity": 50,
      "shippingFee": 15,
      "tags": [{ "name": "Baby" }, { "name": "Anti-Tip Strap" }],
      "product_type": "simple"
    },
    {
      "name": "Baby Door Stopper",
      "category": "Baby Products",
      "subCategory": "Baby Safety",
      "description": "Soft door stopper to prevent doors from slamming on babies’ fingers.",
      "product_details": "The Baby Door Stopper is designed to prevent doors from closing completely and causing injuries to tiny fingers. Made from soft, durable silicone, it cushions the door and provides safety in nurseries, bedrooms, and play areas. Easy to install and remove without tools. Fits most standard doors and protects against accidental slamming. Provides peace of mind for parents and keeps babies safe during daily activities. Compact and discreet design maintains room aesthetics while enhancing safety.",
      "additional_info": {
        "material": "Soft silicone",
        "color": "White",
        "weight": "50g",
        "dimensions": "Length: 5cm, Width: 2cm, Height: 2cm",
        "care_instructions": "Wash with mild soap and water",
        "age_range": "6-36 months",
        "brand": "SafeHome",
        "model": "SH-DS01",
        "origin": "USA",
        "quantity_in_set": 2
      },
      "price": 8,
      "quantity": 100,
      "shippingFee": 15,
      "tags": [{ "name": "Baby" }, { "name": "Door Stopper" }],
      "product_type": "simple"
    },

    {
      "name": "Classic Aviator Sunglasses - Black Frame",
      "category": "Accessories",
      "subCategory": "Sunglasses",
      "description": "Stylish aviator sunglasses with durable black metal frame and UV protection.",
      "product_details": "High-quality metal frame ensures durability and lightweight comfort. UV400 protection shields eyes from harmful rays. Scratch-resistant lenses for long-term use. Comfortable nose pads and ear hooks. Suitable for daily wear or outdoor activities. Sleek aviator design complements any outfit. Non-slip fit ensures stability. Ideal for travel and sports. Timeless classic design. Protective case included. Durable and fashion-forward.",
      "additional_info": {
        "material": "Metal & Glass",
        "color": "Black",
        "weight": "60g",
        "brand": "SunStyle",
        "model": "SS-AV02"
      },
      "price": 85,
      "sale_price": 70,
      "on_sale": true,
      "sale_start": "2025-11-05T00:00:00Z",
      "sale_end": "2025-12-05T23:59:59Z",
      "quantity": 50,
      "shippingFee": 15,
      "tags": [
        { "name": "Sunglasses" },
        { "name": "UV Protection" },
        { "name": "Metal" }
      ],
      "product_type": "simple"
    }
  ]
}
